{
  "faq_id": 5413219293543562779,
  "language": 0,
  "version": 6,
  "content": "Players must associate a unique phone number to their accounts in order to queue for Ranked matches. If a phone number is removed from an account after association, a new number can be added, but there will be a three-month waiting period before that same number can be associated again.\n[list]\n[*][url=#howto]How do I associate a number to my account?[/url]\n[*][url=#qualnumber]Does my phone number qualify?[/url]\n[*][url=#samenumber]Can I associate the same phone number to multiple Dota accounts?[/url]\n[*][url=#removeprime]How do I remove a phone number from my Dota account?[/url]\t  \t[*][url=#newnumber]What if I get a new phone number?[/url]\n[*][url=#nonumber]What if I do not have a phone?[/url]\n[exclude_realm=china][*][url=#mobileauth]Do I need the Steam Guard Mobile Authenticator to register my phone number?[/url][/exclude_realm]\n[*][url=#overlay]I can\u0027t associate my phone because the Steam overlay is not working.[/url]\n[/list]\n\n[section id=howto]\n[h3]How do I associate a number to my account?[/h3]\nOnce a Dota account has become eligible for ranked, an \u0022Associate Phone With Dota\u0022 option will display within the ranked find match window. After clicking on \u0022Associate Phone With Dota\u0022, the phone number registered to your Steam account will automatically be registered to your Dota account.\n\nIf a phone number has not yet been added to the Steam account you are using, you will be required to do so prior to adding it to your Dota account.\n[/section]\n\n[section id=qualnumber]\n[h3]Does my phone number qualify?[/h3]\nIf you are able to successfully register a number to your Steam account, it will work for Dota as well. Online services that provide virtual phone numbers do not qualify. this includes popular VoIP providers.\n\nPlease note that we do not make exceptions to this requirement. Should your number not qualify, you will need to use a different phone number.\n\nSee the official [url=http://store.steampowered.com/mobile]Steam Mobile[/url] site for information on how to register a qualifying number to a Steam account.\n[/section]\n\n[section id=samenumber]\n[h3]Can I associate the same phone number to multiple Dota accounts?[/h3]\nNo, a phone number may be associated to only one Dota account at a time. If a number is removed from a Dota account, it cannot be used again for three months - this is to prevent the feature from being abused.\n[/section]\n\n[section id=removeprime]\n[h3]How do I remove a phone number from my Dota account?[/h3]\nIn the Dota game client, navigate to the Settings menu, then the Account tab to manage your current phone association.\n\nNote: removing your current phone associated with Dota incurs a 90 day cooldown before that phone number can be added to another Dota account.\n[/section]\n\n[section id=newnumber]\n[h3]What if I get a new phone number?[/h3]\nYou may remove the old phone number from your Dota account and add a new number at any time.\n\nNote: the three month cooldown will only apply to the number that was removed.\n[/section]\n\n[section id=nonumber]\n[h3]What if I do not have a phone?[/h3]\nIf a qualifying phone number cannot be added to your Steam account, you will be unable to add a phone number to your Dota account. Ranked Matchmaking will not be available unless a phone number is added to the account.\n[/section]\n\n[exclude_realm=china][section id=mobileauth]\n[h3]Do I need the Steam Guard Mobile Authenticator to register my phone number?[/h3]\nNo, the Steam Guard Mobile Authenticator is not required to register a phone number to your Dota account.\n\nWe still recommend that you use the Steam Guard Mobile Authenticator. In addition to providing an extra layer of security for your account, adding the Steam Guard Mobile Authenticator gives you full access to trading and the Steam Community Market.\n\nMore information can be found here: [url=https://help.steampowered.com/en/faqs/view/7EFD-3CAE-64D3-1C31]Steam Guard Mobile Authenticator[/url]\n[/section][/exclude_realm]\n\n[section id=overlay]\n[h3]I can\u0027t associate my phone because the Steam overlay is not working.[/h3]\nIf you are having an issue with the Steam overlay, make sure to follow all of the steps outlined in the [url=https://help.steampowered.com/en/faqs/view/3978-072C-18DF-FBF9]Steam Overlay FAQ[/url].\n\nIf you are not able to get the overlay working, you can still associate a phone number by temporarily disabling the Steam overlay for Dota 2. You can do this by right-clicking the game in your Library \u003E selecting \u0027Properties\u0027 \u003E and then un-checking the \u0027Enable Steam Overlay In Game\u0027 box\n[/section]",
  "title": "Adding a Phone Number to a Dota Account",
  "timestamp": "2021-11-03T22:12:11+00:00"
}