{
  "faq_id": 5732710972950444086,
  "language": 0,
  "version": 8,
  "content": "Several options are available to address abusive or inappropriate behaviors encountered while using Steam. There are also practices to keep in mind that can help you avoid these types of behaviors altogether.\n\nIf you are ever experiencing abuse outside of Steam, or if you ever feel that your safety is being threatened, we strongly encourage contacting local emergency or law enforcement services in your area.\n\n\n[h2]What Options Are Available?[/h2]\nThere are different ways to address problematic behavior from other players. You\u0027ll want to use the options that make the most sense for your situation. We are always interested in hearing about your experience, so if an option is missing, let us know.\n\n[list]  \n[*][h3]Reporting Content[/h3]\nIf another player is hosting content that is being used in an abusive or inappropriate manner, we encourage players to utilize our reporting system. Reports are reviewed and typically resolved within 24 hours of submission. You will receive a notification if action is taken.\n\n[url=https://help.steampowered.com/en/faqs/view/4DE7-17AA-0E8B-C1AD]Reporting content within the Steam Community[/url]\n\n[*][h3]Remove Friend[/h3]\nIf you are Steam friends with the other player, you always have the option of ending that relationship. Unfriending will remove the ability for the other player to contact you via Steam, It will also prevent them from viewing any content that you have set to private, or friends only.\n\nTo unfriend someone, navigate to their profile and select the [i]unfriend[/i] option under the [i]...[/i] button\u0027s dropdown. Alternatively, you can use the dropdown next to their profile name in your friends list, selecting the [i]manage[/i] option.  \n\n[*][h3]Block All Communication[/h3]\nBlocking another player on Steam will prevent them from interacting with you in the following ways:\n\n[list]  \n[*]Sending you friend or group invites \n[*]Sending messages to you through Steam chat  \n[*]Commenting on your profile or community items that you\u0027ve created  \n[/list]\n\nTo block another player, navigate to their profile and select the [i]block all communication[/i] option under the [i]...[/i] dropdown. Alternatively, you can block players from your friends list, or from your pending invites list.\n\n[*][h3]Enable Chat Filtering[/h3]\nSteam Chat Filtering allows you to control the type of content that can be seen in Steam and in-game chats. You can also customize the filtration in a number of ways.\n\nTo learn more about this feature and opt-in, visit your [url=https://store.steampowered.com/account/preferences/#CommunityContentPreferences]account preferences[/url] page.\n\n[*][h3]Adjusting Privacy Options[/h3]\nYou can adjust privacy options to manage who can view specific components of your profile, who can comment on it, as well as who can view your inventory.\n\n[url=https://steamcommunity.com/my/edit/settings]View Your Privacy Options[/url]\n  \n[*][h3]Invisible Mode[/h3]\nYou can set your Steam status to Invisible, which will cause you to appear offline to other users. You’ll still be able to view your friends list, send and receive messages and otherwise participate in the community. However, other players won\u0027t know you are online. You can set this status from your Steam Friends list next to your profile avatar.\n\n[*][h3]Claiming Copyright Infringement[/h3]\nAnyone who believes that their work has been reproduced in one of our internet sites or services in a way that constitutes copyright infringement may notify Valve\u0027s copyright agent using the form below.\n\n[url=https://steamcommunity.com/dmca/create/]Notice of Copyright Infringement[/url]\n   \n[*][h3]In-game Resources[/h3]\nMany games feature in-game reporting systems designed to mitigate player abuse within that game\u0027s community. Players are encouraged to utilize these systems and submit information via in-game reports.\n\n[*][h3]Contact Your Local Authorities[/h3]\nYou can use all of these features to manage negative behavior within the community, but if you ever feel that you are in danger, we strongly encourage you to contact law enforcement in your area.\n[/list]    \n\n[h2]Best Practices[/h2]\nWe always recommend that players engage in responsible behavior while using Steam. Doing so will decrease the likelihood of your account being the target of malicious activities.\n\n[list]  \n[*][h3]Keep Your Personal Info Safe[/h3]\nMalicious activity often relies on access to your personal information. Never post personally identifiable information on Steam, even in private chats or other areas that you might think are safe. Someone else can always decide to make this content public.\n\nYou should also review your Steam [url=https://steamcommunity.com/my/edit/settings]privacy options[/url] and be aware of what components of your profile are public.\n\n[*][h3]Protect Your Account[/h3]\nAccount security is something that you can control. Take advantage of Steam\u0027s security features and never let anyone access or borrow your account, regardless of the reason.\n\nYou can find more information and resources in our dedicated [url=https://help.steampowered.com/en/faqs/view/6639-EB3C-EC79-FF60]Account Security Recommendations[/url] article.\n\n[*][h3]Engage In Responsible Steam Behavior[/h3]\nMake sure that you are following the Steam [url=https://help.steampowered.com/en/faqs/view/6862-8119-C23E-EA7B]Rules \u0026 Guidelines[/url] and that you are not engaging in activities that violate the Steam subscriber agreement. Activities like this will potentially expose your account to other bad actors, making it a target of malicious activity.\n\n[*][h3]Unfriending and Leaving Groups[/h3]\nDon\u0027t participate in groups or befriend users that are involved in harassment, scamming, or other malicious activities. Associating with players or groups that are involved in inappropriate activity will increase the likelihood that you become a target.\n\n[*][h3]Don’t Engage The Other Party[/h3]\nWhether it\u0027s scamming, harassment, spamming or any other malicious activity, do not engage the party that is responsible. A reaction typically results in even more dedication to the activity by the other party. We recommend ignoring the behavior and utilizing the appropriate resources outlined in this FAQ.\n[/list]",
  "title": "Addressing abuse, harassment and other misconduct on Steam"
}