{
  "faq_id": 8147800086409599480,
  "language": 0,
  "version": 10,
  "content": "[img]https://support.steampowered.com/images/faq/steam_universe/Hardware_SteamLogo_Banner.png[/img]     \n\n[h1]Steam Link App for Android[/h1]The Steam Link app on Android extends Steam Link functionality to many Android phones, tablets, and TVs, running Android 5.0 and newer. Just head to the [url=https://play.google.com/store/apps/details?id=com.valvesoftware.steamlink]Play Store[/url] to download the free app; android users without access to Google Play can [url=https://media.steampowered.com/steamlink/android/latest/steamlink-android.apk]download the lastest version here[/url]. The App uses the same streaming technology as Valve\u0027s Steam Link, allowing you to play your favorite games and even spectate VR games right from your TV.\n\n[h2]Required/Recommended Equipment[/h2]\n[list]\n[*]A computer running Steam\n[*]Supported operating system\n[*]Wireless router 5GHz[/list]  \t  \t\n[h2]Supported Input/Controllers[/h2]\n[list]  \t\t\t[*][url=https://store.steampowered.com/app/353370/Steam_Controller/]The Steam Controller[/url]  \t\t\t[*]Microsoft Xbox One S Controller  \t\t\t[*]Sony DualShock 4 (on Android 9.0 and higher)  \t\t\t[*]Razer Kishi and Raiju Mobile  \t\t\n[/list]\n[i]Please note: other input devices may work even if they aren’t officially supported.[/i]\n\n[h2]Getting Started[/h2]\n[olist]  \t\t\t[*]Turn on your home PC, launch Steam, and log in.  \t\t\t[*]Ensure your phone is connected to the same network as your host PC.  \t\t\t[*]Download the app from the Play Store and follow the on screen instructions.  \t\t[/olist]\n\nIf you have questions about the app or need help using it, just click the appropriate tab.\n\n[expand type=title title=\u0022Frequently Asked Questions\u0022]    \t[h4]How can I make the text on the screen bigger?[/h4]The app supports pinch gestures to change the zoom level. Alternatively, you can adjust the Big Picture Mode resolution to a smaller size to improve legibility.\n\n[h4]The game is choppy and unresponsive. How can I improve the experience?[/h4]The majority of people have found that switching to a 5GHz network significantly improves the gaming experience.\n\nYou can also try switching to the ‘Fast’ video option from the Streaming settings in the Steam Link. You can find out more information about improving wireless experience [url=https://help.steampowered.com/en/faqs/view/3E3D-BE6B-787D-A5D2]here[/url].\n\n[h4]Do I need a controller to use the Steam Link app?[/h4]You can use the Steam Link app without a controller using your touchscreen, however input will be limited with some games.\n\n[h4]Can I use the Steam Link app with my cellular network?[/h4]Using Remote Play Anywhere with your cellular network may work, depending on the policies of your cellular provider.\n\n[h4]Can I use a Bluetooth device not listed on this page?[/h4]Steam Support is unable to provide assistance with unsupported devices, however, we do have an active community that may have found solutions to the issue you’ve encountered.\n\nPlease visit the [url=https://steamcommunity.com/app/353380/discussions/]Steam Link section of the Steam Discussion forums.[/url]\n\n[/expand][expand type=title title=\u0022Troubleshooting\u0022]\t    \t[h4]Experiencing Performance Issues?[/h4]If you are experiencing performance issues please ensure that your [url=https://help.steampowered.com/en/faqs/view/3E3D-BE6B-787D-A5D2]settings are optimized for Streaming.[/url]\n\n[h4]Contacting Steam Support[/h4]If you have other issues or questions, contact [url=https://help.steampowered.com/en/wizard/HelpWithGameIssue/?appid=353380\u0026issueid=354\u0026nodeid=1\u0026return_nodeid=9]Steam Support[/url] and attach the [i][b]remote_connections.txt[/b][/i] and [i][b]streaming_log.txt[/b][/i] files to your ticket.\n\nThe default location for this file on your PC is [i][b]C:\\Program Files (x86)\\Steam\\logs[/b][/i]\n\n[/expand]\n\n",
  "title": "Android Steam Link App",
  "timestamp": "2021-08-09T16:05:40+00:00"
}