{
  "faq_id": 5242650211871460280,
  "language": 0,
  "version": 7,
  "content": "To configure multiple clients to play from behind the same router, you may need to change one of the clients to use a different clientport number.\n[list]     \n[*]Each machine must have a unique Steam account with different game licenses registered to the account.      \n[*]Each machine must have a different clientport setting.      \n[*]Each machine must have a unique Mac address.      \n[*]The router must be up-to-date.      \n[*]Your Firewall and router must have the [url=https://help.steampowered.com/en/faqs/view/669A-2F68-D1D1-A5EC]required ports for Steam open[/url].  [/list]\nThe default clientport is [b]27005[/b] and you can only have one game with that port active on the same lan.\n\n\n[h1]Specifying a Clientport as a Launch Option[/h1]\nTo specify a client port, please perform the following steps for each computer on the LAN\n[list]      \n[*]Go to Steam\u0027s [b]Library[/b] menu      \n[*]Right-click on the game you wish to play      \n[*]Go to [b]Properties...[/b]      \n[*]From the [b]General[/b] tab, under [b]Launch Options[/b] you enter the launch option\n[*]Add a different client port number on each machine between 27005 and 27032 in the following format:\n[code]\u002Bclientport 270XX[/code]\n[b]Note:[/b] Do not use 27020      \n[*]Leave the menu and launch the game\n[/list]\n[b]NOTE:[/b] This solution only works if you launch the game through the Steam client.\n\nIf you have already set other launch options, leave a space between the last character of your previous launch option and the [b]\u002B[/b] of your clientport setting.\n\n\n[h1]Specifying a Clientport in the userconfig.cfg[/h1]\nThe benefit of this method is that the clientport will remain set whether you are launching the game from the [b]My games[/b] menu or from a shortcut to the game.\n[list]      \n[*]Navigate to the folder that holds the [b]config.cfg[/b] for your game\n[b]Example:[/b] The config.cfg for Counter-Strike: Source can be found here:\n[b]..\\Steam\\steamapps\\common\\Counter-Strike Source\\cstrike\\cfg[/b]      \n[*]If you have a [b]userconfig.cfg[/b] in that directory, open it. If you do not already have a userconfig.cfg:      [olist]          \n[*]Right-click in the folder          \n[*]Go to: [b]New[/b] \u003E [b]Text Document[/b]          \n[*]Rename the file [code]userconfig.cfg[/code]          \n[*]Open the file with Notepad      \n[/olist]            \n[*]Type into the document [code]clientport 270XX[/code] where [b]XX[/b] are the last two digits of the clientport number. Acceptable values include 05 - 19 and 21 - 32      \n[*]Save your [b]userconfig.cfg[/b]      \n[*]Launch your game  \n[/list]\n\n",
  "title": "Configuring a router for multiple clients",
  "timestamp": "2021-08-10T23:04:24+00:00"
}