{
  "faq_id": 7339386427994118227,
  "language": 0,
  "version": 11,
  "content": "[section style=warning]CS:GO Game bans issued by Overwatch Investigators are non-negotiable and cannot be removed by Steam Support.[/section]      \n[h2]CS:GO Overwatch basics:[/h2][list]  \t[*][url=#overwhat]What is Overwatch?[/url][/*]  \t[*][url=#howwork]How does Overwatch work?[/url][/*]  \t[*][url=#verdicts]What are the charges and possible verdicts?[/url][/*]  \t[*][url=#caseend]What happens at the end of a case?[/url][/*]  \t[*][url=#guilty]I\u0027ve been found guilty by Overwatch Investigators. What does this mean?[/url][/*]  \t[*][url=#xp]Can I earn XP for participating in Overwatch?[/url][/*]  [/list]    [h2]Investigator-related questions:[/h2][list]  \t[*][url=#investigator]How do I become an Investigator?[/url][/*]  \t[*][url=#selection]How are Investigators selected?[/url][/*]  \t[*][url=#scores]How are Investigators scored?[/url][/*]  \t[*][url=#weight]Can one Investigator have more weight applied to their decision than another?[/url][/*]  \t[*][url=#wanthelp]I am not an Overwatch Investigator. How can I help?[/url][/*]  [/list]    [h2]General questions:[/h2][list]  \t[*][url=#griefing]The suspect is griefing a griefer in retribution. Is the suspect still guilty of griefing?[/url][/*]  \t[*][url=#cheatgrief]Do griefers and cheaters receive the same penalty when they are convicted?[/url][/*]  \t[*][url=#jitters]Why is the evidence replay sometimes jittery?[/url][/*]  [/list]\n[section id=overwhat]  [h2]What is Overwatch?[/h2]Overwatch is an in-game replay review system that lets the CS:GO community regulate itself by allowing qualified and experienced members of the community, called \u0027Investigators\u0027 to review reports of disruptive behavior, determine whether those reports are valid, and apply bans if appropriate.[/section]    \n[section id=howwork]  [h2]How does Overwatch work?[/h2]Prospective Overwatch Investigators are presented with a shield icon with a \u0027\u002B\u0027 option in the main menu, which indicates that there is a pending Overwatch case for them to evaluate. The Investigators can then choose to participate by watching a replay (eight rounds worth, or roughly 10 minutes) and selecting a verdict.\n\nIf the Investigators collectively agree that an offense has occurred they may vote to issue a Game ban.[/section]    \n[section id=verdicts]  [h2]What are the charges and possible verdicts?[/h2]There are four distinct charges to be evaluated that cover the major forms of disruption. Each charge has two possible verdicts, \u0027Insufficient Evidence\u0027 and \u0027Evident Beyond a Reasonable Doubt\u0027. An Investigator may choose to \u0027Postpone\u0027 a review and restart it at a later time without a resolution.[/section]    \n[section id=caseend]  [h2]What happens at the end of a case?[/h2]For each charge, if the system determines that the Investigators\u0027 collective judgment agrees on a unanimous verdict, then the case will be closed and all decisions rendered on the case will determine the final verdict. If enough verdicts are \u0022Insufficient Evidence\u0022 or are inconclusive, the case will be thrown out.[/section]    \n[section id=guilty]  [h2]I\u0027ve been found guilty by Overwatch Investigators. What does this mean?[/h2]If you have been found guilty of cheating by Overwatch Investigators you may be permanently Game banned in CS:GO. Information on how Game bans affect your account can be found in our [url=https://help.steampowered.com/en/faqs/view/4E54-0B96-D0A4-1557]I\u0027ve been Game banned[/url] help article.[/section]    \n[section id=xp]  [h2]Can I earn XP for participating in Overwatch?[/h2]Yes, you can earn XP by submitting accurate verdicts in your cases. After several of your cases have been resolved, you will receive an XP reward based on the overall accuracy of your recent verdicts, scaled by your Overwatch Investigator score.\n\nYou can collect your reward by completing matches and earning XP in any official game mode.[/section]    \n[section id=Investigator]  [h2]How do I become an Investigator?[/h2]Currently, the best way to become an Investigator is to play lots of matches in our official Competitive Matchmaking. We are slowly adding players to the pool of Investigators, and randomly pick them with consideration to their playtime and skill level. The goal is to invite as many skilled reviewers as possible.\n\n[b]Note:[/b] Steam Support cannot add players to the Investigator pool.  [/section]\n[section id=selection]  [h2]How are Investigators selected?[/h2]New Overwatch Investigators are selected based on their CS:GO activity and account standing. Some factors include:\n[list]  \t[*]Competitive wins[/*]  \t[*]Account age[/*]  [*]Hours played[/*]  \t[*]Skill group[/*]  \t[*]Low report count[/*]  [/list]If applicable, prior Overwatch participation level and score (a function of an Investigator\u0027s accuracy) will be taken into account. Community members who maintain both a high level of activity and high Overwatch scores will receive more cases to participate in.\n\n[b]Note:[/b] You must maintain an active skill group in order to remain an Overwatch Investigator.[/section]    \n[section id=scores]  [h2]How are Investigators scored?[/h2]An Overwatch score represents an Investigator\u0027s ability to consistently and accurately judge the evidence they review, per charge, in both real and test cases.\n\nInvestigators score positively for agreeing with the majority of other Investigators\u0027 verdicts for the same replay, and score negatively for being in the minority. The resulting change in score is larger when most Investigators are in agreement, and smaller when they disagree. Because of the occasional test case inserted into the case load, the only way to improve an Overwatch score is to carefully watch the entire replay and make an informed and accurate judgment of the evidence provided.[/section]    \n[section id=weight]  [h2]Can one Investigator have more weight applied to their decision than another?[/h2]Yes. A higher-scoring Investigator\u0027s verdict will carry more weight than a lower-scoring Investigator.[/section]    \n[section id=wanthelp]  [h2]I am not an Overwatch Investigator. How can I help?[/h2]All players can help by reporting disruptive behavior. Reports feed the pool of cases that get reviewed, and good reports result in efficient case reviews.\n\nTo file a report, open the scoreboard, right-click to activate the cursor and then left-click on the player\u0027s name to open their player panel and select the report button (an exclamation mark inside a triangle).[/section]    \n[section id=griefing]  [h2]The Suspect is griefing a griefer in retribution. Is the Suspect still guilty of griefing?[/h2]Unequivocally, yes!\n\nGriefing in revenge either escalates an innocent mistake or generates the reaction that the griefer was intending. Additionally, it puts the griefed player in danger of being convicted for the retribution. There is no excuse for poor sportsmanship and your duty as an Investigator is to enforce the highest standards.[/section]    \n[section id=cheatgrief]  [h2]Do griefers and cheaters receive the same penalty when they are convicted?[/h2]No. The penalty assigned to a Suspect is proportional to their behavior. Suspects who are convicted of griefing are given a moderate cooldown, whereas cheaters are removed from the game entirely.\n\nAs always, the best way to improve player behavior is to report griefers and cheaters whenever you encounter them.[/section]    \n[section id=jitters]  [h2]Why is the evidence replay sometimes jittery?[/h2]Previously, interpolation, which is used to smooth the transition between the known positions of players, resulted in some situations where the Suspect would appear to get a kill while aiming slightly off-target, even though their aim was actually correct. While we investigate potential smooth and accurate solutions, the interpolation of the Suspect\u0027s aim was removed from the Overwatch demos in order to more accurately represent the Suspect’s POV during kills. This may results in a more jittery view in some cases.[/section]",
  "title": "CS:GO - Overwatch System",
  "timestamp": "2021-12-02T21:22:28+00:00"
}