{
  "faq_id": 5373038115128222050,
  "language": 0,
  "version": 4,
  "content": "[list]  \t[*][url=#subcost]How much does the CS:GO 360 Stats subscription cost?[/url][/*]          [*][url=#sublength]How long does the CS:GO 360 Stats subscription last?[/url][/*]  \t[*][url=#subinclude]What does CS:GO 360 Stats include?[/url][/*]  \t[*][url=#submanage]How do I manage my CS:GO 360 Stats subscription?[/url][/*]  \t[*][url=#subwallet]How do I pay for CS:GO 360 Stats using Steam Wallet funds?[/url][/*]  \t[*][url=#whichmatches]Which matches are shown on my Stats page?[/url][/*]  \t[*][url=#subtime]How do I check the time remaining on my subscription?[/url][/*]  \t[*][url=#submatchdata]I\u0027m not seeing Competitive matches on my Stats page. Why is this?[/url][/*]          [*][url=#subban]I am a subscriber but received a cooldown/ban. Can I refund the remaining time?[/url][/*]  [/list]\n[section id=subcost]  [h2]How much does the CS:GO 360 Stats subscription cost?[/h2]The cost of the CS:GO 360 Stats subscription can be found in-game, converted to your local currency. At launch the cost in USD is $0.99 per month.[/section]    \n[section id=sublength]  [h2]How long does the CS:GO 360 Stats subscription last?[/h2]The CS:GO 360 Stats subscription lasts one calendar month and will automatically renew on the same date each month unless you cancel during your current billing cycle.\n\nThis means if you purchase a subscription on the 5th of any month it will expire on the 5th of the following month, regardless of the number of days in between.[/section]     \n[section id=subinclude]  [h2]What does CS:GO 360 Stats include?[/h2]CS:GO 360 Stats includes access to Competitive match stats from official Competitive, Premier, and Wingman game modes and the Round Win Chance report introduced in Operation Broken Fang.[/section]    \n[section id=submanage]  [h2]How do I manage my CS:GO 360 Stats subscription?[/h2]You can manage your subscription in-game by clicking \u0027Manage Subscription\u0027 in the upper right of the Stats page. You can also manage your subscription on the web. To do this:\n[olist]  [*]Visit the [url=https://store.steampowered.com/]Steam Store[/url] and log into your Steam account.[/*]  [*]Click on your Persona in the upper right, next to your avatar, and select \u0027Account Details\u0027.[/*]  [*]Under \u0027STORE PURCHASE \u0026 HISTORY\u0027, click \u0027Manage subscriptions\u0027.[/*]  [/olist]CS:GO 360 Stats subscriptions are non-refundable. If you would like to cancel your subscription you will need to do so before your next billing cycle.[/section]     \n[section id=subwallet]  [h2]How do I pay for CS:GO 360 Stats using Steam Wallet funds?[/h2]To renew a subscription using Steam wallet funds you will need to ensure you do not have any stored payment information on your account before the renewal date. To remove payment details from your Steam account:\n[olist]  [*]Log in to your Steam account through the Steam client or a web browser.[/*]\t[*]In the upper right corner select your username and click \u0022Account Details\u0022 from the drop down menu.[/*]\t[*]Under \u0022Store \u0026 Purchase History\u0022 you will see saved payment method(s). Click the \u0022Delete\u0022 link to remove this information from your Steam account.[/*] [/olist][/section]\n[section id=whichmatches]  [h2]Which matches are shown on my Stats page?[/h2]Matches played in Competitive, Premier, and Wingman game modes on official servers are tracked on the Stats page. Matches from Casual, Unranked, and other games modes are not.[/section]    \n[section id=subtime]  [h2]How do I check the time remaining on my subscription?[/h2]Time remaining on your CS:GO 360 Stats subscription is shown at the top of the Stats page. A few days prior to renewal, the email associated with your Steam account will receive an email reminding you it will be renewed shortly.[/section]    \n[section id=submatchdata]  [h2]I\u0027m not seeing Competitive matches on my Stats page. Why is this?[/h2]At launch, any user who redeemed an Operation Broken Fang Pass to their account and played Competitive matches will have this historical match data displayed. If you did not redeem an Operation Pass to your account you will not have match stats.\n\nGoing forward, matches will only be recorded to your CS:GO 360 Stats page while you are a subscriber. Any matches you play while you are not subscribed will not be shown on the Stats page.[/section]    \n[section id=subban]  [h2]I am a subscriber but received a cooldown/ban. Can I refund the remaining time?[/h2]No. We do not offer refunds for the CS:GO 360 Stats subscription regardless of the reason.[/section]",
  "title": "CS:GO 360 Stats"
}