{
  "faq_id": 8508054175547039248,
  "language": 0,
  "version": 3,
  "content": "[list]  \t[*][url=#whatlobby]What is a Steam Group Lobby?[/url][/*]  \t[*][url=#createlobby]How do I create a Steam Group Lobby?[/url][/*]  \t[*][url=#lobbylimits]Are Steam Group Lobbies limited to a particular game setting?[/url][/*]  \t[*][url=#removemember]Can I remove a member of a Steam Group from my lobby?[/url][/*]  \t[*][url=#preventmember]Can I prevent members of a Steam Group from joining my lobby?[/url][/*]  \t[*][url=#nolobbies]Why don\u0027t I see Steam Group Lobbies for all of the groups I\u0027ve joined on Steam?[/url][/*]  \t[*][url=#findgroups]Where can I find groups to join?[/url][/*]  [/list]\n[section id=whatlobby]  [h3]What is a Steam Group Lobby?[/h3]A Steam Group Lobby is a \u0027Play With Friends\u0027 lobby that can be joined by any member of a selected Steam Group. The Steam Group is specified by the lobby leader.\n\nTo join a Steam Group Lobby, select the Steam Groups tab in the Main Menu and join any of the lobbies that are listed by clicking the \u0027\u002B\u0027 icon. You can always invite your Steam friends to join your lobby, even if they are not members of the Steam Group.[/section]    \n[section id=createlobby]  [h3]How do I create a Steam Group Lobby?[/h3]Users who have set a Steam Group Clan Tag will have their lobbies listed by default for the Group they\u0027ve selected. If you haven\u0027t set a Clan Tag, click \u0027Play\u0027 and select \u0027Play With Friends\u0027. From there, click on \u0027Change Permissions\u0027 and select \u0027Public Steam Group Lobby...\u0027 where you can choose the Steam Group you\u0027d like to play with.\n\nTo change the Steam Group your lobby is listed for, click \u0027Change Permissions\u0027 and select a different Steam Group. Members of the newly selected group will now see your lobby listed at the main menu.[/section]    \n[section id=lobbylimits]  [h3]Are Steam Group Lobbies limited to a particular game setting?[/h3]No. The lobby leader can set the Steam Group Lobby to the game mode and map group of their choice.[/section]    \n[section id=removemember]  [h3]Can I remove a member of a Steam Group from my lobby?[/h3]Yes. You can remove a player from your lobby by clicking their avatar and selecting \u0027Kick Player\u0027.[/section]    \n[section id=preventmember]  [h3]Can I prevent members of a Steam Group from joining my lobby?[/h3]Yes. To prevent members of a Steam Group from joining your lobby, click \u0027Change Permissions\u0027 and select either \u0027Public Match\u0027 or \u0027Private Match.\u0027 You can set these to be your default lobby settings in the Game Settings menu. Alternatively, you can select \u0027No Team Tag\u0027 in the Steam Group Tag settings.[/section]    \n[section id=nolobbies]  [h3]Why don\u0027t I see Steam Group Lobbies for all of the groups I\u0027ve joined?[/h3]If members of certain Steam Groups have not created a group lobby there may not be any lobbies available to join. You can try again later, or create a lobby for other group members to join.[/section]    \n[section id=findgroups]  [h3]Where can I find groups to join?[/h3]You can find Steam Groups to join through both the Steam client and a web browser.\nWhile logged in, click on your persona (next to \u0027COMMUNITY\u0027) and select \u0027GROUPS\u0027. From here you can browse existing Steam Groups, create a new group, and change your primary group. \n\nThere are thousands of Steam Groups representing a wide variety of communities, countries, languages, and common interests.[/section]",
  "title": "CS:GO - Steam Group Lobbies",
  "timestamp": "2021-07-10T19:49:55+00:00"
}