{
  "faq_id": 7605271880239749627,
  "language": 0,
  "version": 8,
  "content": "If you are encountering performance issues, game crashes, or Dota 2 is failing to launch with or without an error message, proceed through this article from top to bottom and complete all applicable steps to troubleshoot the issue.\n\n[h3]Crashes or failures to launch with specific error messges[/h3]\nCheck to see if there is an article related to the error message that you are seeing in the [url=https://support.steampowered.com/kb_cat.php?id=59]Specific Error Messages category.[/url]\n\nIf there is no article related to the message that you are seeing, continue through this article to troubleshoot the issue.\n\n\n[h3]Troubleshooting performance issues and crashes[/h3]\nPlease read and complete all applicable troubleshooting steps in the [url=http://dev.dota2.com/showthread.php?t=15261]Common Dota 2 Technical Issues and Solutions[/url] guide provided by the Dota 2 developers.\n\nRefer to our articles regarding Hardware and Software based performance issues. Complete all steps exactly as they are presented.\n[list]      \n[*][url=https://help.steampowered.com/en/faqs/view/7289-6080-C6E3-AE81]Troubleshooting Game Performance Issues - Hardware [/url]\n[*][url=https://help.steampowered.com/en/faqs/view/5B03-A517-D747-9421]Troubleshooting Game Performance Issues - Software[/url]\n[/list]\n\n[h3]Updating your drivers[/h3]\nIf you are encountering any issues with your Steam games, [url=https://help.steampowered.com/en/faqs/view/5799-495F-1F25-D15B]ensure that your drivers are completely up to date[/url].\n\n[h3]Blue Screen issues in Windows[/h3]\nIf you encounter a Blue Screen error with Dota 2 or your computer is restarting when launching or playing Dota 2, make sure that your BIOS and Chipset Drivers are fully up to date (see your motherboard manufacturer\u0027s instruction manual or website for specific instructions and updates).\n\n[section id=#verify][h3]Verifying your game files[/h3]\nIf you think some files of your game installation may be corrupt or have been deleted as a false positive by antivirus or security software, try [url=https://help.steampowered.com/en/faqs/view/0C48-FCBD-DA71-93EB]Verify Integrity of Game Files[/url].[/section]\n\n[h3]Launching with -autoconfig or -safe mode [/h3]\nIf Dota 2 is failing to start after preparing to launch, we recommend that you attempt to launch with either the -autoconfig or -safe launch option in that order.\n\n[section style=note]  [h3]Note:[/h3]Only one of these launch options can be used at a time. Once you are able to launch this game, you will need to remove these launch options if you wish to change any video settings.[/section]\n\nUsing the -autoconfig launch option\n[olist]\n[*]Open Steam\n[*]Go to the \u0022Library\u0022\n[*]Right-click the game which needs to be reconfigured\n[*]Select \u0022Properties\u0022 from the menu\n[*]Go to the \u0022Launch Options\u0022 section in the window\n[*]Remove any launch options currently shown.\n[*]Type [code]-autoconfig[/code]in the box and close the window.\n[*]Launch the game and test the issue again\n[/olist]\n\nUsing the -safe launch option\n[olist]\n[*]Open Steam\n[*]Go to the \u0022Library\u0022\n[*]Right-click the game which needs to be reconfigured\n[*]Select \u0022Properties\u0022 from the menu\n[*]Go to the \u0022Launch Options\u0022 section in the window\n[*]Remove any launch options currently shown. \n[*]Type [code]-safe[/code]in the box and close the window.\n[*]Launch the game and test the issue again.\n[/olist]\n\n[h3]Reacquiring all Dota 2 files[/h3]\nThis should be done if you think some of the game\u0027s files may be corrupt, or if you have overwritten any game files with custom assets or mods and you wish to restore the game to its original state. If your game was working previously but is now crashing or freezing and you have completed the above instructions under the [url=#verify]Verifying your game files[/url] section with no results, try this next.\n\n[b]For Windows computers:[/b]\n[olist]\n[*]Exit Steam entirely.\n[*]Browse to your Steam installation (Usually C:\\Program Files(x86)\\Steam\\)\n[*]Rename the \u0022steamapps\u0022 folder to \u0022old_steamapps\u0022\n[*]Re-launch Steam and re-install the game.\n[*]Once the installation is complete, test the issue.\n[*]If this resolves the issue, you may copy the new files into the \u0022old_steamapps\u0022 folder and rename it to \u0022steamapps\u0022 to restore your other games without re-downloading.\n[*]If the issue is not resolved, you can rename the folder back to avoid having to re-install other games.\n[/olist]\n\n[b]For Linux computers:[/b]\n\n[section style=note]  [h3]Note:[/h3]Steam for Linux is currently only supported on Ubuntu 12.04/12.10 with Unity, Gnome, or KDE desktops.[/section]\n[olist]\n[*]Exit Steam and go to your Home folder.\n[*]Press CTRL\u002BH to reveal any hidden folders.\n[*]Click on .local \u003E share \u003E Steam and do the following:\n[*]Rename the \u0022steamapps\u0022 folder to \u0022old_steamapps\u0022\n[*]Re-launch Steam and re-install the game.\n[*]Once the installation is complete, test the issue again.\n[/olist]\n\n[b]For Mac computers:[/b]\n[olist]\n[*]Exit Steam entirely.\n[*]Open Finder and navigate to the folder containing your SteamApps folder (/Users/[username]/Library/Application Support/Steam/)\n[*]Rename the \u0022steamapps\u0022 folder to \u0022steamapps_old\u0022.\n[*]Re-launch Steam and re-install the game.\n[*]Once the installation is complete, test the issue.\n[/olist]\n\n[b]To locate your Steam installation folder when using Lion or any newer macOS version, do the following:[/b]\n[olist]\n[*]Open Terminal\n[*]Type chflags nohidden ~/Library\n[*]Close Terminal\n[/olist]\n\nYou should see the Library folder available through the Go menu on the menu bar while holding the option key.\n\n[h3]Reporting a bug, crash, or other issue[/h3]\nIf you are still encountering this issue within Dota 2, please create or join an existing thread regarding that issue on the [url=http://dev.dota2.com/]Dota 2 Development Forums[/url].\n\nWidespread crashes or other issues will often be fixed by the Dota 2 development team within days of the issue appearing.\n\n",
  "title": "Dota 2 - Performance Issues, Crashes, or Failures When Launching",
  "timestamp": "2021-08-12T17:21:26+00:00"
}