{
  "faq_id": 4517485828743518799,
  "language": 0,
  "version": 5,
  "content": "[img]{STEAM_CLAN_IMAGE}/1976/4a2cbaf07bd6b8ab4c5fe2ef7810d20450d32858.png[/img]\n\n[list]  \t[*][url=#overview]Detail Mask Overview[/url][/*]  \t[*][url=#terrorblade]Terrorblade - Arcana and Ambient Textures[/url][/*]  \t[*][url=#legion]Legion Commander - Arcana Textures[/url][/*]  \t[*][url=#phantom]Phantom Assassin - Arcana Textures[/url][/*]  \t[*][url=#druid]Lone Druid - Ability Textures[/url][/*]  \t[*][url=#earthshaker]Earthshaker - Ability and Ambient Textures[/url][/*]  \t[*][url=#sven]Sven - Ability Textures[/url][/*]  \t[*][url=#rubick]Rubick Ambient Textures[/url][/*]  \t[*][url=#lycan]Lycan Ultimate Ambient Textures[/url][/*]  \t[*][url=#razor]Razor Ambient Textures[/url][/*]  [/list]\n\n[url id=overview][/url]\n\n[h2]Detail Mask Overview[/h2][list]  \t[*]If you are making items for heroes that have colored, glowing, or scrolling Arcana, ability, or ambient textures, you can add to the appeal of your items by authoring them to react to these.    \t[list]  \t\t[*]Arcana textures can display on a hero\u0027s other items when an Arcana item is equipped.[/*]  \t\t[*]Ability textures display only when a hero casts a certain ability spell.[/*]  \t\t[*]Ambient textures display constantly, such as the texture flames on Chaos Knight\u0027s items but other heroes use this in a more subtle way that is still effective.[/*]  \t[/list]  \t[/*]  \t[*]Only Valve creates Arcana items but community artists have the option to make their item textures react when an Arcana is equipped.[/*]  \t[*]Arcana, ability, and ambient textures are accomplished through a combination of greyscale detail masks that community artists can author and Valve\u0027s default detail maps and default material settings that determine additional coloring, texture scrolling speed, and cubemaps among other things.[/*]  \t[*]If properly authored detail masks and color textures are not provided by the community artist, a workshop item will not display Arcana, ability, or ambient textures or colors.[/*]  \t[*]A detail mask will only work on a custom item if the hero\u0027s default or Arcana material has a detail mask enabled. It must use the Valve\u0027s default detail map for that hero.[/*]  \t[*]The strength or subtlety of the hues in an artist\u0027s color texture and the values in an artist\u0027s detail mask determine how vigorously the Arcana, ability, or ambient textures will display on their items.[/*]  \t[*]Valve artists have sometimes added detail masks to workshop items to help them display Arcana textures but moving forward we prefer that the community artists have the awareness of this need and provide the detail masks themselves. [/*]  \t[*]The item workshop submission tool is not currently able to let artists activate arcana textures on their items, but they will be able to preview ability and ambient textures.[/*]  \t[*]The links below will explain detail mask options for several heroes and Arcanas. Not all applicable heroes or items are covered but these examples should give an idea of practices that can be used in other situations. [/*]  [/list]\n\n​\n\n[hr][/hr]  [h2] [/h2][h2][url id=terrorblade][/url][/h2][h2]Terrorblade - \u0022Fractal Horns of Inner Abysm\u0022 Arcana and Ambient Textures[/h2][list]  \t[*]Terrorblade\u0027s Arcana has an option to display alternate colors by using different Prismatic Gems.[/*]  \t[*]The Arcana uses Terrorblade\u0027s Head slot, but you have the option to author a detail mask for your head item so it can react to Terrorblade\u0027s default scrolling texture and blue-green ambient color when the Arcana is not equipped.[/*]  \t[*]Strong color or white in an artist\u0027s color texture means that a Terrorblade item will retain this coloring or the white areas regardless of how the detail mask is authored or what color Arcana or gem is applied. It is up to community artists to decide how much base item color or white is to remain when an Arcana or gem color is active and author the color and detail masks accordingly.[/*]  \t[*]The default detail map used for Terrorblade is white and grey to allow Arcanas, gems, and Terrorblade\u0027s default blue-green ambient to provide different colorings.[/*]  \t[*]All Terrorblade workshop items with detail masks will use this default scrolling detail map.[/*]  [/list]\n\nTerrorblade default detail map, weapon color, detail mask, and model display. \n\nDark and desaturated color combined with a high contrast detail mask creates one strong outline that will cleanly display the Arcana colors and scrolling textures beneath the Arcana particles. The image on the right shows both the blue (default) and red (Arcana) coloring and scrolling texture applied to the detail mask areas.\n\n[img]{STEAM_CLAN_IMAGE}/1976/963303f5885c0239d5318c9568ef0d680e5fdfef.png[/img]\n\nTerrorblade default detail map, head color, detail mask, and model display. \n\nEven though the head item is replaced for the Arcana, the default head item still uses a detail mask to display the default ambient scrolling texture on the horns when the arcana is not equipped. Strong greenish coloring is retained from the color texture.\n\n[img]{STEAM_CLAN_IMAGE}/1976/32b32dc854f7747f30dfc80d2659378852cf96e0.png[/img]\n\nTerrorblade default detail map, demon color, detail mask, and game display. \n\nThe demon\u0027s very dark and desaturated color texture is designed to totally take its color from the Arcana, gems, or Terrorblade\u0027s default blue-green ambient. Combined with a detail mask that has small, fine details in a mix of strong and soft values means there will be a variety of added color and scrolling textures all over the demon\u0027s body.\n\n[img]{STEAM_CLAN_IMAGE}/1976/4ed404b384b6fd501ecf0f281d24a3cc6a9b958c.png[/img]\n\n[hr][/hr]  [h2] [/h2][h2][url id=legion][/url][/h2][h2]Legion Commander - \u0022Blades of Voth Domosh\u0022 Arcana[/h2][list]  \t[*]This Arcana uses Legion Commander\u0027s weapon slot, changing from single weapon to dual wield swords.[/*]  \t[*]Because of this, there\u0027s no need to add an Arcana detail mask to a custom Legion Commander spear - it will never be used with the Arcana.[/*]  \t[*]Some of Legion Commander\u0027s default items have detail masks to pick up the Arcana texture when that item is equipped. The detail masks do not react when there is no Arcana.[/*]  \t[*]All Legion Commander workshop items with properly authored detail masks will use Valve\u0027s detail map and materials when the Arcana is equipped.[/*]  [/list]\n\nLegion Commander\u0027s Arcana detail map, banner color, detail mask, and game display\n\n[img]{STEAM_CLAN_IMAGE}/1976/8070052f401622d867547209ae17a5f95a089828.png[/img]\n\n[hr][/hr]\n\n[url id=phantom][/url]\n\n[h2]Phantom Assassin - \u0022Manifold Paradox\u0022 Arcana Textures[/h2][list]  \t[*]Phantom Assassin\u0027s Arcana uses the weapon slot, changing from single weapon to dual wield swords.[/*]  \t[*]Some of Phantom Assassin\u0027s default items have detail masks to pick up the Arcana texture when that item is equipped. The detail masks do not react when there is no Arcana.[/*]  [/list]\n\nPhantom Assassin\u0027s Arcana detail map, default helmet color, detail mask, and game display\n\n[img]{STEAM_CLAN_IMAGE}/1976/f3b79f287152d23339f6cbd7129360341e18b32c.png[/img]\n​\n\n[hr][/hr]\n\n[url id=druid][/url]\n\n[h2]Lone Druid - \u0022Rabid\u0022 Ability Texture[/h2][list]  \t[*]This ability displays a brightly glowing design that sits on top of a dark or medium valued color texture.[/*]  \t[*]The Rabid texture does not display well on top of white or very light base colors, so keep this in mind when designing the color texture for your items.[/*]  \t[*]The detail masks for Lone Druid\u0027s wearable items, Spirit Bear, and True Form are high contrast and focused on just a few areas.[/*]  \t[*]Don\u0027t author the detail mask to use an even, overall Rabid coloring on the Spirit Bear or True Form - this could look broken or cause confusion with other spell effects.[/*]  \t[*]Because the Rabid effect is an important visual cue for gameplay, have the areas that display the Rabid texture easily viewable from above in game view.[/*]  [/list]\n\nTrue Form color texture, detail mask, and Rabid texture game display\n\n[img]{STEAM_CLAN_IMAGE}/1976/29393d3951d80dec7e4c723a8c99a49ae8a8f241.png[/img]\n\nSpirit Bear color, detail mask, and Rabid game display\n\n[img]{STEAM_CLAN_IMAGE}/1976/5d4200e8bc09ac9d9e8db250d0118e764e437bba.png[/img]\n\n[hr][/hr]  [h2][url id=earthshaker][/url][/h2][h2]Earthshaker - \u0022Enchant Totem\u0022 Ability and Ambient Textures[/h2][list]  \t[*]Earthshaker\u0027s totem has a subtle scrolling ambient texture that constantly displays in the item\u0027s surface decorations.[/*]  \t[*]This turns into a vivid glowing scrolling texture when he uses his Enchant Totem ability.[/*]  [/list]\n\n[img]{STEAM_CLAN_IMAGE}/1976/650e3e5a77c8c47d960c7d04cc4b0ce650d13a4c.png[/img]\n\n[img]{STEAM_CLAN_IMAGE}/1976/5b205d31083b09213cd915780ac2d5f1ae38561d.png[/img]\n\n[hr][/hr]\n\n[url id=sven][/url]\n\n[h2]Sven - \u0022God\u0027s Strength\u0022 Ability Texture[/h2][list]  \t[*]This ability affects textures in two ways:    \t[list]  \t\t[*]It changes blue areas of Sven\u0027s body and items to a strong red color[/*]  \t\t[*]It adds a scrolling gold texture to areas defined by the detail mask[/*]  \t[/list]  \t[/*]  \t[*]Any blue areas on your color textures that match Sven\u0027s default blue will turn red during this ability.[/*]  \t[*]It\u0027s best to use the detail mask for small, focused areas of each item rather than overwhelm too much of the surface with the gold texture.[/*]  \t[*]The gold scrolling texture will work best if it\u0027s against dark values on the color texture.[/*]  \t[*]Items with detail masks will use Valve\u0027s default gold detail map for Sven.[/*]  [/list]\n\nSven\u0027s God\u0027s Strength detail map, sword color, detail mask, and game display\n\n[img]{STEAM_CLAN_IMAGE}/1976/0bb1b6beb8308749b721635a6a6f3cb5d14aaad3.png[/img]\n\n[hr][/hr]\n\n[url id=rubick][/url]\n\n[h2]Rubick - Ambient Detail Map[/h2][list]  \t[*]This ambient, scrolling detail map of green bubbles displays constantly on Rubick items authored with a detail mask.[/*]  [/list]\n\nRubick detail map, robe color, detail mask, and game display\n\n[img]{STEAM_CLAN_IMAGE}/1976/d7266ec18e20cc3812a0fed74363b42e2fa16b96.png[/img]\n\n[hr][/hr]\n\n[url id=lycan][/url]\n\n[h2]Lycan - Ultimate Ambient Detail Map[/h2][list]  \t[*]This ambient scrolling texture for Lycan\u0027s Ultimate displays constantly.[/*]  \t[*]The detail mask is very faint but covers a large area and is very visible in game.[/*]  [/list]\n\nLycan\u0027s Ultimate detail map, color, detail mask, and in-game display.\n\n[img]{STEAM_CLAN_IMAGE}/1976/34c35c35e3099ee6805f4eb02f5a88f18aa3fd3e.png[/img]\n\n[hr][/hr]\n\n[url id=razor][/url]\n\n[h2]Razor - Ambient Detail Map[/h2][list]  \t[*]This ambient detail map of purplish electrical lightning displays constantly on Razor\u0027s base arms and any items authored with detail masks.[/*]  [/list]\n\nRazor detail map, body color, detail mask, and model display\n\n[img]{STEAM_CLAN_IMAGE}/1976/3fecbb502e3c4f5c37851bf248f13205a0a65918.png[/img]\n\nAfter reading through these notes, look again at how Arcana, Ability, and Ambient textures are displayed on these and other Dota heroes - you\u0027ll have much more insight about how these texture enhancements were accomplished.\n\n[url=http://www.dota2.com/workshop/]Dota 2 Item Workshop Guidelines Homepage[/url]\n\n",
  "title": "Dota 2 Workshop - Authoring Arcana, Ability, and Ambient Textures"
}