{
  "faq_id": 7520452088281282591,
  "language": 0,
  "version": 4,
  "content": "\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/effectsmeshes/01_effects_weapon_in_game3.jpg[/img]\n\n[list]  \t[*][url=#definition]EFFECTS MODEL OVERVIEW[/url][/*]  \t[*][url=#overview]AUTHORING GUIDELINES[/url][/*]  \t[*][url=#particlecounts]PARTICLE VERTEX LIMITS AND CONTEXT[/url][/*]  \t[*][url=#example]AUTHORING EXAMPLE IN MAYA 2016[/url][/*]  \t[*][url=#toolmesh]ADDING THE EFFECTS MESH IN THE WORKSHOP TOOL[/url][/*]  \t[*][url=#previewing]EFFECTS MODEL PREVIEWING[/url][/*]  [/list]\n\n[url id=definition][/url]\n\n[h2] EFFECTS MODEL OVERVIEW              [/h2][list]  \t[*]Items which have vertex-based ambient effects on them by default, such as edge glows, require that item authors submit a mesh which defines where these particles should go on the custom shape of their item.[/*]  \t[*]A workshop item with an effects model will use the default ambient effect authored by Valve for that item and place the particles according to the position of the vertices.[/*]  \t[*]Hero items that require effects models include weapons for Abaddon, Anti-Mage, Bounty Hunter, Doom, Ember Spirit, Juggernaut, Kunkka, Phantom Assassin, and Skywrath Mage.[/*]  \t[*]Effects model ambient particles can display in different contexts for different heroes. Some display at all times, some only display when the hero has a certain ability enabled, some require first leveling up to a certain point before the related ability can be enabled. [/*]  \t[*]Vertex-based effects are not to be confused with particle effects that use attachment points or selection boxes on items.[/*]  [/list]\n\n[url id=overview][/url]\n\n[h2]AUTHORING GUIDELINES[/h2][list]  \t[*]To author an effects model you create a new mesh, much like creating an LOD. However, this mesh will represent particle positions, one per vertex. [/*]  \t[*]Triangles, faces, and general connectivity do not matter on this mesh. The best way to create a mesh for this is to treat it as a single polygon. [/*]  \t[*]Keep in mind that particles will be created from all vertices in the mesh, so do not attempt to create valid convex or closed triangles in the traditional sense if this creates vertices in undesired locations.[/*]  \t[*]While it is possible to use the vertices from the original model mesh, generally speaking the density will not end up being appropriate for the effect. [/*]  \t[*]In addition, UV\u0027s, hard edges, etc. can create duplicate vertices in some cases which is generally undesirable.[/*]  [/list]\n\n[url id=particlecounts][/url]\n\n[h2]PARTICLE VERTEX LIMITS AND CONTEXT[/h2]Here are the particle vertex count limits and ambient effect display context for effects models for these hero items:\n\n[list]  \t[*]Abaddon - weapon - 128, constant[/*]  \t[*]Anti-Mage - weapon and offhand - 128 each, constant[/*]  \t[*]Bounty Hunter - weapon and offhand - 120 each, displays when Jinada ability (available at Level 1) is enabled and is not in cooldown.[/*]  \t[*]Doom - weapon - 48, constant[/*]  \t[*]Ember Spirit - weapon and offhand - 32 each, constant[/*]  \t[*]Juggernaut - weapon - 128, constant[/*]  \t[*]Kunkka - weapon - 64, displays when his Tidebringer ability (available at Level 1) is enabled and is not in cooldown.[/*]  \t[*]Phantom Assassin - weapon - 120, displays when Coup de Grace ability (available at Level 6) is enabled.[/*]  \t[*]Skywrath Mage - weapon - 128, constant[/*]  \t[*]Terrorblade - two part weapon in one slot - 128 total for both, constant[/*]  \t[*]Underlord - weapon - 80, displays when his Atrophy Aura ability (available at Level 1) is enabled and a nearby enemy dies while under the effect. Weapon particle display is stronger for hero deaths than for creep deaths and increases with the number of deaths.[/*]  [/list]\n\n[url id=example][/url]\n\n[h2]AUTHORING EXAMPLE IN MAYA 2016[/h2]Below is an example of how to quickly create effects for an item in Maya 2016. Each type of modeling software will vary, but there should be equivalent processes in each. \n\n[list]  \t[*]First, start with your finished geometry. Select this mesh and Modify\u003EMake Live. This will allow you to use the item\u0027s model mesh to draw vertices for your new effects mesh, while constraining them to the topology of the original.[/*]  [/list]\n\n [img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/effectsmeshes/02_effects_weapon_make_live.jpg?v=1459382400[/img]\n\n[list]  \t[*]Next switch to the Mesh Tools\u003ECreate Polygon. This will allow you to draw the new effects mesh locked to the live geometry. [/*]  [/list]\n\n [img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/effectsmeshes/03_effects_weapon_create_polygon.jpg?v=1459382400[/img]\n\n[list]  \t[*]Draw points where you wish to see particles, such as along a blade edge. [/*]  [/list]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/effectsmeshes/04_effects_weapon_vertices.jpg[/img]\n\n[list]  \t[*]The density of these points will usually be higher than that of the normal mesh, as shown in the example below. It may require a bit of trial and error to get the proper density for the desired look.[/*]  [/list]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/effectsmeshes/06_effects_weapon_vertices_wireframe.jpg?v=1459382400[/img]\n\n[list]  \t[*] The entire effects mesh you create will be a single polygon.[/*]  [/list]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/effectsmeshes/05_effects_weapon_final_fx_model.jpg?v=1459382400[/img]\n\n[list]  \t[*]Once you\u0027ve added all the points, you can export just the effects mesh as either an .fbx or .dmx file. [/*]  \t[*]Name your mesh the same as the item with an _fx postfix, similar to an LOD, for example itemname_weapon_fx.[/*]  [/list]\n\n[url id=toolmesh][/url]\n\n[h2]ADDING THE EFFECTS MESH IN THE WORKSHOP TOOL[/h2][list]  \t[*]Heroes that have effects model requirements for their items will have an \u0022Effects Mesh\u0022 entry between the \u0022Meshes\u0022 and \u0022Materials\u0022 entries on the workshop tool\u0027s \u0022Select Inputs\u0022 page.[/*]  [/list]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/effectsmeshes/09_fx_mesh_workshop_tool.jpg?[/img]\n\n[url id=previewing][/url]\n\n[h2]EFFECTS MODEL PREVIEWING[/h2][list]  \t[*]Loading the effects model along with the model meshes into the Dota 2 Workshop item submission tool should show you a preview of the default ambient particles on the model and in the demo mode loadout only if they are supposed to display all the time for that hero.[/*]  [/list]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/effectsmeshes/07_effects_weapon_preview2.jpg[/img]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/effectsmeshes/08_effects_weapon_preview_loadout2.jpg?v=1459382400[/img]\n\n[list]  \t[*]If you don\u0027t see the effects model particles in the preview or loadout, they may only appear at a certain hero level or in a certain context which will require testing in game using demo mode.[/*]  \t[*]Look at the [url=#particlecounts]Particle Count and Context[/url] section above to see the conditions required to display effects model ambient particles for specific heroes. [/*]  [/list]\n\n[url=http://www.dota2.com/workshop/]Dota 2 Item Workshop Guidelines Homepage[/url]\n\n",
  "title": "Dota 2 Workshop - Item Effects Models"
}