{
  "faq_id": 8533140843407049492,
  "language": 0,
  "version": 4,
  "content": "\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/workshop_banner.jpg[/img]\n\nGuidelines for submitting branded items and logos to the Dota 2 Workshop\n\n[list]  \t[*][url=#feedback]BRANDED ITEM FEEDBACK[/url][/*]  \t[*][url=#rights]BRANDING USE RIGHTS[/url][/*]  \t[*][url=#account]WORKSHOP SUBMISSION ACCOUNT AND FINANCE PREPARATION[/url][/*]  \t[*][url=#team]TEAM ACCOUNT INFORMATION[/url][/*]  \t[*][url=#player]PLAYER AND CASTER ACCOUNT INFORMATION[/url][/*]  \t[*][url=#logo]BRAND LOGO SUBMISSION TO THE DOTA WORKSHOP[/url][/*]  \t[*][url=#tags]BRANDING TAGS AND TITLES[/url][/*]  [/list]\n\n[url id=feedback][/url]\n\n[h2]BRANDED ITEM FEEDBACK[/h2][list]  \t[*]Branded items for teams, players and casters are reviewed equally against other workshop submissions. The Dota 2 Workshop exists to allow the community to give feedback and have influence over what we ship. If you need feedback, please post your concepts or items publicly on the Workshop to allow the Dota 2 community to comment and vote on your ideas. We usually only give feedback if, after review by our economy team, we decide we would like to ship your items but need some revisions.[/*]  [/list]\n\n[url id=rights][/url]\n\n[h2]BRANDING USE RIGHTS[/h2][list]  \t[*]Teams, players and casters own the rights to their names, images and logos. We are only able to ship branded items that include the rights owners’ participation in the item revenue shares.[/*]  [/list]\n\n[url id=account][/url]\n\n[h2]WORKSHOP SUBMISSION ACCOUNT AND FINANCE PREPARATION[/h2][list]  \t[*]Please refer to [url=https://help.steampowered.com/en/faqs/view/0CCF-571A-4430-0130]Dota 2 - Account Preparation for Workshop Submissions[/url] if this is your first time setting up accounts for submitting items to the Dota 2 Workshop.[/*]  \t[*]Please refer to the [url=http://steamcommunity.com/workshop/workshoppaymentinfofaq]Workshop Payment FAQ[/url] for important financial requirements to be aware of when submitting items to the Workshop.[/*]  [/list]\n\n[url id=team][/url]\n\n[h2]TEAM ACCOUNT INFORMATION[/h2][list]  \t[*]When a team first registers for Dota 2, they are assigned a unique Team ID number. [/*]  \t[*]Our economy system uses this Team ID on all branded items a team might ship on the Dota 2 Workshop.[/*]  \t[*]Our system does not support changing Team ID numbers on branded items once they have shipped because this breaks spectator gems. Victory audio, match history and other processes are also affected by Team ID changes.[/*]  \t[*]Whenever possible, teams should use a corporate Steam account and corporate bank account when submitting or sharing in the revenue of team branded items on the Dota 2 Workshop. [/*]  \t[*]If, instead of using a corporation, a team\u0027s share of an item only goes to one individual, only that one person will have the legal right to receive revenue from that item and only that one person will have the legal right to view revenue reports for that item, forever. No other person or business entity will have the right to the revenue for that item.[/*]  \t[*]If an individual account participates in revenue shares for an item you cannot later transfer that participation to a corporate entity. [/*]  \t[*]Once names are established for Steam accounts and their related bank accounts these names cannot be changed.[/*]  \t[*]To set up a corporate team Steam account, you or your team will first have to incorporate as a business entity to act as a representative for payment. Business entities include a corporation, limited liability company, Gesellschaft mit beschränkter Haftung, société par actions simplifiée or the like. There are many resources online that can help you through the incorporation process for your local government.[/*]  \t[*]Once your team\u0027s corporate entity has been set up, your corporate team Steam account can be set up by following the steps on the [url=https://support.steampowered.com/kb/8860-WOSX-7503/dota-2-account-preparation-for-workshop-item-submission]Account Preparation for Workshop Item Submission.[/url]page.[/*]  \t[*]You should use the same Steam account to submit or share in the revenue of all items and logos for your team. Using different Steam accounts for team workshop items interferes with our ability to verify and process team submissions. [/*]  \t[*]Once revenue share accounts are finalized for a workshop item they cannot be changed.[/*]  \t[*]  \tPlease carefully consider the accounts you wish to use for branded items before they are submitted.  \t[/*]  [/list]\n\n[url id=player][/url]\n\n[h2]PLAYER AND CASTER ACCOUNT INFORMATION[/h2][list]  \t[*]Players’ and casters’ Steam IDs are used to identify their branded items.[/*]  \t[*]Our economy system does not support changing the Steam IDs tied to branded items once they have shipped because this breaks spectator gems and payment processes.[/*]  \t[*]If players and casters want the spectator gems on their items to track games properly, they will need to use the same Steam account that is tied to their items when participating in matches.[/*]  \t[*]  \tPlease carefully consider the accounts you wish to use for branded items before they are submitted.  \t[/*]  [/list]\n\n[url id=logo][/url]\n\n[h2]BRAND LOGO SUBMISSIONS TO THE DOTA WORKSHOP[/h2][list]  \t[*] Branded items for teams or individuals should have a brand logo.[/*]  \t[*]The brand logo needs to be a 600x600 png file at 72dpi with the logo on a transparent layer. [/*]  \t[*]This image has to read well against a black background. [/*]  \t[*]Please avoid very thin lines that may not display well at a very small size.[/*]  \t[*]The logo can be submitted through the Dota 2 Workshop Item Tools.[/*]  \t[*]Instructions on how to install and launch the Dota 2 Workshop Item Tools are included in [url=https://help.steampowered.com/en/faqs/view/0CCF-571A-4430-0130]Dota 2 - Account Preparation for Workshop Submissions.[/url][/*]  \t[*]When you launch the Dota 2 Workshop Item Tools, choose \u0022Create New Item\u0022[/*]  [/list]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/create_new_item.jpg?v=1577836800[/img]\n\n[list]  \t[*] On the next page, under the \u0022Images\u0022 category, click \u0022Select Images Template\u0022 and choose \u0022Team Logo\u0022 from the drop-down menu and follow the submission instructions. This submission will work for individual brands as well as teams.[/*]  [/list]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/team_logo_template_cropped.jpg?v=1459382400[/img]\n\n[url id=tags][/url]\n\n[h2]BRANDING TAGS AND TITLES[/h2][list]  \t[*]Team, player and caster workshop tags can be added to branded items when they are being submitted. Please use these tags if you have submitted an official branded item that includes the brand owner in the revenue share.[/*]  [/list]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/branding_tags.jpg?v=1577836800[/img]\n\n[list]  \t[*]It is also helpful to include the brand name and brand type (team, player or caster) in the title or description of your submission.[/*]  [/list]\n\n[url=http://www.dota2.com/workshop/]Dota 2 Workshop Items Submission Guidelines Homepage[/url]\n\n",
  "title": "Dota 2 Workshop - Team, Player, or Caster Branded Items"
}