{
  "faq_id": 4467803444565209988,
  "language": 0,
  "version": 8,
  "content": "[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/workshop_banner.jpg[/img]\n\nFollow the steps in the sections below to submit in-game items for the Dota Workshop: \n\n[list]  \t[*][url=#preparations]PREPARATIONS BEFORE SUBMITTING ITEMS[/url][/*]  \t[*][url=#launch]LAUNCH ITEM TOOLS[/url][/*]  [*][url=#createitem]CREATE NEW ITEM[/url][/*][*][url=#itemtype]SELECT ITEM TYPE[/url][/*]  \t[*][url=#inputs]SELECT INPUTS[/url][/*]  \t[*][url=#inputattach]INPUT ATTACHMENTS[/url][/*]  \t[*][url=#compile]COMPILE YOUR ITEM[/url][/*]  \t[*][url=#previewmodel]PREVIEW MODEL[/url][/*]  \t[*][url=#editattach]EDIT ATTACHMENTS[/url][/*]  \t[*][url=#previewgame]PREVIEW IN GAME[/url][/*]  \t[*][url=#editportrait]EDIT PORTRAIT[/url][/*]  [*][url=#makerev]MAKE REVISIONS[/url][/*]\t[*][url=#submititem]SUBMIT YOUR ITEM TO THE STEAM WORKSHOP[/url][/*]  \t[*][url=#collection]ITEM COLLECTIONS[/url][/*]  \t[*][url=#update]UPDATING WORKSHOP SUBMISSIONS[/url][/*]  \t[*][url=https://help.steampowered.com/en/faqs/view/5D5F-A5BD-C25B-7205]ITEM TROUBLESHOOTING[/url][/*]  [/list][section style=note]\n[list][*]If you need information about submitting Dota game mods, please see [url=https://developer.valvesoftware.com/wiki/Dota_2_Workshop_Tools/Addon_Overview]Addon Overview[/url][/*]  \t[*]If you need information about submitting Dota League tickets, please see [url=https://support.steampowered.com/kb/1719-OPHL-1139/dota-2-league-tickets]Dota League Tickets[/url][/*]  [/list][/section]\n\n[h2][url id=preparations][/url][/h2][h2]PREPARATIONS BEFORE SUBMITTING ITEMS[/h2][list]  \t[*][url=https://support.steampowered.com/kb/8860-WOSX-7503/dota-2-account-preparation-for-workshop-item-submission]Prepare a Steam account for submitting items to the Dota Item Workshop and install Dota Workshop tools[/url][/*]  \t[*]Make sure your items conform to the texture and triangle budgets and other technical requirements described in the [url=http://www.dota2.com/workshop/requirements]Hero Reference[/url] pages and [url=http://www.dota2.com/workshop/#creation]Asset Creation Guidelines[/url].[/*]  [/list]    [h2][url id=launch][/url][/h2][h2]LAUNCH ITEM TOOLS[/h2][list]  \t[*]Launch Dota 2 in Steam and click the button that says \u0022Launch Dota 2 - Tools\u0022[/*]  [/list]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/workshop_account_preparation/choose_launch_dota_tools.jpg[/img]​\n\n[list]  \t[*]In Workshop Tools, click \u0022Launch Item Tools.\u0022[/*]  [/list]\n\n  [img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/workshop_account_preparation/launch_item_tools2.jpg[/img]\n\n[list]  \t[*]Item tools are in the upper section of the Launch window. The lower section pertains to Game Mod tools. [/*]  [/list]    \n\n[h2][url id=createitem][/url]​CREATE NEW ITEM[/h2][list]  \t[*]In the next window, click \u0022Create New Item\u0022[/*]  [/list]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/submission/create_new_item_crop.jpg?[/img]\n\n[h2]​[url id=itemtype][/url][/h2][h2]SELECT ITEM TYPE[/h2][list]  \t[*]In the \u0022What are you publishing?\u0022 page, select the item type you wish to submit.    \t[list]  \t\t[*]\u0022Hero Item...\u0022 will contain drop-down lists where you can choose a hero and an item slot (including ability models)[/*]  \t\t[*]\u0022Images...\u0022 will contain a drop down list where you can choose Loading Screen, Team Logo, Emoticons, or Cursor Pack.[/*]  \t\t[*]\u0022Contract Only\u0022 is used if Valve has contacted you or if you are submitting a [url=https://support.steampowered.com/kb/1719-OPHL-1139/dota-2-league-tickets]League ticket[/url]. It is not used for submitting items.\n\n[/*]  \t[/list]  \t[/*]  [/list]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/workshop_account_preparation/select_item_to_upload.jpg?v=1466444802[/img]​\n\n[h2][url id=inputs][/url][/h2][h2]SELECT INPUTS[/h2][list]  \t[*]Inputs will vary according to the item type. [/*]  \t[*]To fill most of these fields you\u0027ll browse to your model, texture, animation, image, or music files. [/*]  [/list]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/submission/select_inputs.JPG?[/img]​\n\n[h1][url id=inputattach][/url][/h1][h1]INPUT ATTACHMENTS[/h1][list]  \t[*]Details about typical creature attachments can be found on the [url=https://support.steampowered.com/kb/7823-RUAZ-5739/dota-2-workshop-ability-models-summoned-units#attachments]Ability Model[/url] and [url=https://support.steampowered.com/kb/8986-WRAZ-1046/dota-2-workshop-couriers#attachments]Courier[/url] pages.[/*]  \t[*]Other attachment needs will vary per item and will be described in the workshop tool.[/*]  \t[*]Ability models that can use Valve\u0027s default skeleton will have the default attach bone names automatically filled in.[/*]  \t[*]Some hero wearables that use default Valve particles, such as bow weapons, may have the joint bones automatically filled in since these will use the default skeleton. [/*]  \t[*]For custom skeletons you\u0027ll need to type in the exact names of attach bones (typically the head, hands and root for creatures), so make a note of these before starting your submission.​[/*]  \t[*]You will have the chance to reposition these attaches in the preview window after you compile your item.[/*]  [/list]\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/submission/attach_bone_name.jpg[/img]\n\n\n[h2]​SAVE YOUR SESSION[/h2][list]  \t[*]It\u0027s highly recommended that you save your workshop session by clicking the button in the upper left after filling in the inputs to avoid having to add this information again if you have to revise or restart your submission.[/*]  [/list]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/submission/save_session.jpg[/img]\n\n[h2][url id=compile][/url]​[/h2][h2]COMPILE YOUR ITEM[/h2][list]  \t[*]After saving the session, click \u0022Next\u0022 in the lower right to compile the item.[/*]  [/list]\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/submission/next_button.jpg[/img]​\n\n[h2]IMPORT LOG[/h2][list]  \t[*]This log text shows the compile processes and results for your model. [/*]  \t[*]If you encounter problems with your model compile, look at the Import Log to find errors. Sometimes a model compile error occurs because of a texture problem.[/*]  [/list]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/submission/import_log_crop.jpg?[/img]\n\n[list]  \t[*]Click \u0022Next\u0022 after a successful compile.[/*]  [/list]    [h2][url id=previewmodel][/url][/h2][h2]PREVIEW MODEL[/h2][list]  \t[*]​You\u0027ll see your compiled model in the tool\u0027s model viewer. [/*]  \t[*]Ensure that NPCs are oriented  facing forward and upright for the bind pose because incorrect orientation can affect hitbox placement.[/*]  [/list]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/submission/orientation_incorrect.jpg?[/img]   [img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/submission/orientation_correct.jpg[/img]\n\n[list]  \t[*]Ensure that models for some hero items that become projectiles during abilities, such as thrown weapons for Pudge, Huskar and Enchantress, match the bind pose orientation of the hero\u0027s default weapon.[/*]  [/list]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/submission/pudge_hook_orientation.jpg[/img]\n\n[h1]PREVIEW SETTINGS[/h1][olist]  \t[*]You can click the gear icon to hide the model viewer\u0027s grid or change the background colors if you wish to use this pane for image captures.[/*]  \t[*]To see your items reacting to different animations, select these from the animation sequence drop down list.[/*]  \t[*]Select \u0022Show Low-Res Model\u0022 to test the LOD 1 mesh as well as the LOD 0 mesh against important animations. [/*]  [/olist]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/submission/preview_model.JPG[/img]\n\n[h1][url id=editattach][/url][/h1][h1]EDIT ATTACHMENTS[/h1][list]  \t[*]To edit the position and orientation of attachments:    \t[olist]  \t\t[*]Click \u0022Edit Origin\u0022 or \u0022Edit Angles\u0022. [/*]  \t\t[*]This will activate the attach dropdown list you can use to select which attachment you will be editing.[/*]  \t\t[*]Use the controls in the viewport to move or rotate your attachment.[/*]  \t\t[*]Save your session again to preserve these settings.[/*]  \t[/olist]  \t[/*]  [/list]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/submission/attach_edit.jpg?[/img]\n\n[h1]MODEL TROUBLESHOOTING[/h1][list]  \t[*]If your model\u0027s mesh is disconnected or the weighting is distorted, please see [url=https://help.steampowered.com/en/faqs/view/5D5F-A5BD-C25B-7205#refmodel]this section[/url] of our Item Troubleshooting page.[/*]  [/list]    [h2][url id=previewgame][/url][/h2][h2]PREVIEW IN GAME[/h2][list]  \t[*]Some items have special requirements for testing. These may be noted in the submission tool, on the resource page for that hero or in the web guidelines for that item type.[/*]  \t[*]The workshop tool will allow you to test in-progress items that are initially overbudget or that are missing textures. This will help you easily see items in game early in the creation process in order to discover model or size problems when it\u0027s easier to make changes. You will need to adjust the model and textures to be within the item budget requirements before you can do the final submission to the workshop.[/*]  \t[*]There are now options to use the Demo Mode buttons for Refresh, Level Up and more in the workshop tool when testing items in game along with these workshop-specific options:  \t[list]  \t\t[*]\u0022Toggle Day/Night\u0022 - useful for testing items in different lighting. You can also type dota_daynightcycle_toggle in the game console.[/*]  \t[/list]  \t[/*]  [/list]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/submission/workshop_toggle_render.jpg[/img]​\n\n[list]  \t[*]\u0022Hero Display Mode\u0022 - this will cycle the test models through a variety of render display modes. This render display will carry through to the tool\u0027s model preview window. \u0022Desaturated\u0022 is particularly valuable for assessing texture values in game. You can also display desaturated textures by typing r_hero_debug_render_mode 5 in the game console.[/*]  [/list]\n\n​[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/shaders/values_greyscale_crop.jpg[/img]\n\n[list]  \t[*]Remember - your item\u0027s appearance from above in game view is just as important as its closeup appearance in loadout.[/*]  \t[*]Click \u0022Next\u0022 when done testing.[/*]  [/list]    [h2][url id=editportrait][/url][/h2][h2]EDIT PORTRAIT[/h2][list]  \t[*]If you are submitting a courier, ward, or hero ability model, you will need to create a portrait for it.[/*]  \t[*]These item types should start with the default item\u0027s portrait as a template. You can either keep this or create a custom portrait.[/*]  \t[*]If there are portrait animations, select the \u0022ACT_DOTA_CAPTURE\u0022 animation activity to ensure correct framing.[/*]  \t[*]If your courier, ward or ability model uses its in-game idle for its portrait but is moving too much to stay in the frame, you may need to create a custom portrait animation with reduced movement.[/*]  \t[*]Hero mounts are considered part of the hero and don\u0027t have their own portrait.[/*]  \t[*]Save your session again after creating a portrait - this will retain the portrait settings for future revisions.[/*]  [/list]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/submission/edit_portrait.JPG?[/img]​\n\n[h2][url id=makerev][/url][/h2][h2]MAKE REVISIONS[/h2][list]  \t[*]You don\u0027t have to submit your first pass of an item to the workshop. You can take it as far as compiling the model in the tool and previewing it in game, then save your session, and exit the tool to do more work before making your final submission. [/*]  \t[*]To reload an existing session for an item you haven\u0027t submitted yet, return to the first page, click \u0022Create New Item\u0022 and then, on the following page, click \u0022Load Session\u0022 in the lower left.[/*]  [/list]    [h2][url id=submititem][/url][/h2][h2]SUBMIT YOUR ITEM TO THE STEAM WORKSHOP[/h2][list]  \t[*]​Once you are done previewing and revising your item, continue clicking \u0022Next\u0022 to take the item through to the final workshop submission.[/*]  \t[*]Once the item is submitted to the Steam workshop, finalize the revenue shares.[/*]  \t[*]Save your final workshop session.[/*]  \t[*]If you have problems submitting your item, see our [url=https://help.steampowered.com/en/faqs/view/5D5F-A5BD-C25B-7205]Item Troubleshooting page[/url].[/*]  [/list]    [h2][url id=collection][/url][/h2][h2]ITEM COLLECTIONS [/h2][list]  \t[*]You can put all items for a hero\u0027s item set or other combinations of items (such as a courier and loading screen) into a collection on the workshop by going to the [url=https://steamcommunity.com/workshop/browse/?appid=570\u0026browsesort=trend\u0026section=collections]Browsing: Collections[/url] part of the Steam Dota Workshop, clicking \u0022Create Collection\u0022 , choosing the correct collection type and following the instructions.[/*]  [/list]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/submission/create_collection.JPG[/img]\n\n[list]  \t[*]NOTE: By default the middle collection type option is selected. For most Dota collections, you will need to select the top option, \u0022Items that are a set\u0022. If you don\u0027t select this option, your collection may not display in some of the workshop searches our economy team uses and community votes may not be applied to the items within your collection.[/*]  [/list]\n\n[img]http://cdn.dota2.com/apps/dota2/images/workshop/guidelines/submission/collection_type_button.JPG[/img]\n\n[h2][url id=update][/url][/h2][h2]UPDATING WORKSHOP SUBMISSIONS[/h2][list]  \t[*]​​If you need to update your item once it has been submitted to the workshop, you can select it from your list of submitted items in the tool\u0027s Workshop Manager and use the \u0022Edit\u0022 menu to edit or re-upload your item.[/*]  \t[*]​Unless you need to change payment shares or are submitting alternate versions of your submissions, it\u0027s best to keep updating the same workshop submission rather than doing a new submission every time there\u0027s a revision. This is less confusing for the community members who are viewing and voting for the items and for the Valve developers who are tracking submissions.[/*]  \t[*]If you need to change the payment shares of an item, you will need to do a new, separate workshop submission.[/*]  \t[*]If you would like to show your appreciation of a pre-approved Dota Workshop [url=http://steamcommunity.com/workshop/about/?appid=570#service_providers]Service Provider[/url], you have the option to give them a percentage of Valve\u0027s revenue if the items are sold on the Dota store.[/*]  [/list]\n\n[h2]Related FAQs[/h2]\n[list]\n[*][url=https://help.steampowered.com/en/faqs/view/166F-D277-FAFA-8A4B]Item FAQ[/url]\n[*][url=https://help.steampowered.com/en/faqs/view/5D5F-A5BD-C25B-7205]Item Troubleshooting[/url]\n[*][url=http://www.dota2.com/workshop/]Dota 2 Item Workshop Guidelines Homepage[/url]\n[/list]\n[h2] [/h2]",
  "title": "Dota 2 Workshop - Submitting Items"
}