{
  "faq_id": 9006745404719029267,
  "language": 0,
  "version": 2,
  "content": "When attempting to launch a game, Steam displays an error message:\n[list]\n[*] Failed to start game (app already running)\n[/list]\nThis error is most commonly seen when launching a game that has closed improperly with a silent crash, or that is failing to launch properly.\n\nSometimes, the game may already be running under a different user account within your operating system.\n\n[h2]Verifying your Game Files[/h2]In some cases, this error message will appear when there is an issue with the installation of a game. Complete the instructions as they are shown in the following link:\n\n[url=https://help.steampowered.com/en/faqs/view/0C48-FCBD-DA71-93EB]Verifying your Game Cache Files (GCF)[/url]\n\n[h2]Forcing a silently crashed or hanging game to close[/h2][b]Windows operating systems:[/b]\nTry the following to close any hung game processes that may be preventing the game from launching correctly:\n[olist]  \t[*]Press the following keys at the same time: [b]Ctrl  Shift  Esc[/b]. This will launch the Windows Task Manager.[/*]  \t[*]Select the Processes tab.[/*]  \t[*]Find and select the game\u0027s executable file in the list. You can obtain detailed information by expanding the Description column.[/*]  \t[*]Right-click on the selected process.[/*]  \t[*]Select \u0022End Process\u0022.[/*]  \t[*]If Windows asks you to confirm that you wish to quit this game, click the \u0022End Process\u0022 button to confirm.[/*]  [/olist]\nThe game should now be closed. You can try launching the title again, or proceed to other troubleshooting options.\n\nIf this fails, or Windows is having trouble closing the game with this method, try restarting your computer.\n\n[b]Other operating systems (macOS, Linux):[/b]\nTry restarting your computer. Once your computer restarts, perform any troubleshooting operations that you intend before attempting to launch the game again.\n\n[h2]Opting out of the current Steam beta[/h2]If you are currently participating in the Steam beta, try opting out and testing the issue again.\n[olist]  \t[*]In Steam, click on \u0022Steam\u0022 in the upper left, then choose the \u0022Settings\u0022 menu. (Preferences on Mac)[/*]  \t[*]On the \u0022Account\u0022 tab under \u0022Beta Participation\u0022 click the \u0022Change...\u0022 button.[/*]  \t[*]Select the \u0022NONE - Opt out of all beta programs\u0022 from the drop down list and click \u0022OK\u0022.[/*]  \t[*]You will be prompted to restart Steam, please select the \u0022Restart Steam\u0022 button.[/*]  [/olist]\nParticipants in the Steam beta programs should always test both the beta and normal versions of Steam when troubleshooting an issue.\n\n[h2]Different user account on computer running game[/h2]\nIf you think there may be another user account on your computer that may be running this title, try logging out of all other user accounts, restarting your computer and testing the issue again.\n\n[h2]Further Troubleshooting[/h2]If the game is still failing to launch correctly, you will need to contact the support team for that game to troubleshoot the crash/failure to launch.    [section style=important]  [h3]Important:[/h3]You can find the third-party game\u0027s support contact information by selecting the game in your Steam Library and then on the right hand side select \u0022Support\u0022 from the tabs available above the \u0022Activity\u0022 section.[/section]\n\n\n\n\n\n\n\n",
  "title": "Failed to start game (app already running)",
  "timestamp": "2021-07-10T19:49:55+00:00"
}