{
  "faq_id": 1166099635598618949,
  "language": 0,
  "version": 5,
  "content": "D3D errors typically occur if you are running the game at settings which your machine does not adequately support or if you are running outdated video drivers. Other potential causes include outdated Windows installs or larger video card issues.\n\n[h2]Reduce your video resolution[/h2]If you have recently increased or changed your game\u0027s video resolution, a good first step is to revert your resolution to a setting that previously worked and re-test the issue. If you are able to play at a lower resolution we recommend using that going forward.\n[h2]Use the -autoconfig launch option[/h2]If you would like the game to automatically choose appropriate settings for your machine, please use the [i]-autoconfig[/i] [url=https://help.steampowered.com/en/faqs/view/2542-790F-14F8-D66A#autoconfig]launch option[/url].\n[h2]Update your video drivers[/h2]Before updating your drivers, please visit the [url=http://www.update.microsoft.com/microsoftupdate/v6/default.aspx?ln=en-us]Windows Update FAQ[/url] and make sure you have all of the critical updates and the .NET Framework installed.\n\nTo update your video drivers, please follow the instructions below for your current operating system:\n[list]  [*][url=https://support.microsoft.com/en-us/help/4028443/windows-10-update-drivers]Windows 10[/url][/*]  [*][url=https://support.microsoft.com/en-us/help/15046/windows-8-download-install-drivers]Windows 8[/url][/*]  [*][url=https://help.steampowered.com/en/faqs/view/6073-E74C-A033-48A4]macOS[/url][/*]  [/list]  \n[h2]None of these solutions worked. What can I do now?[/h2]If you have reduced your video resolution, are running the game using settings your machine can adequately support, and have the latest drivers for your video card and are still receiving D3D errors it\u0027s possible that your system has gotten into an unusual state. Please restart your machine and re-test the issue.\n\nIf the issue persists, please set the following launch option for the affected game: [i]-dxlevel 81[/i]\n\n[/h5] If you are attempting to play Left 4 Dead, Left 4 Dead 2, Portal 2, or Counter-Strike: Global Offensive, you must set your launch option to [i]-dxlevel 90[/i] instead.",
  "title": "Failed to create D3D Device"
}