{
  "faq_id": 7717593881592806808,
  "language": 0,
  "version": 9,
  "content": "Family View is a feature for parents and families to establish their own rules for what components of Steam are accessible.\n\nYou can use Family View to limit an account\u0027s access to a subset of its content and features. With Family View, access to the Steam Store, Library, Community, Friends content and other features may be gated by the entry of a secret PIN.\n\n[list]  \t[*][url=#setitup]How do I set up Family View?[/url][/*]  \t[*][url=#changeitup]How do I change my Family View options?[/url][/*]  \t[*][url=#disableit]How do I disable Family View?[/url][/*]  \t[*][url=#forgotpin]How do I reset my PIN?[/url][/*]  [/list]\n[url id=setitup][/url]  [h1]Setting up Family View[/h1]We encourage you to create a Steam account with your child. If there are features of Steam that you would like to exclude from the experience, you can restrict access using Family View. You may also choose to enable Family View on your own Steam account if you would rather they share your Steam Account. \nIf you are currently logged in to the Steam account for which you want to set up Family View, you can simply click [url=https://store.steampowered.com/parental/set]here [/url]to start the family view setup wizard. Otherwise, please follow these steps in the Steam Client or on the Steam website: \n\n[h2]To enable Family View in the Steam Client:[/h2]\n[olist]  \t[*]Log into the Steam account your child will use.[/*]  \t[*]Click the [b]Steam [/b]menu in the top menu bar.[/*]  \t[*]Open the Settings option.[/*]  \t[*]Go to the \u0022Family\u0022 tab on the left side of the window that opens.[/*]  \t[*]Click \u0022Manage Family View\u0022 to start the Family View wizard.[/*]  \t[*]Step through the wizard to select the content and features you’d like to be accessible while in PIN-protected Family View.[/*]  [*]Set a recovery email address. [b]Note:[/b] This can be different than the email address associated with the account.\t[*]Select and confirm your new PIN.[/*]  [*]You will then be sent a confirmation code to the [b]account\u0027s[/b] associated email address. [*]Find and enter the code to complete setup.[/olist]    \n\n[h2]To enable Family View on the Steam Website:[/h2]\n[olist]  \t[*]Log into the Steam account your child will use.[/*]  \t[*]Click on the [b]user account name[/b]in the top right corner of the website.[/*]  \t[*]click on the menu entry [b]Account Details[/b].[/*]  \t[*]Scroll down to the section under the headline \u0022Family Settings\u0022.[/*]  \t[*]Click \u0022Manage Family View\u0022 to start the Family View wizard.[/*]  \t[*]Step through the wizard to select the content and features you’d like to be accessible while in PIN-protected Family View.[/*]  [*]Set a recovery email address. [b]Note:[/b] This can be different than the email address associated with the account.\t[*]Select and confirm your new PIN.[/*]  [*]You will then be sent a confirmation code to the [b]account\u0027s[/b] associated email address. [*]Find and enter the code to complete setup.[/olist]    \n\n[h1]Family Games Library[/h1]If you’ve opted to only allow access to a subset of the account’s library, your account’s library will include a new group called Family Games. Family Games are the games you’ve chosen to remain accessible while in Family View.\nIn order to add and remove games from this list you first need to disable Family View:\n[list]  \t[*]Log into the account.[/*]  \t[*]Select the Family View icon.[/*]  \t[*]Enter your Family View PIN to exit Family View.[/*]  [/list]\nThen, you can authorize the game with one of two methods:\n[list]  \t[*]Find the game in your Library and right-click on the game and click, then Manage \u003E \u0022Add to / Remove from Family Games\u0022.[/*]  \t[*]Visit the Family tab within Settings and click \u0022Manage Family View\u0022 to run through the Family View wizard again. This will provide the option to add or remove games from your Family Games group. Once finished, to return to Family View select the Family View icon and confirm your choice. [/*]  [/list]    [url id=changeitup][/url]  \n[h1]Changing Family View options[/h1]To modify your Family View options:\n[olist]  \t[*]First, log into the account.[/*]  \t[*]Select the Family View icon.[/*]  \t[*]Enter your Family View PIN to exit Family View.[/*]  \t[*]Open the Steam Settings menu.[/*]  \t[*]Go to the \u0022Family\u0022 tab on the left side of the window that opens.[/*]  \t[*]Click \u0022Manage Family View\u0022 to start the Family View wizard again.[/*]  \t[*]Step through the Family View options wizard to select new content and features for Family Mode. You’ll also be asked to select a PIN, which you’re welcome to change or leave the same.[/*]  [/olist]    \n[url id=disableit][/url]  \n[h1]Disabling Family View[/h1]To remove Family View from your or your child’s account:\n[olist]  \t[*]Exit Family View.[/*]  \t[*]Open the Steam Settings menu.[/*]  \t[*]Go to the \u0022Family\u0022 tab on the left side of the window that opens.[/*]  \t[*]Click \u0022Manage Family View\u0022 and select \u0022Disable Family View\u0022 in the Family View window. Confirm your selection on the next window. Note: If using Big Picture, uncheck the \u0022Use Family View with this account\u0022 box in the first page of the Family View wizard. [/olist] This will remove all restrictions from the account. If you wish to enable Family View in the future, simply revisit the \u0022Family\u0022 tab in Settings and step through the Family View wizard once more. Your selected options will remain the same if you disable and re-enable the feature again in the future.\n\n[url id=forgotpin][/url]  \n[h1]Resetting your PIN[/h1]If you have lost or forgotten your PIN and a recovery email address has been specified, you are able to request an email containing a link to disable Family View on your account here: [url=http://store.steampowered.com/parental/requestrecovery]http://store.steampowered.com/parental/requestrecovery[/url]\n\nIf you haven\u0027t set a recovery email address yet, you can do so by visiting the following link: [url=http://store.steampowered.com/parental/setrecovery]http://store.steampowered.com/parental/setrecovery[/url]\n\nIf you have lost your PIN and haven\u0027t set a recovery email, please contact [url=https://help.steampowered.com/en/faqs/view/6F69-0324-B2DB-6E7E]Steam Support[/url]\n\n",
  "title": "Family View",
  "timestamp": "2022-02-20T09:00:38+00:00"
}