{
  "faq_id": 4086435168742248526,
  "language": 0,
  "version": 5,
  "content": "      \t            \t[img]https://support.steampowered.com/steamvr/Alyx/AlyxBanner.png[/img]  \t  \t        \t[h1]Performance Tips[/h1][h4]Intro[/h4]Half-Life: Alyx is built to push your system to its limits. The first time you launch Half-Life: Alyx (or when your hardware changes), the game will automatically benchmark your CPU and GPU, look at the available system memory, and try to pick the most appropriate graphics settings. That said, there\u0027s always room to fine-tune and push the envelope further. Half-Life: Alyx can keep an 8-core CPU with a 12GB GPU completely busy running complex VR gameplay at up to 144Hz—but even if your PC doesn\u0027t look anything like that, we encourage looking through the game\u0027s advanced performance options and seeing how high your system can go. From the main menu, navigate to (visit... [b]Settings \u003E Performance[/b] and click the gear icon in the bottom left corner).\n\nSince every PC is different, there are always ways to further fine tune the experience to get the most out of your setup. If you are having technical issues or think you could be getting better performance out of your system when playing Half-Life: Alyx, here are some performance and troubleshooting tips.\n\n[h4]Troubleshooting Checklist[/h4]If Half-Life: Alyx isn\u0027t running as well as you think it should on your PC, we recommend running through this checklist first. These may sound obvious, but more issues than you\u0027d expect are fixed just by investigating the basics.\n\n[list]  \t\t\t[*]Make sure you have the latest [url=https://www.geforce.com/drivers]NVIDIA[/url] or [url=https://www.amd.com/en/support]AMD[/url] driver. Both have released game-optimized drivers for Half-Life: Alyx that we recommend using.[/*]  \t\t\t[*]Make sure your primary hard drive has plenty of free space.[/*]  \t\t\t[*]Try closing other software you have running in the background - even web browsers can sometimes use a surprising amount of system resources. In particular, check if you have other applications open using dedicated GPU memory. (You can check this by pressing ctrl-shift-esc to open the Windows Task Manager, browse to the Details tab, right-click the header, choose \u0022Select Columns\u0022 and then check \u0022Dedicated GPU memory.\u0022)[/*]  \t\t\t[*]Check the robustness of your VR setup, as bad tracking can sometimes feel similar to low framerate. Consult the documentation of your VR system. For SteamVR tracking guidance when using Valve Index or HTC Vive, visit [url=https://help.steampowered.com/en/faqs/view/1AF1-670B-FF5C-3323]this page.[/url][/*]  \t\t[/list]  \t[h4]Tuning in SteamVR[/h4]There are further performance tuning tools available within the SteamVR settings menu. These settings are worth double checking especially if you think you might have changed them for other games.\n\n[list]  \t\t\t[*]Check your SteamVR render resolution by going to the SteamVR menu and navigating to [b]Settings \u003E Video \u003E Render Resolution[/b]. Try setting the render resolution to \u0022Auto\u0022 if it\u0027s not already. If that noticeably helps improve your performance, you can try reducing it further.[/*]  \t\t\t[*]If you have a Valve Index headset, Half-Life: Alyx can run at ultra-high framerates up to 144Hz. You can adjust the refresh rate by going to the SteamVR menu and navigating to [b]Settings \u003E General \u003E Refresh Rate[/b]. Reducing the refresh rate can reduce the load placed on your GPU. If you think you are experiencing frame rate lag caused by an overtaxed GPU, try lowering your refresh rate to 90Hz.[/*]\t\t  \t\t[/list]  \t[h4]In-game Performance Settings[/h4]Half-Life: Alyx\u0027s advanced performance settings are available by browsing to [b]Settings \u003E Performance[/b], and clicking the gear icon in the bottom left corner. If the game is already running great, and you know your PC well enough to think you can push it further, this is the place to look for more knobs to crank up.\n\nIf game performance is worse than you think it should be and none of the above helps, try running the game on \u0022Low\u0022 fidelity settings, by opening the game menu and browsing to [b]Settings \u003E Performance \u003E Low Fidelity[/b]. If that helps your performance significantly, try turning it back up to a point your computer is comfortable with.\n\n[list]  \t\t\t[*][b]Note that Texture Quality is independent of overall fidelity[/b], so you can try the same process but with texture quality. Try setting them to \u0022Low\u0022 and then working your way back up. The Texture Quality setting can be adjusted in Advanced Performance Settings, by selecting the gear icon in the lower left corner of the Performance settings page.[/*]  \t\t\t[*]The best place to test performance is inside the game itself, instead of the main menu. All performance settings can be adjusted while you are in game, so if you are seeing performance improvements from adjusting the overall Performance quality toggle, you can go into Advanced Settings and tune from there.[/*]\t\t  \t\t[/list]          [hr][/hr]        \t",
  "title": "Half-Life: Alyx - Performance Tips"
}