{
  "faq_id": 6164862055093213372,
  "language": 0,
  "version": 14,
  "content": "[list]     [*][url=#overview]Overview[/url][/*]     [*][url=#spectate]Spectating Games[/url][/*]     [*][url=#basics]HLTV Basics[/url][/*]     [*][url=#broadcast]Broadcasting Games[/url][/*]     [*][url=#record]Recording HLTV demos[/url][/*]     [*][url=#large]Larger Broadcasts[/url][/*]     [*][url=#config]HLTV Configuration[/url][/*] [/list]\n[section style=important][h5]Steam Broadcasting for all Steam games[/h5]For information on Steam\u0027s built in game broadcasting/spectating feature for all games on Steam, see the [url=https://help.steampowered.com/en/faqs/view/548F-BC55-89EB-1BC8]Steam Broadcasting[/url] page.[/section][url id=overview][/url][h4]Overview[/h4]Half-Life TV offers the ability to have an unlimited number of spectators watching online games. They can follow the game just like they would as a spectator on the game server. Spectators are invisible to players and can\u0027t interact with the running game in any way. Each spectator can choose any view position or choose any player to track individually.\n\nTo have the most enjoyable spectating experience, spectators can enable the Auto-Director mode. Then the camera is changed automatically so that only interesting scenes are shown from a suitable viewpoint. Thus the spectator can lean back and won\u0027t miss any relevant action. All the time, spectators may communicate between each other using the standard HL chat system.\n\nMost popular Half-Life mods are supported. HLTV providers have full control over their HLTV system, may change number of spectator slots, add text messages or change the HLTV logo.\n\nThe broadcast is delayed by a customizable amount of time, by default 30 seconds. This ensures that the playing teams can\u0027t use HLTV to get any usable information about their opponents. Providing a single HLTV server for up to 100 spectators is an easy task and doesn\u0027t need any changes in default configurations.\n\nInstalling a larger HLTV network for thousands of spectators needs some more planning time and experience about required bandwidth and CPU/RAM demands [url=#large](see Larger Broadcasts)[/url]. [section style=note]For information on broadcasting and spectating of Source games see [url=https://developer.valvesoftware.com/wiki/SourceTV]developer Wiki on SourceTV[/url].[/section][url id=spectate][/url]\n[h4]Spectate[/h4]To watch a HLTV game, start Half-Life, select \u0027Find Servers\u0027 from the main menu. To search for currently broadcasted games, choose the \u0027Spectate\u0027 section and hit \u0027Refresh All\u0027. After the list has been updated, double click on the server you want to spectate and you\u0027ll be connected.\n\nIf computer game leagues announce important matches to be broadcasted via HLTV, they often provide IP:Port addresses of their HLTV servers. Instead of searching them via the server browser, you can also go to the \u0027Favorites\u0027 folder and add the HLTV address to your server list by pressing the right mouse button. Otherwise, you can also open the console window and use the \u0027connect\u0027 command to spectate a certain game.\n\nFor example:\n\nconnect 192.168.130.42:27020\n\nThe default HLTV port number is 27020, but may be changed. It should always be included in the given address, since commonly this port number is different from the default port number 27015.\n\nYou can spectate the game in different modes: Chase Cam, First Person, Free Look, Map Overview and Map Chase. The easiest way to change modes is to press the JUMP key (default SPACE). Alternatively you can use the spectator menu, which can be enabled by pressing the DUCK key (default CTRL). Here you can customize your personal view style and enable the Auto-Director Mode. Press USE (default E) to cycle through the different Picture-In-Picture modes.\n\nThe following HL console commands can be used to customize spectator settings:\n[list]     [*][i]spec_autodirector (0|1) [/i]- turns Auto Director mode on or off[/*]     [*][i]spec_drawcone (0|1) [/i]- shows your view cone in map overview mode[/*]     [*][i]spec_drawnames (0|1) [/i]- shows player names under their icons[/*]     [*][i]spec_drawstatus (0|1) [/i]- shows game information (time, map etc)[/*]     [*][i]spec_pip (0|1) [/i]- turns Picture-In-Picture mode on or off[/*]     [*][i]spec_menu [/i]- opens the spectator menu[/*]     [*][i]spec_help [/i]- shows a help screen[/*]     [*][i]spec_mode (1-6) [(0-4)] [/i]- set the main view mode, seconds parameter is the PIP mode. Not all combinations are valid.[/*] [/list]\n\nMain modes are:\n[list]     [*][b]1[/b] : Locked Chase[/*]     [*][b]2 [/b]: Free Chase[/*]     [*][b]3[/b] : Free Roaming[/*]     [*][b]4[/b] : First Person[/*]     [*][b]5[/b] : Map Overview[/*]     [*][b]6[/b] : Chase Map Overview[/*] [/list]\n\nPIP modes are:\n[list]     [*][b]0[/b] : PIP off[/*]     [*][b]1[/b] : Free Chase[/*]     [*][b]2[/b] : First Person[/*]     [*][b]3[/b] : Map Overview[/*]     [*][b]4[/b] : Chase Map Overview[/*] [/list][url id=basics][/url]\n[h4]Basics[/h4]The core of the HLTV broadcasting system is the HLTV server, also called HLTV proxy. The HLTV executable is a console application that works much like a HL dedicated server. To broadcast a game running on a certain game server, the HLTV proxy connects to this server just like a normal player.\n\nSpectators connect themselves to the HLTV proxy and the game data stream is relayed through the HLTV proxy to all connected spectator clients. The next figure shows a basic HLTV configuration:\n\nHL Game Server -\u003E HLTV Proxy =\u003E Spectator Clients\n\nThe number of clients that one HLTV proxy can serve depends on available hardware and network resources. Theoretically, a single proxy can hold a maximum of 255 spectator clients. But be careful, even a proxy with 100 spectator clients needs a full 2 MBit line to run smoothly. If more spectator slots are needed, the required network load must be distributed over multiple HLTV proxies.\n\nThe first HLTV proxy connected to the game server is called the Master proxy, which sets the general broadcast settings like game stream delay or packet rate. All other HLTV proxies linked to this proxy are the Relay proxies. Their total number and link order is not restricted, they may form a chain or tree of proxies. Most important is that their location is in different networks to ensure a balanced bandwidth usage.\n\n-\u003E HLTV Relay Proxy 1 =\u003E Spectator Clients\n\nHL Game Server -\u003E HLTV Master -\u003E HLTV Relay Proxy 2 =\u003E Spectator Clients\n\n-\u003E HLTV Relay Proxy 3 =\u003E Spectator Clients\n[url id=broadcast][/url]\n[h4]Broadcasting Games[/h4]Let\u0027s assume the most simple configuration, a single HLTV proxy in a LAN environment. This is a very common situation and the default HLTV settings doesn\u0027t need to be changed. Choose a dedicated computer as your HLTV proxy and install the Half-Life Dedicated Server, which also includes all files needed by a HLTV proxy. This isn\u0027t needed if Half-Life is already installed.\n\nStart the HLTV application (HL icon with a small camera) and the HLTV console will open, showing some initialization messages (if that takes a long time, HLTV maybe can\u0027t resolve some IP addresses, then start HLTV with the \u0027-nodns\u0027 command line option). Then the console is ready to accept your commands, here we use \u0027\u003E\u0027 as the console prompt. First give your HLTV proxy an unique name:\n\n\u003E [i]name \u0022My HLTV Proxy\u0022 [/i]\n\nLet\u0027s assume you have started the proxy on host [b]192.168.1.2[/b] and the game server you want to spectate is running on host [b]192.168.1.3:27015[/b]. Then connect the HLTV proxy to this game server by typing:\n\n\u003E [i]connect 192.168.1.3:27015 [/i]\n\nAfter a few seconds HLTV will be fully connected and ready to serve spectator clients. Use the \u0027 [b]status[/b] \u0027 command to verify that the HLTV proxy has connected properly :\n\n[expand style=details]\n\u003E [i]status [/i]\n\n--- HLTV Status ---\n\nOnline 00:23, FPS 79.0, Version 2435 (Win32)\n\nLocal IP 192.168.1.2:27020, Network In 1.7, Out 1.0, Loss 0.00\n\nLocal Slots 128, Spectators 0, Proxies 0\n\nTotal Slots 128, Spectators 0, Proxies 1\n\nSource Game Server 192.168.1.3:27015, Delay 30\n\nServer Name \u0022Half-Life dedicated server\u0022\n\nTime 01:35, Game \u0022valve\u0022, Map \u0022maps/rapidcore.bsp\u0022, Players 1\n\nThe [b]\u0027status\u0027[/b] command shows your own IP address, HLTV system cycles per second, total incoming and outgoing network traffic in kB/sec. Local slot and spectator numbers your HLTV proxy is providing, total numbers are the sum of all slots \u0026 spectators on all proxies broadcasting this game. The game source can be a game server, another HLTV proxy or a demo file.[/expand]\n[url id=record][/url]\n[h4]Recording HLTV demos[/h4]HLTV demo files are like normal recorded games in Half-Life, but you can choose any view point, view mode or player to chase during replay. To play back a HLTV demo, a HLTV proxy is not needed. Just start Half-Life and type in console [i]playdemo \u003Cdemoname\u003E [/i]or [i]viewdemo \u003Cdemoname\u003E [/i](viewdemo offers more options during playback like fast forward/backward, pause \u0026 slowmotion). To record a HLTV demo, connect the proxy to a game server (see [url=#broadcast]Broadcasting Games[/url] ) and type in console:\n\n[i]record (name) [/i]\n\nAll games will be recorded after issuing this command. The demo files will be saved in the current Mod directory, e.g. [b]\\cstrike[/b]. All demo files have a special naming convention [b]\u003Cname\u003E-\u003CYYMMDDhhmm\u003E-\u003Cmap\u003E.dem,[/b] including the given name, date/time and map name. Demo files record the same data as sent to spectator clients. That means also, the demo file records the game with the same delay as used for spectators. To verify, that a demo file is recorded use the [i]status [/i]command. The recording may be stopped with [i]stoprecording [/i].\n\nSometimes a HLTV broadcast is not wanted and the HLTV proxy is only used to record a demo file. In this case, some HLTV settings should be made to gain optimal recording results:\n\n[expand style=details]\n[i]maxclients 0 [/i]// don\u0027t allow any spectator clients\n\n[i]delay 0 [/i]// no game stream delay\n\n[i]rate 10000 [/i]// maximum data rate\n\n[i]updaterate 20 [/i]// standard update rate\n\n[i]nomaster 1 [/i]// don\u0027t register at master servers[/expand]\n[url id=large][/url]\n[h4]Large[/h4]Setting up a HLTV network that can handle a larger number of spectators (\u003E1000) is a difficult and time consuming task. The following guide should help to configure and run such a HLTV network. One of the most important rule should be [b]Quality, not Quantity[/b]. It\u0027s better to offer a smaller number of spectator slots, than operating at the maximum bandwidth limit, thus all spectators would suffer from lags and timeouts. Check carefully your available bandwidth capacity and calculate how many spectators can be handled by your HLTV servers. The average bandwidth demand per spectator is between 2 and 3 KB/sec and depends on the current mod, map and number of players. CPU and RAM shouldn\u0027t be a bottleneck on modern PC systems.\n\nThis list for common Internet connection types gives a feeling, how bandwidth-demanding HLTV can be:\n\n[list]     [*][b]ISDN 64 Kbps[/b] : 2 spectators[/*]     [*][b]DSL 128 Kbps[/b] (upstream) : 5 spectators[/*]     [*][b]T1 1.5 Mbps[/b] : 75 spectators[/*]     [*][b]LAN 10 Mbps[/b] : 500 spectators[/*]     [*][b]T3 75 Mbps[/b] : 4000 spectators[/*] [/list]\n\nUse the [i]maxclients [/i]command to set how many clients should be accepted by a HLTV proxy. Make sure that the [i]maxrate [/i]variable is set too a reasonable value, e.g. 3500 kilobits/sec. Lower values are possible, but make sure spectators don\u0027t get too much choke during a running game. Choke occurs when the server, factoring in your rate setting, determines that it can\u0027t send you an update yet because doing so would start to flood your connection.\n\nThe [b]maxrate[/b] command doesn\u0027t effect the bandwidth limit between HLTV proxies, only for spectator clients. To lower the general bandwidth demand, you can turn off the internal HLTV chat ( [i]chatmode 0 [/i]) or decrease the game update rate from the default value 20 to 10 ( [i]updaterate 10 [/i]). A lower update rate may save up to 25% network traffic and is an acceptable tradeoff in this case since spectators don\u0027t need a high update rate like real players do.\n\nA very common setup for large broadcasts is to use 2 dedicated HLTV servers to create a private and a public HLTV segment. Let\u0027s assume the game server is in a closed LAN and not accessible from outside. This ensures a maximum security against attacks (DOS etc) from outside. The HLTV master server is started within the LAN and its IP address should be kept secret. The second HLTV server is started outside the LAN with a global IP and is connected to the HLTV master server. This second HLTV server is the public HLTV dispatcher, which IP address is given to the audience. Any relay proxies are connected to this HLTV dispatcher. Thus the HLTV master server is in a secure LAN environment and can be used for demo recording or for HL clients serving video projectors. Spectators connect to the HLTV dispatcher and are relayed through the HLTV network to a relay proxy with a low usage. Thus the total network load is balanced between all connected HLTV proxies.\n\n[b]\u002B---- Private LAN -----\u002B \u002B------ Public Internet --------\u002B\n\n-\u003E HLTV Proxy 1\n\nHL Server -\u003E HLTV Master -\u003E HLTV Dispatcher -\u003E HLTV Proxy 2 -\u003E HLTV Proxy 3[/b]\n\nThe configuration files of HLTV master and HLTV dispatcher are different:\n\n[h5]master.cfg:[/h5][i]nomaster 1 [/i]// don\u0027t register at WON/STEAM master servers\n\n[i]proxypassword MyPWD [/i]// protect HLTV server\n\n[i]publicgame 0 [/i]// don\u0027t show game server IP\n\n[i]dispatchmode 0 [/i]// don\u0027t dispatch spectators\n\n[h5]dispatcher.cfg:[/h5][i]forcemaster 1 [/i]// register at WON/STEAM master servers\n\n[i]publicgame 0 [/i]// don\u0027t show game server IP\n\n[i]dispatchmode 2 [/i]// dispatch all clients to other proxies\n\n[i]hostname MyGame [/i]// public HLTV server name\n\nIf you\u0027re running 3 or more HLTV servers in total, it\u0027s a good idea to use RCON to manage them via a single server admin tool. To enable RCON on a HLTV server an [b]adminpassword[/b] must been set. Also [b]proxypassword[/b] should be set to ensure only known HLTV providers can connect to your HLTV network. Otherwise anybody can connect with slow HLTV proxies and disturb your network load balancing.\n[url id=config][/url]\n[h4]HLTV Configuration[/h4]A short note about console command syntax:\n[list]\n[*]A command description follows the following notation:\n[code]command (parameter) [(parameter)] - description[/code][*]A command may have one or more parameters. Parameters in brackets [] are optional.\n[/list]\n[b]Commonly used parameters are:[/b]\n\n[expand style=details]\n[b](string)[/b] : text, must be in quotation marks if text contains spaces \u0022My Name\u0022\n\n[b](n)[/b] : a whole number, e.g. 42\n\n[b](f)[/b] : a floating point number, e.g. 4.2\n\n[b](IP:Port)[/b] : an IP address, e.g. 192.168.130.42:27020\n\n[b](a|b|c)|[/b] : a set of options, a or b or c\n\n[b]connect (IP:Port)[/b] - connect HLTV proxy to game server (default port 27015)\n\n[b]disconnect[/b] - disconnects proxy from server, but doesn\u0027t stop the\n\nbroadcast. All spectator clients stay connected.\n\n[b]stop [(text)][/b] - disconnects from server, disconnects all clients and stops demo recording. Optional goodbye message.\n\n[b]quit[/b] - quits the HLTV process\n\n[b]retry[/b] - retries the last server connection\n\n[b]autoretry (0|1)|[/b] - if enabled, proxy will retry connection to server if connection was interrupted for any reason\n\n[b]name (text)[/b] - sets the HLTV proxy scoreboard name\n\n[b]hostname (text)[/b] - sets the HLTV host name for game browser list\n\n[b]serverpassword (text)[/b] - sets the game server password\n\n[b]adminpassword (text)[/b] - sets password for RCON \u0026 commentator\n\n[b]proxypassword (text)[/b] - sets password for other relay proxies\n\n[b]spectatorpassword (text)[/b] - sets spectator password. Will also exclude proxy from global load balancing\n\n[b]clients[/b] - lists connected spectator clients\n\n[b]proxies[/b] - lists connected relay proxies\n\n[b]players[/b] - lists players on game server\n\n[b]kick (ID)[/b] - kicks a spectator client from proxy\n\n[b]ban (IP)[/b] - bans an IP address (completely ignored)\n\n[b]clearbans[/b] - removes all IPs from ban list\n\n[b]say (text)[/b] - sends a text message to game server (chat with players)\n\n[b]msg (text) [(duration) (pos x) (pos y) (color hex rgba)][/b] - sends a text message to all spectators as big HUD text\n\n[b]localmsg (text) [(duration) (pos x) (pos y) (color hex rgba)][/b] - same as msg, but only seen by local clients\n\n[b]servercmd (string)[/b] - forwards console command to game server\n\n[b]clientcmd (group) (string)[/b] - forwards a console command to all clients of given group: 1=spectators, 2=proxies, 3=all\n\n[b]loopcmd (id) (n) (string)[/b] - loopcmd will execute (string) every (n) seconds.\n\n[b](id)[/b] is a number between 1 and 64 to identify this loopcmd.\n\n[i]loopcmd (id) none [/i]- will disable a looping command again.\n\n[i]loopcmd [/i]- without any parameter will list any command currently in the list.\n\n[i]signoncommands (string) [/i]- Console commands that will be executed by local spectator clients after connection is established.\n\nCommands may be separated by semicolons.\n\n[i]maxclients (n) [/i]- set spectator number limit for this proxy (default 128)\n\n[i]delay (n) [/i]- delays the game stream for n seconds on the Master Proxy.\n\nThe default value is 30 seconds to avoid cheating.\n\n[b]NOTE:[/b] If the delay is set to a value below 10 seconds (e.g. 0), the auto director function will be disabled.\n\n[i]rate (n) [/i]- bandwidth rate the game server sends data to the proxy.\n\n[i]updaterate (n) [/i]- game updates per seconds sent from server to proxy.\n\n[i]maxrate (n) [/i]- sets the maximum bandwidth rate for spectator clients\n\n[i]maxloss (f) [/i]- Sets the acceptable packet loss rate, default value is 0.05 (5%).\n\nIf packet loss is higher, new spectator clients will be rejected.\n\n[i]maxqueries (n) [/i]- maximum of status queries per second requested by server browsers\n\n[i]dispatchmode (0|1|2) [/i]- Dispatch mode 1 (AUTO) will redirect connecting clients to other proxies balancing work load between all proxies. In dispatch mode 2 (ALWAYS) any spectator clients will be redirected so this proxy serves only as dispatcher. Dispatch mode 0 (OFF) won\u0027t redirect any clients.\n\n[i]publicgame (0|1) [/i]- if public is 1, game server IP will be visible to spectators and \u0027joingame\u0027 is allowed.\n\n[i]offlinetext (string) [/i]- info text clients will see as reject reason if HLTV isn\u0027t broadcasting yet\n\n[i]chatmode (0|1|2) [/i]- if chatmode is 0, spectators can\u0027t chat. If set to 1, only spectators connected to the same proxy can see their chat messages. In chatmode 2 all spectators can chat amongst each other. (then Master and all Relay proxies must have set chatmode 2).\n\n[i]bannerfile (file) [/i]- specifies a TGA file (RGBA) that will be shown as logo in spectator GUI.\n\n[i]ping (host:port) [/i]- pings a HL server on the given port (default 27015)\n\n[i]nomaster (0|1) [/i]- if enabled, proxy won\u0027t register at WON/STEAM master servers\n\n[i]forcemaster (0|1) [/i]- if enabled, proxy will register at WON/STEAM master server\n\n[i]heartbeat [/i]- sends manually a status packet to WON/STEAM master servers\n\n[i]region (n) [/i]- set the region your HLTV proxy is located in.\n\n[i]rcon (string) [/i]- sends a remote control command to other servers\n\n[i]rconaddress (IP:Port) [/i]- sets the remote control target address\n\n[i]rconpassword (string) [/i]- sets the password for the remote controlled host\n\n[i]cheeringthreshold (f) [/i]- number of cheering players must be above this threshold to play the cheering sound (by default 0.25).\n\n[i]blockvoice (0|1) [/i]- if set, all incoming voice data is blocked. This is useful to override incoming voice commentators or player voice with own commentators voice.\n\n[i]cmdlist [/i]- shows all registered proxy commands\n\n[i]logfile (0|1) [/i]- starts/stops console logging in \u0022logfile\u003Cdate\u003E.log\u0022\n\n[i]status [/i]- shows proxy status information\n\n[i]modules [/i]- shows all loaded HLTV modules and versions\n\n[i]exec (filename) [/i]- executes a .cfg file\n\n[i]echo (string) [/i]- prints a text to HLTV console\n\n[i]developer (0|1) [/i]- additional debug messages are shown in developer mode\n\n[i]record (filename) [/i]- records all following games to demo files using name syntax \u0022filename-\u003Cdate\u003E-\u003Cmap\u003E.dem\u0022\n\n[i]stoprecording [/i]- stops recording a demo file\n\n[i]playdemo (filename) [/i]- starts broadcasting a demo file. \n\nThe console does auto-completion by hitting \u0027TAB\u0027.\n\nAll commands in the config file [b]hltv.cfg[/b] are executed during startup.\n\n\nSome parameters can only be set in the command line:\n\n[i]-port (n) [/i]- sets the HLTV proxy port that spectators connect to (default 27020)\n\n[i]-ip (IP) [/i]- forces the proxy to use this IP on a multihomed host\n\n[i]-comm (filename) [/i]- sets a master server info file other than woncomm.lst\n\n[i]-nodns [/i]- disables any DNS resolving (useful for LAN proxies)\n\n[i]-maxfps (n) [/i]- sets maximum system cycles per seconds (default 100)\n\n[i]-highpriority [/i]- starts the HLTV proxy as high priority process\n\n[i]-steam [/i]- proxy enables special Steam support\n\n[i]-dev [/i]- developer mode\n[/expand]\n\nThese parameters cannot be changed during runtime, thus they can\u0027t be used in config files.\n\nAll console commands can be used in the command line, if a \u0022 [b]\u002B[/b] \u0022 is pre-pended to them,\n\nFor example:\n\n[b]hltv.exe \u002Bconnect localhost:27015 -port 27021[/b]\n\nA Half-Life server can set sv_proxies \u003Cn\u003E, to determine how many proxies are allowed to connect. If HLTV proxies should be forbidden, set it to 0, otherwise 1 to allow for a Master Proxy. Other values are experimental.\n\n[b]Typical output from modules command:[/b]\n\n[expand style=details]\nmodules\n\nModule nulldirector, Interface GenericModule, Version 2681\n\nModule proxy001, Interface proxy001, Version 2681\n\nModule demo, Interface democlient000, Version 2681\n\nModule world001, Interface world001, Version 2741\n\nModule server001, Interface server001, Version 2741\n\nModule master, Interface master000, Version 2681\n\nModule status, Interface status000, Version 2681\n\nModule network001, Interface network001, Version 2741\n\n--- 8 modules in total ---[/expand]\n\n[b]Latest version of Registered console commands:[/b]\n\n[expand style=details]\ncmdlist\n\nhelp\n\nlogfile\n\nmodules\n\nexec\n\ndeveloper\n\nshowcon\n\nquit\n\nexit\n\necho\n\nloadmodule\n\nunloadmodule\n\nping\n\nclients\n\nkick\n\nchatmode\n\nsay\n\nmsg\n\nmaxrate\n\nrcon\n\nrconaddress\n\nrconpassword\n\nadminpassword\n\nproxypassword\n\nspectatorpassword\n\nsignoncommands\n\nofflinetext\n\npublicgame\n\ndispatchmode\n\ncheeringthreshold\n\nlocalmsg\n\nloopcmd\n\nconnect\n\ndisconnect\n\nplaydemo\n\ndelay\n\nstop\n\nrecord\n\nstoprecording\n\nservercmd\n\nclientcmd\n\nblockvoice\n\nname\n\nrate\n\nupdaterate\n\naddresource\n\nresources\n\nbannerfile\n\nban\n\nretry\n\nautoretry\n\nserverpassword\n\nstatus\n\nhostname\n\nmaxqueries\n\nmaxclients\n\nplayers\n\nclearbans\n\nmaxloss\n\nregion\n\nfakeloss\n\nproxies\n\nheartbeat\n\nnomaster\n\nforcemaster\n[/expand]",
  "title": "HLTV"
}