{
  "faq_id": 9041373518389234842,
  "language": 0,
  "version": 8,
  "content": "      \t              \t[img]https://support.steampowered.com/steamvr/FitGuide/GuideHeader.png[/img]  \t  \t            \t[h3]General troubleshooting[/h3][b]Before following instructions below, be sure you\u0027ve tried the following:[/b]\n\n[list]  \t\t[*]Check your headset connections (power outlet, USB, DisplayPort, PC, breakaway connector).[/*]  \t\t[*]Make sure the tether is fully plugged into the HMD. It can look like it’s connected even when it is not.[/*]  \t\t[*]Check your video driver versions (including the high-definition audio component) and update if necessary - see [url=https://help.steampowered.com/en/faqs/view/5799-495F-1F25-D15B]Updating Drivers.[/url][/*]  \t\t[*]Reboot your headset from the SteamVR status window ([i] Menu[/i] \u003E [i]Devices[/i] \u003E [i]Restart headset[/i]) or restart SteamVR.[/*]  \t[/list]  \t[hr][/hr]        \t\n\n[h1]Headset not ready in SteamVR status window[/h1]Check the LEDs located above the two cameras on the front of the headset, then refer to the matching troubleshooting section below.\n\n[h4]LEDs are green (dull)[/h4]The headset is sleeping but ready to go when you are. Put it on or move it around in your Lighthouse-tracked space to wake it up. If it\u0027s still not ready, reboot the headset or restart SteamVR.\n\n[h4]LEDs are red and blinking[/h4]The headset has encountered a startup error. This can happen if the System Button is being pressed while the headset is turned on. The System Button is on the left underside of the visor. You can reboot the headset from Steam VR ([i]Devices[/i] \u003E [i]Restart headset[/i]) or unplug/replug the breakaway connector to get out of this state. If the LEDs remain red and blinking, there may be an issue with the headset\u0027s firmware - please click \u0022Contact Steam Support\u0022 below to get help.\n\n[h4]LEDs are red and steady[/h4]The headset display has failed to initialize. Check all your headset connections and make sure you\u0027ve updated your video drivers. Once you\u0027ve done that, unplug/replug the breakaway connector to power-cycle the headset and restart SteamVR.\n\n[h4]LEDs are blue[/h4]The headset is in standby mode. Please try the following:\n\n[*]Check all your headset connections.[/*]  \t\t[*]Move your USB and DisplayPort connections to different ports, if available.[/*]  \t\t[*]Unplug/replug the breakaway connector to power-cycle the headset and restart SteamVR.[/*]\n\nIf the headset remains in standby mode, try reinstalling USB drivers for SteamVR devices:\n\n[*]Unplug your headset from the USB port.[/*]  \t\t[*]Navigate to the SteamVR status window.[/*]  \t\t[*]Select [i]Menu[/i] \u003E [i]Developer[/i] \u003E[i]Developer Settings[/i] \u003E [i]Remove All SteamVR USB Devices[/i].[/*]  \t\t[*]Wait for the process to complete, then reconnect your headset to the USB port and retest the issue after the driver has been reinstalled.[/*]\n\n[h4]LEDs are off[/h4]The headset is not receiving power. Check all your headset connections and try using a different power outlet if available.\n\n[h4]Still having problems?[/h4]If your headset is still not ready in the SteamVR status window or is stuck in one of the states described above, please click  \t\tthe \u0022Help Me With My Issue\u0022 button on the right side of this page to get help.\n\n[hr][/hr]\n\n      \t[h1]Blurry visuals[/h1][b][b]Before you begin, make sure the protective film from your lenses is removed.[/b][/b]\n\n[h4]Follow our fit guide[/h4]There are several steps to getting the right fit and setup for your Index. Refer to our [url=https://help.steampowered.com/en/faqs/view/699A-ECD2-F839-760C]  \t\tIndex Fit Guide[/url] for instructions on setting up for the best visual experience.  \t\tIf you don\u0027t notice improvement after following those instructions, check all your headset connections, and restart SteamVR. Finally, make sure you regularly clean your headset\u0027s lenses with the provided cleaning cloth. Avoid using liquids or cleaning products when maintaining lenses.\n\n[h4]No display?[/h4]If you\u0027re not seeing anything in your headset\u0027s display, something isn\u0027t connected properly. Check the headset\u0027s power, USB, DisplayPort, and main cable connections.\n\n[hr][/hr]        \t[h1]SteamVR is displaying an error message[/h1]Some error messages contain instructions or links to help articles. SteamVR will also recover from many temporary issues after a restart. If the error appears again and there are no instructions on-screen, be sure to check all of your headset\u0027s connections (power, USB, DisplayPort, and main cable connections). If you continue  \t\tto receive errors, please click the \u0022Help Me With My Issue\u0022 button on the right side of this page to get help.\n\n      \t[h1]Audio issues[/h1][h4]Removing audio arms[/h4]If you are having issues with your headset audio, you may want to try removing the speakers and ensuring the contacts are clean and free of debris.\n\nThe audio arms and off-ear speakers can be removed with a T6 Torx driver. With the weight of the headset supported, hold the audio arm in place while loosening the screw, and pull straight out. Lateral force can damage the pogo pins that carry the audio signal. To reattach the audio arm, first align the pogo pins with the gold contacts, then hold the contacting surface against the head strap while tightening the screw.\n\n[h4]No audio on off-ear speakers[/h4]Verify that your headset is solid green in the SteamVR status window. Next, verify that Index is the active output device in Windows while SteamVR is running (type \u0022sound settings\u0022 in the search bar, then check [i]Choose your output device[/i]) and the default playback device in SteamVR ([i]Settings[/i] \u003E [i]Audio[/i] \u003E [i]Set Playback device to...[/i]). If you\u0027re still having trouble, you can:  \t\t\t[list]  \t\t\t\t[*]Unplug all other playback devices.[/*]  \t\t\t\t[*]Test your system audio from the Windows Sound Panel.[/*]  \t\t\t\t[*]Verify that nothing is plugged into the 3.5mm audio jack behind the face gasket.[/*]  \t\t\t\t[*]Check SteamVR audio levels - with the headset on, press the System Button to bring up the VR Dashboard and check the slider in the bottom right.[/*]  \t\t\t[/list]  \t\t[h4]Low audio volume[/h4]Be sure the off-ear speakers are positioned correctly. You can check [url=https://help.steampowered.com/en/faqs/view/699A-ECD2-F839-760C]our Index Fit Guide[/url] for more information. If your issue continues, play test sounds from the Windows Sound Panel to verify that your system audio is working correctly, then try to retest the issue with another game or application. Finally, check all your headset connections, exit Steam VR, and restart Windows.  \t\t\tIf you continue to experience low audio, please click the \u0022Help Me With My Issue\u0022 button on the right side of this page to get help.\n\n[hr][/hr]    \t[h1]Microphone issues[/h1][h4]No microphone[/h4]Verify that the headset is solid green in the SteamVR status window. Then confirm that Digital Audio Interface (Valve VR Radio \u0026 HMD Mic) is the default recording device for Windows (type \u0022sound\u0022 in the search bar, then check the recording tab).\n\nIf another device is selected, switch to this one instead, then re-launch your game or restart SteamVR. If Windows continues to default to another recording device, check to make sure that SteamVR is defaulting to the correct device ([i]Settings[/i] \u003E [i]Audio[/i] \u003E [i]Set Record device to...[/i]). Finally, you can try using a different USB port for your headset connection if you continue to experience issues.\n\n[h4]Microphone distortion[/h4]If you\u0027re experiencing distortion or disrupted mic audio, try lowering the microphone levels. Type \u0022sound\u0022 in the search bar, then select [i]Recording[/i], right-click the [i]Digital Audio Interface[/i] and select [i]Properties[/i], and lower the slider under the [i]Levels[/i] tab.\n\nYou can also try adjusting the gain inside of the application you\u0027re having trouble with. Finally, you can try using a different USB port for your headset connection  \t\t\tif you continue to experience issues.\n\n      \t[h1]Caring for your headset[/h1][h4]Avoiding sunlight[/h4]Even while indoors, exposure to sunlight can cause permanent damage to the display panels in your headset. An uninterrupted lens exposure of less than 10 seconds can begin to cause noticeable damage under the right circumstances. To protect your headset, observe the following:  \t\t\t\t[list]  \t\t\t\t\t[*]Take care not to expose the headset\u0027s lenses to sunlight during use.[/*]  \t\t\t\t\t[*]Don\u0027t leave your headset unattended in a place where it may be exposed to sunlight.[/*]  \t\t\t\t\t[*]Transport your headset in a manner that protects it from exposure.[/*]  \t\t\t\t\t[*]Be sure to store your headset away from any possible exposure while not in use.[/*]  \t\t\t\t[/list]  \t\t[h4]Cleaning[/h4][b]To clean the headset\u0027s exterior surfaces[/b], use a dry, clean cloth to wipe down as necessary. Isopropyl alcohol may also be used if a dry cloth is insufficient, but take care to apply it only to the cloth, using small quantities and avoiding all non-exterior surfaces.\n\n[b]To clean the headstrap and face gasket padding[/b], use a damp cloth to scrub the padding. The padding material is antimicrobial and won\u0027t normally require  \t\t\t\tantibacterial or other chemical cleaners, but isopropyl alcohol can be applied to the cloth in small quantities if necessary.\n\n[b]To clean the lenses[/b], use the microfiber cloth that was included with your headset. Gently wipe in a circular motion, starting at the lens center and moving outward. Do not use cleaning agents on lenses.\n\n        \t            \n\n",
  "title": "Index Headset FAQ",
  "timestamp": "2021-12-30T19:16:37+00:00"
}