{
  "faq_id": 6320209939544034913,
  "language": 0,
  "version": 8,
  "content": "      \t            \t[img]https://support.steampowered.com/steamvr/FitGuide/GuideHeader.png[/img]  \t  \t        \t[h1]General troubleshooting[/h1]Before reading further, be sure to:\n\n[*]Ensure your device is charged and powered.[/*]  \t\t[*]Ensure your firmware is up to date.[/*]  \t\t[*]Restart SteamVR.[/*]\t  [hr][/hr]\t          \t[h1]Input issues[/h1][h4]Track Button[/h4]Responsiveness and output can be affected if the controller detects input on the Track Button while it is being powered on. If the Track Button does not seem to   \t\tbe registering input or feels sluggish, try these steps:\n\n[*]Hold down the System button for 5 seconds to turn the controller off.[/*]  \t\t[*]Wait 2 seconds.[/*]  \t\t[*]Power the controller back on by pressing the System Button. Make sure you do not touch the Track Button.[/*]\nTry this a couple of times. If the problem persists, go to  [url=https://help.steampowered.com/wizard/HelpWithValveIndex]Help With Valve Index[/url] to contact Steam Support regarding the issue.\n\n[h4]Issue with legacy bindings or app-specific input[/h4]Titles without native Index Controller support should automatically map existing control schemes and work without additional customization. If you would like to   \t\tremap these controls or load a custom controller binding from the Steam Workshop, you can do so by going to the SteamVR status window, opening the menu, and selecting   \t\t[i]Devices[/i] \u003E [i]Configure Controller[/i].\n\nFor advanced information about how to use the legacy input system to create custom controller bindings, you can check out   \t\t[url=https://steamcommunity.com/sharedfiles/filedetails/?id=1545634111]our rebinding guide[/url].\n\n[hr][/hr]\n\n      \t[h1]Controller is not solid green in SteamVR status window[/h1]If your controller is not ready, first check the LED above the Track Button and follow the steps below:\n\n[h4]LED is blue[/h4]Controller is powered, but not paired to your headset. Pair your controller again:  \n[list]  \t\t[*]Navigate to the SteamVR status window.[/*]  \t\t[*]Open the menu and select [i]Devices[/i] \u003E [i]Pair Controller[/i].[/*]  \t\t[*]Hold down both the System and B buttons for a few seconds.[/*]\nIf this does not pair the controller, try turning the device on and off to power-cycle it.[/list]\n\n[h4]LED is red (flashing)[/h4]The controller is in an error state. If you just updated your controller firmware, go to  [url=https://help.steampowered.com/wizard/HelpWithValveIndex]Help With Valve Index[/url] to contact Steam Support regarding the issue.\n\nIf you did not just update your controller firmware, you should be able to recover your controller by following the [i]Reset your controller[/i] instructions below.\n\n[h4]LED is off[/h4]Controller is not powered. If your controller will not power on, plug it in for a while to ensure that it has a charge and then try again. If the LED remains off, check the device\u0027s status in VR Monitor. It should be gray. If it is in another state, you can try resetting your controller using the instructions immediately below.\n\n[h4]Still having problems? Reset your controller.[/h4]If none of this information solved the problem, you can try performing a \u0022hard reset\u0022 on your controller. To do this:\n\n[*]Plug the controller in via USB and leave it to charge for 10 minutes.[/*]  \t\t[*]Unplug it and hold down the System Button for 15 seconds, then release.[/*]  \t\t[*]Power the controller on again.[/*]\nThe controller should recover. If you continue having problems, go to  [url=https://help.steampowered.com/wizard/HelpWithValveIndex]Help With Valve Index[/url] to contact Steam Support regarding the issue.\n\n[hr][/hr]\t            [h1]Controller is not tracking[/h1]If you\u0027re having a tracking issue, please refer to our [url=https://help.steampowered.com/en/faqs/view/1AF1-670B-FF5C-3323]Base Station \u0026 Lighthouse Tracking[/url] article.\n\n[hr][/hr]\t  \t  \t\n[h1]Other Issues[/h1]\n[section id=wired-controller-usage]\n[h4]Wired Controller Usage[/h4]\nPlease unplug controllers during gameplay. Pulling the charge cable at an angle may cause damage.\n\n[img]{STEAM_CLAN_IMAGE}/1976/4dee04d8473768abe44989c4901ac18aba13d406.png[/img]\n\nIf you suspect damage to your controller\u0027s USB-C connector, please [url=https://help.steampowered.com/en/wizard/HelpWithGameIssue/?appid=250820\u0026issueid=370\u0026nodeid=44\u0026return_nodeid=48]contact Steam Support[/url]\n\nDevelopers and users who prefer wired controller workflows should consider using a \u0022USB-C breakaway cable\u0022.[/section]\n[h4]3rd-party charging cables[/h4]We\u0027re aware that some USB-C charging cables are not compatible with the molding around the controller\u0027s ports. We recommend using the included cables or avoiding cables with bulky plug housings.\n\n[h4]Fast Charging[/h4]To take advantage of fast charging, you can use any USB charging port capable of at least 1 Amp with the included Type-A to Type-C charge cable.\n\nExamples of fast charge ports:\n[*]Cell phone charger\t\t\t\n[*]USB Charge station\n\nExamples of standard charge ports:\n[*]PC USB host ports\t\t\n[*]USB hub ports[/*]\nThe device does not take advantage of USB PD ports (power delivery).\n\n        \t\t            \n\n",
  "title": "Index Controller Troubleshooting",
  "timestamp": "2021-12-02T21:13:55+00:00"
}