{
  "faq_id": 8593836637999631280,
  "language": 0,
  "version": 4,
  "content": "How can I utilize the Add-on system in Left 4 Dead?\n\n[h4]What are Left 4 Dead Add-ons?[/h4]Left 4 Dead uses an add-on system to allow user-created maps and other content to run in-game. Content authors can package their creations as a Valve Package File( .VPK file) and upload it to the web.  Steam users can then download the .VPK and install it to play online.\n\n[h4]Where do I get Add-ons?[/h4]When connecting to a lobby running user-created content, you will see a [b]DOWNLOAD ADD-ON[/b] link.  This link will launch your web browser and allow you to install the new add-on.\n\nAdditionally, add-ons are available for download on various websites.\n\n[h4]How do I install Add-ons?[/h4]Once the .VPK file is downloaded, simply double click it to begin automatically installing the files. It will copy itself to the appropriate Steam folder.\n\nIf there is any issue with this process, you can manually install the add-on by moving or copying the .VPK to the Left 4 Dead Add-ons folder.\n\nThis folder is typically located here:\n[i]C:\\Program Files (x86)\\Steam\\steamapps\\common\\left 4 dead\\left4dead\\addons[/i]\n\n[h4]I have two folders: \u0022addons\u0022 and \u0022add-ons\u0022. Which one should I use?[/h4]The correct one is \u0022addons\u0022, without a hyphen. If you want, you may delete the hyphenated folder: \u0022add-ons\u0022.\n\n[h4]How can I make my own Left 4 Dead Add-on?[/h4]The [url=http://developer.valvesoftware.com/wiki/L4D_Campaign_Add-on_Tutorial]Valve Developer Community[/url] is the best place to start along with the game\u0027s  [url=https://steamcommunity.com/app/550/discussions/3/]Modding/Mapping Help and Tips[/url] discussion forum.\n\n[h4]I\u0027m receiving an error when double clicking VPK files. [/h4]The file association between .VPK files and addoninstaller.exe might not be functioning correctly.\n\nBrowse to the following location within your Steam install folder:\n[i]\\steam\\steamapps\\common\\left 4 dead\\bin\\[/i]\n\nCreate a shortcut for addoninstaller.exe by right clicking on the file and choose [b]Create shortcut[/b].\n\nThen, right click on the shortcut and choose [b]Properties[/b].\n\nChange the target to include \u0022/register\u0022 as in the following example:\n[i]\u0022C:\\Program Files (x86)\\Steam\\steamapps\\common\\left 4 dead\\bin\\addoninstaller.exe\u0022 /register[/i]\n\nAfter clicking OK, double click on the shortcut to run it.\n\nRestart your computer re-test the issue.\n\n",
  "title": "Left 4 Dead Add-ons",
  "timestamp": "2021-08-10T17:32:19+00:00"
}