{
  "faq_id": 4540816117086373196,
  "language": 0,
  "version": 7,
  "content": "[img]https://support.steampowered.com/images/faq/steam_link/SteamLink_Support_Header01.png[/img]\n\n[h1]Updating the Steam Link[/h1]Need to update your Steam Link or load a specific build on it? Click on the scenario that best describes your setup for detailed instructions.\n\n[expand type=title title=\u0022Loading Specific Steam Link Builds\u0022]\nYou may need to load specific Steam Link builds to better troubleshoot issues. To do this, follow the steps below:\n[olist]\n[*]From the Steam Link’s base page, check your system settings to ensure that you are using [i][b]build 449 or newer.[/b][/i] If your Steam Link is not using this build, you may need to switch to click the [i][b]Switch to Public Build[/b][/i] button from the Steam Link System Setting Page.  \n[*]If you are still unable to update to the required build version, please try updating after performing a factory reset.\n[*]Determine [url=https://help.steampowered.com/en/faqs/view/600B-953F-F577-762D]which build[/url] you would like to load. Create a text file called [i][b]update_branch.txt[/b][/i] containing the number of the build you wish to use. Place this file on a USB drive using the file path [i][b]/steamlink/config/system/update_branch.txt[/b][/i]\n[*]Insert the USB drive into the Steam Link\n[*]Unplug your Steam Link, wait 3 seconds, then plug it back in\n[*]The correct build will automatically be downloaded and installed\n[*]After the update, navigate to the System Settings page to ensure that both the Release and Build version have been updated.\n[/olist]\n[h2]Additional Notes[/h2]If you do not see the correct build number after performing this process please do the following:\n[olist]\n[*]Check to make sure the file on your USB drive does not have a hidden extension (update_branch.txt.txt)\n[*]Try another USB drive\n[/olist][/expand][expand type=title title=\u0022Manually Updating the Steam Link\u0022]\nIf your Steam Link is not connected to the internet, you can update it manually using the steps for setup and installation below:\n[olist]\n[*][url=https://media.steampowered.com/steamlink/06_2015/SystemUpdate.zip]Download[/url] the installation file for the current Steam Link Build. [b]- SystemUpdate.zip[/b]\n[*]Using a USB drive, create a folder called [b]steamlink[/b] in the root directory, or top-level. When you open the drive, you should see the steamlink folder\n[*]Move the [b]SystemUpdate.zip[/b] file you just downloaded into the steamlink folder. Your file path should look like [b]/steamlink/SystemUpdate.zip[/b]\n[*]In the steamlink folder, create a new folder called [b]config[/b]\n[*]Open the config folder and create a new folder called [b]system[/b]\n[*]Inside the system folder, create an empty text file (.txt) called [b]update_branch.[/b] Your file path should be [b]/steamlink/config/system/update_branch.txt[/b]\n[*]Follow the [b]Installation[/b] steps below to update the Steam Link to the latest build\n[/olist][/expand][expand type=title title=\u0022Loading Builds while Link is not Connected to the Internet\u0022]\nIf you would like to load a specific Steam Link build while the Link is not connected to the internet, please follow the steps below:\n[olist] \n[*]Determine [url=https://help.steampowered.com/en/faqs/view/600B-953F-F577-762D]which build[/url] you would like to load. Create a text file called [b]update_branch.txt[/b], open the file, and type in the number of the build you wish to use.\n[*]Place this file on a USB drive using the file path [b]/steamlink/config/system/update_branch.txt[/b]\n[*]Copy this URL into a web browser and replace the [b]‘XXX’[/b] with the desired build number  \t\t\t\t\t\n[*]https://media.steampowered.com/steamlink/06_2015/SystemUpdate_full_XXX.zip\n[*]Press [b]Enter[/b] and download the .zip file to the [b]/steamlink/[/b] folder you just created on the USB drive\n[*]Edit the file name to [b]SystemUpdate.zip[/b]\n[/olist]\nThe file paths should look like this:\n[list]  \t\t\t\t\n[*][b]/steamlink/SystemUpdate.zip[/b]\n[*][b]/steamlink/config/system/update_branch.txt[/b]\n[/list] \n[h2]Installation[/h2]\n[olist]\n[*]Power on the Steam Link, connect to your local network, and verify that you can navigate to the Settings \u003E System menu \n[*]Use a wired Ethernet connection if possible\n[*]Remove all input devices except a mouse and keyboard\n[*]Remove the power cord and wait 3 seconds\n[*]Insert the prepared USB drive into the port closest to the power cord\n[*]Power on the Steam Link by plugging the cord back in\n[*]The update should start after a longer than usual delay on the splash screen\n[/olist]After the update finishes, test the build by navigating to [b]System \u003E Settings.[/b]\n\n[h2]Additional Notes[/h2]If the update does not start automatically:\n[olist]  \t\t\t\t\n[*]Verify that the Steam Link was connected to your local area network before attempting to update.\n[*]Check to make sure the file on your USB drive does not have a hidden extension (update_branch.txt.txt)\n[*]Perform a quick format on the USB drive (using default values) and repeat the steps in the Setup section\n[/olist][/expand]",
  "title": "Manually Updating the Steam Link",
  "timestamp": "2022-07-14T00:25:27+00:00"
}