{
  "faq_id": 6958024543388679482,
  "language": 0,
  "version": 6,
  "content": "[h3]I experience nausea or motion sickness when I play Source games.  What options are there?[/h3]\n\n[hr][/hr]\n[section style=important]  [h3]Motion Sickness Statement[/h3]The Source engine simulates a variety of simulated environments and intense experiences during normal gameplay.\n\nWhile playing or watching a Source game, the user may begin to experience nausea, dizziness, motion sickness or eyestrain.\n\nIf you or any of your family experience these symptoms, please discontinue use and test the issue at a later time.  You may find that playing in smaller increments is beneficial.[/section]\n[h3]Enable VSync[/h3]Enable VSync and raise the monitor\u0027s refresh rate in the graphics card / monitor settings to see if this affects your gameplay. 60Hz  is a common refresh rate but higher rates may correct the issue with some users.\n\n\n[h3]Lighting near your computer[/h3]Incandescent lighting is usually better than florescent lighting while playing. Point all lights at the roof or wall not directly behind or in front of the computer or monitor.\n\nA moderately lit room is preferred to a dark room.  Your eyes may have trouble adjusting to the dark room and then to the bright screen.  Continuous adjustments between the two extremes may have adverse affects.  A moderately lit room can help diffuse the issue for some users.\n\n\n[h3]Frames Per Second (FPS)[/h3]Check the FPS your game is currently running.  Open the game console with the ~ key. Type \u0022net_graph 1\u0022 and a graph should appear in the lower right corner with FPS listing. The graph can later be removed by typing \u0022net_graph 0\u0022\n\nIf you are getting below 30FPS on a regular basis, please try lower screen resolution or some of the graphical settings in the advanced video options in the Options menu.\n\nLowering your mouse sensitivity to slow your turn rates may also help your symptoms.\n\n",
  "title": "Nausea or Motion Sickness During Gameplay",
  "timestamp": "2021-10-28T02:12:21+00:00"
}