{
  "faq_id": 7215969993590687435,
  "language": 0,
  "version": 8,
  "content": "[img]https://support.steampowered.com/images/faq/steam_universe/Hardware_SteamLogo_Banner.png[/img]     [h1]Steam Link App for Raspberry Pi[/h1]The Steam Link app extends Steam Link functionality to the Raspberry Pi 3B and 3B\u002B, running Raspbian Stretch. The App uses the same streaming technology as Valve\u0027s Steam Link, allowing you to play your favorite games and even spectate VR games right from your Raspberry Pi.\n\n[h4]Required/Recommended Equipment[/h4][list]  \t\t\t[*]A computer running Steam, Windows 7 or newer, Mac OS X 10.10 (Yosemite) or newer, SteamOS, or Linux Ubuntu 12.04 or newer.[/*]  \t\t\t[*]A wired network (5 GHz wireless may work, but is not recommended on the Raspberry Pi)[/*]  \t\t\t[*]A Raspberry Pi 3B or 3B\u002B running Raspbian Stretch[/*]  \t\t[/list]  \t  \t[h4]Supported Input/Controllers[/h4][list]  \t\t\t[*][url=https://store.steampowered.com/app/353370/Steam_Controller/]The Steam Controller[/url] (wired or using the included wireless dongle)[/*]  \t\t\t[*]The official Microsoft Xbox One Wired Controller[/*]  \t\t\t[*]The official Microsoft Xbox One S Controller (wired)[/*]  \t\t\t[*]The official Microsoft Xbox 360 Wired Controller[/*]  \t\t\t[*]The official Microsoft Xbox 360 Wireless Controller for Windows (with wireless receiver)[/*]  \t\t\t[*]Sony DualShock 4 (wired or wirelessly using Bluetooth)[/*]  \t\t\t[*]The official Nintendo Switch Pro Controller (wired)[/*]  \t\t\t[*]Razer Raiju, Sabertooth, Serval, and Wildcat controllers[/*]  \t\t\t[*]SteelSeries Stratus Duo[/*]  \t\t\t[*]Keyboard and mouse[/*]  \t\t[/list]\n[i]Please note: other input devices may work even if they aren’t officially supported.[/i]\n\n[h4]Getting Started[/h4][olist]  \t\t\t[*]Turn on your home PC, launch Steam, and log in.[/*]  \t\t\t[*]Ensure your Pi is connected to the same network as your host PC.[/*]  \t\t\t[*]Run the following in a terminal window to install:\n[code]\n\nsudo apt update\nsudo apt install steamlink\n\n[/code]\n[/*]  \t\t\t[*]You can launch Steam Link from the Games menu, or run [code]steamlink[/code] from a terminal window.[/*]  \t\t[/olist]\n\nIf you have questions about the app or need help using it, just click the appropriate tab.\n\n[expand type=title title=\u0022Frequently Asked Questions\u0022]    \t[h4]The game is choppy and unresponsive. How can I improve the experience?[/h4]Using a wired network is strongly recommended with the Raspberry Pi.\n\nYou can also try switching to the ‘Fast’ streaming quality option from the Streaming settings in the Steam Link. You can find out more information about improving wireless experience [url=https://help.steampowered.com/en/faqs/view/3E3D-BE6B-787D-A5D2]here[/url].\n\n[h4]Can I use the Steam Controller in Bluetooth mode?[/h4]Bluetooth mode is not supported on the Raspberry Pi. The wireless dongle that came with your Steam Controller is lower latency and works well. Your Steam Controller can be paired with the dongle in the controller settings in the Steam Link app.\n\n[h4]Can I use an input device not listed on this page?[/h4]Steam Support is unable to provide assistance with unsupported devices, however, we do have an active community that may have found solutions to the issue you’ve encountered.\n\nPlease visit the [url=https://steamcommunity.com/app/353380/discussions/6/]Steam Link section of the Steam Discussion forums.[/url]\n\n[h4]Can I use surround sound?[/h4]Surround sound works using HDMI multi-channel PCM. If your sound system only supports encoded surround sound (AC3, Dolby DTS, etc.) you should use Stereo audio streaming settings.\n\n[/expand][expand type=title title=\u0022Troubleshooting\u0022]\t    \t[h4]Experiencing Performance Issues?[/h4]If you are experiencing performance issues please ensure that your [url=https://help.steampowered.com/en/faqs/view/3E3D-BE6B-787D-A5D2]settings are optimized for Streaming.[/url]\n\n[h4]Xbox triggers reversed?[/h4]If the Xbox controller triggers are reversed, you are probably using the unsupported xboxdrv gamepad driver. You can go to the Steam Link app controller settings and remap your controller to work with this driver.\n\n[h4]Contacting Steam Support[/h4]If you have other issues or questions, contact [url=https://help.steampowered.com/en/wizard/HelpWithGameIssue/?appid=353380\u0026issueid=354\u0026nodeid=1\u0026return_nodeid=9]Steam Support[/url] and attach the [b]remote_connections.txt[/b] and [b]streaming_log.txt[/b] files to your ticket.\n\nThe default location for these files is: [i][b]C:\\Program Files (x86)\\Steam\\logs[/b][/i]\n\n[/expand]\n\n",
  "title": "Raspberry Pi Steam Link App",
  "timestamp": "2021-08-12T18:02:10+00:00"
}