{
  "faq_id": 1040623370678964577,
  "language": 0,
  "version": 5,
  "content": "Many products are sold by retailers other than Steam. If these products are meant for Steam registration, they will include a Steam CD key/product code.\n\n[section style=important]This FAQ is meant for issues with registering retail and digital keys to your Steam account. If you are having issues with a key that was provided by Steam, please see the [url=https://help.steampowered.com/en/faqs/view/2FF7-8298-9409-BC1D]Steam-Issued keys[/url] FAQ for further information.[/section]\n[list]  \t[*][url=#what]What is a CD key and where can I find it?[/url][/*]  \t[*][url=#which]Which retail / digital CD Keys are accepted on Steam?[/url][/*]  \t[*][url=#how]How do I add a key to my Steam account?[/url][/*]  \t[*][url=#proof]What is a CD Key used for after it is registered?[/url][/*]  \t[*][url=#invalid]Why am I receiving the \u0022Invalid Product Code\u0022 error when attempting registration?[/url][/*]  \t[*][url=#duplicate]Why am I receiving a duplicate product code error when attempting to register the key?[/url][/*]  \t[*][url=#nonsteam]How do I add a non-Steam game to my Library?[/url][/*]  [/list]\n\n[section id=what]  [h4]What is a CD key and where can I find it?[/h4]A CD Key is a printed combination of letters and numbers, found on a card, sticker, or disc included with your game\u0027s packaging. For online purchases where no physical media is shipped, the CD Key is usually included in the emailed purchase receipt.[/section]    [section id=which]  [h4]Which retail/digital CD Keys are accepted on Steam?[/h4]If a retail or digital game is meant to be registered through Steam, the retail packaging or the email where the key was delivered will specify so. If a key is not intended for registration through Steam, you will see an Invalid Product Code error when you try to register it. If a retail or digital game key has already been registered, you will see a duplicate key error. Please see the sections on [url=#invalid]invalid[/url] and [url=#duplicate]duplicate[/url] keys below for further information.[/section]    [section id=how]  [h4]How do I add a key to my Steam account?[/h4]Log in to the Steam client application (if you haven’t yet, you can download the Steam client [url=http://store.steampowered.com/about]here[/url]). Click the button labeled \u0022\u002B Add a Game\u0022 on the bottom left on the Steam client and select \u0022Activate a Product on Steam...\u0022 and follow the on-screen instructions.[/section]    [section id=proof]  [h4]What is a CD Key used for after it is registered?[/h4]After the key is registered to your Steam account, it acts as proof of purchase for the game as well as proof of ownership for your Steam account. Steam Support may ask for it if you need to establish your ownership of an account. Please note that digital keys that are not part of a game\u0027s physical packaging cannot be used as proof of account ownership. It is recommended that you keep your key in a safe place to ensure the security of your account.[/section]    [section id=invalid]  [h4]Why am I receiving the \u0022Invalid Product Code\u0022 error when attempting registration?[/h4]If your key is not recognized by Steam, make sure that the key is intended for Steam registration. If a retail or digital game is meant to be registered through Steam, the retail packaging or the email where the key was delivered will mention it.\n\nOnce you have made sure that the product is intended for Steam registration, check the combinations below to ensure that numbers and letters are entered correctly:\n[list]  \t[*]The number [b]0[/b] (try entering the letter [b]Q[/b], [b]D[/b] or [b]O[/b] instead)[/*]  \t[*]The number [b]1[/b] (try entering the letter [b]I[/b] or [b]L[/b] instead)[/*]  \t[*]The letter [b]O[/b] (try entering the letter [b]Q[/b] or [b]D[/b] instead)[/*]  \t[*]The letter [b]B[/b] (try entering the number [b]8[/b] instead)[/*]  \t[*]The letter [b]G[/b] (try entering the number [b]6[/b] instead)[/*]  [/list]\nIf you are still receiving an invalid error, we encourage you to contact the retailer for further assistance.[/section]   \n[section id=duplicate]  [h4]Why am I receiving a duplicate product code error when attempting to register the key?[/h4]This error indicates that the key you are registering has already been tied to a Steam account. It cannot be registered again.\n\nIf you think that you have previously registered this key to a Steam account, please use [url=https://help.steampowered.com/wizard/HelpWithLogin]Steam Help Site[/url] to retrieve your lost Steam account.\n\nIf you are sure that you have never registered this key successfully, you will want to contact the retailer where the game was purchased to obtain a new copy of the game.[/section]    \n[section id=nonsteam]  [h4]How do I add a non-Steam game to my Library?[/h4]If your key is not meant to be registered on Steam, the game may still be added to your Library for convenience - please see the [url=https://help.steampowered.com/en/faqs/view/4B8B-9697-2338-40EC]Add Non-Steam Games to a Library[/url] topic for more information on this process.[/section]",
  "title": "Retail CD Keys"
}