{
  "faq_id": 8135358118725657467,
  "language": 0,
  "version": 10,
  "content": "[section style=warning]Valve employees will [i]never[/i] communicate with you about your account using any chat system including Steam Chat and Discord. The only way you can speak with a Steam Support agent about your account is through the [url=help.steampowered.com]Steam Support Help Site[/url]. There\u0027s no situation in which you\u0027d need to reach out to a Valve or Steam employee directly to resolve an issue.\n\nIf someone claims they reported you accidentally or falsely, you do not need to do anything to protect your account. These claims are always fake and only meant scam you. If someone did report your account falsely, you can rest assured that Steam disregards false reports.  \n\nAnyone claiming to be a Valve employee, Steam Support representative, or asking to verify your items for an investigation should be immediately [url=#reportscammer] reported[/url].[/section]     \n\n[h1]Confidence Scams[/h1]\nSome confidence scammers (scammers, cons, con artists) target Steam users by threatening their accounts or claiming to represent Steam Support, Valve, or a trusted individual or service.\n[list][*][url=#scamsteam]What is a confidence scam?[/url][/*][*][url=#scamtypes]What scam types might target Steam users?[/url][/*][*][url=#avoidscams]How do I protect myself from scams?[/url][/*][*][url=#fallenscam]What do I do if I\u0027ve fallen for a scam?[/url][/*][*][url=#falsereport]My account has been accidently or falsely reported. What do I need to do?[/url][/*][*][url=#friendscam]What should I do if I receive a suspicious message from a friend?[/url][/*][*][url=#reportcon]How do I report a scammer?[/url][/*][/list]\n\n\n[h1]Trade Scams[/h1]\nTrade scams are a scam whose goal involves obtaining a victim\u0027s Steam Inventory items. \n[list][*][url=#whatisascam]What is a trade scam?[/url][/*][*][url=#bestways]What are the best ways to avoid getting scammed?[/url][/*][*][url=#whattrades]What kind of trades should I avoid?[/url][/*][*][url=#whatscams]What specific scams should I be aware of?[/url][/*][*][url=#scamvshijack]What is the difference between a scam and a hijack?[/url][/*][*][url=#reportscammer]How do I report a scammer?[/url][/*][*][url=#whathappens]What action is taken when a scammer is found?[/url][/*][*][url=#noreturn]Why doesn\u0027t Steam return scammed items?[/url][/*][*][url=#whynoinfo]Why won’t Steam Support provide information on why an account was trade banned or locked?[/url][/*] [/list]\n\n\n[h1]Confidence Scams[/h1]\n\n[section id=scamsteam][h3]What is a confidence scam?[/h3]A confidence scam is a trick involving deceit with the goal of defrauding a victim in some way. A scammer may target a Steam user to hijack their account to use or sell, hijack their account to hold for ransom, or gather information from a victim to defraud them elsewhere.\n\nOnline confidence scams target Steam users because Steam accounts are valuable, and if taken over, can give the scammer a form of \u0022power\u0022 to pressure the victim.[/section]\n[section id=scamtypes][h3]What scam types might target Steam users?[/h3]Most scams targeting Steam users (unrelated to Trade Scams) involve an attempt to gain control of a victim\u0027s account and then hold the account hostage for payment. \n\nYou should never pay a scammer even if they\u0027ve gained full control of your account. You can recover your account from a scammer any time using Steam Support, and a scammer who is already defrauding you is not likely to actually return the account even if you pay. Instead, they would likely just demand additional payments.[/section]\n[section id=avoidscams][h3]How do I protect myself from scams?[/h3]You can avoid scams by always remaining skeptical in online interactions, especially those involving pressure, threats, demands, or claims that come from a position of authority.\n\nYou should be mindful of unexpected claims made even by a trusted friend, as you can\u0027t be sure they haven\u0027t fallen for a scam themselves and thus turned control of their account over to a scammer.[/section]\n[section id=fallenscam][h3]What do I do if I\u0027ve fallen for a scam?[/h3]If you\u0027ve given away control of your account to a scammer, you should immediately take steps to [url=https://help.steampowered.com/en/wizard/HelpWithAccountStolen]recover the account through Steam Support[/url]. Despite what a scammer might claim, you can [b]always[/b] recover your account through Steam Support even if the scammer has changed all of the account\u0027s information including its password, email, and phone number.[/section]\n[section id=falsereport][h3]My account has been accidently or falsely reported. What do I need to do?[/h3]You don\u0027t need to do anything to protect your account from false or mistaken reports. They\u0027re simply disregarded by the Steam team.[/section]\n[section id=friendscam][h3]What should I do if I receive a suspicious message from a friend?[/h3]You can use Steam\u0027s reporting tools on your friend\u0027s Steam Community profile page to report your friend\u0027s account as hijacked. If the hijacking can be confirmed, Steam\u0027s moderation team will lock the account until the owner is able to recover it.[/section]\n[section id=reportcon][h3]How do I report a scammer?[/h3]Most confidence scams take place largely outside of Steam. To report the scammer, you should use the reporting feature of the platform that the scammer is using to chat with you, and your should also block all further communication.[/section]\n\n\n\n[h1]Trade Scams[/h1]\n\n[section id=whatisascam][h3]What is a trade scam?[/h3]A trade scam is when a Steam user convinces another user to make a deal (trade, gift or market transaction) under false pretenses. Scams usually involve deception in order to convince a user that they are getting a good or fair deal when in fact they are not.\n\nFor more information on scams please read below and view our [url=https://help.steampowered.com/en/faqs/view/18A5-167F-C27B-64A0]Recommended Trading Practices[/url] article and the [url=https://help.steampowered.com/en/faqs/view/3B6E-B322-2400-8D24]Steam Item Restoration Policy[/url].[/section]    \n[section id=bestways]  [h3]What are the best ways to avoid getting scammed?[/h3][list]  \t[*]You don\u0027t need to rush to complete a trade. If you receive an offer, take your time to thoroughly review the contents. Once you confirm a trade offer, there is no way to reverse it.[/*]  \t[*]Ignore pressure to trust the other user. If you are trading with a user who insists that you trust them, they are probably attempting to scam you. Please note that \u002Brep comments can be generated easily by malicious groups.[/*]  \t[*]Mouse over every item to ensure that the item/gift properties are correct. Information about the item/gift will be shown in the tooltip, including the quality, name, description and any effects.[/*]  \t[*]Do not trade items in separate or future trades. If another user requests that you do multiple trades, they could be scamming you. Always insist to complete the entire trade in one single offer.[/*]  \t[*]Ensure that you are trading with the correct user. Scammers may try to impersonate your friends and other trusted traders. It is your responsibility to know who you are trading with.[/*]  [/list]  [/section]    [section id=whattrades]  \n[h3]What kind of trades should I avoid?[/h3]Do [i]not[/i] trade for anything that cannot be added into the Steam trading window. The most common examples of these types of trades include:\n[list][*]Trading items/gifts for money outside of the Steam Community market. You cannot add Wallet credit, PayPal, gift cards or any form of money to trade offers.[/*]  \t[*]Trading items/gifts for CD Keys. You cannot add a CD Key into the trade window. CD Keys that are offered can be for a different game, fake, used or region restricted.[/*]  \t[*]Trading items/gifts for nothing in return and expecting to get an item or gift in a later trade. There is no reason to not trade everything in one trade. You may add unlimited items/gifts to a single trade.[/*]  [/list]\nFor more information, please see our [url=https://help.steampowered.com/en/faqs/view/46A2-2B3C-95CC-8878]Steam Trading FAQ[/url] and [url=https://help.steampowered.com/en/faqs/view/18A5-167F-C27B-64A0]Recommended Trading Practices[/url] articles.[/section]    \n[section id=whatscams][h3]What specific scams should I be aware of?[/h3][section style=important]Users should always double check the contents of a proposed trade before accepting, even if that means inspecting each item in a multiple-item trade. Be sure to verify the item and its quality before confirming any trade.[/section]\n\nThere are a number of common scams users may attempt to deceive you out of your items:\n[list][*][b]Item switching -[/b] You discuss a trade offer with another user beforehand, and the item they put into the trade offer looks like the item, but isn\u0027t as valuable as the original offer.[/*]  [*][b]CS:GO quality switch -[/b] A user offers you a specific quality CS:GO item (Factory New), but the item in the offer is of a lower quality (Field-Tested). Often the item switch is made in a counter-offer.[/*]  [*][b]Hidden item -[/b] A user offers a trade that includes a lot of your low value items (cards, crates, etc.), but also includes a high value item hidden somewhere in the middle.[/*]  [*][b]Begging/spamming -[/b] A user spams trade offers requesting high value items for nothing or little in return in hopes that you mis-click and accept the offer.[/*]  [*][b]Forward confirmation email -[/b] A user convinces you to forward your confirmation email to their email address. They then confirm the trade using the link in the message. Do not forward trade confirmation emails or links and do not provide additional information to another user asking for information used for your account.[/*]  [*][b]Money For Items -[/b] A user offers to send you money in the form of PayPal, PaySafeCard, Steam Wallet codes, Steam Digital Gift Cards, etc. The scammer usually sends you a fake payment code after the trade is completed. In the case of Steam Digital Gift Cards, the scammer may even appear to pay you first, but be planning to charge the Digital Gift Card back later or buy the gift card with a fraudulent credit card.[/*]  [*][b]CD keys for items -[/b] A user offers to send you a Wallet Credit code or a game\u0027s CD Key in exchange for your items. The scammer usually sends you a fake CD Key after the trade is completed.[/*]  [*][b]Users offering item duplication -[/b] A user offers to duplicate your items, but first you have to trade away your items. After receiving your items, the user blocks your messages and keeps your items.[/*]  [*][b]Users acting as trade bots -[/b] A user impersonating a trade bot(s) tells you that you have to trade them some items. After you\u0027ve accepted the trade and sent the user the items, they block you on Steam and keep your items.[/*]  [*][b]Middleman trades -[/b] If you are performing a trade that sits within [url=https://help.steampowered.com/en/faqs/view/18A5-167F-C27B-64A0]Steam\u0027s trading guidelines[/url], there is no need for a middleman. Any time you choose to trust any other user with one of your items, you are allowing them the opportunity to scam you.[/*]  [*][b]Verification accounts -[/b] A user wants you to trade an item for \u0022verification\u0022. The user will give a made-up excuse to convince you to do this, such as needing to make sure the item is not a duplicate or to ensure the item is not bugged. These users will then keep your item(s) and block you, getting away with the items.[/*]  [*][b]Fund transfer via the Steam Market -[/b] A user offers to send you Steam Wallet funds by buying one of your low value items at a high price in the market. Most of these offers are done using fraudulent funds.[/*]  [*][b]Voice comm software/join our tournament team (malware) -[/b] A user convinces you to install malware hidden in a voice communication, anti-cheat, or other type of software by claiming that they need you to install it so that you can play in a tournament.[/*]  [*][b]Offering fraudulent items for resale -[/b] Malicious users will sometimes acquire unusual items (often with fraudulent credit cards) and then attempt to trade them to you for more well known items with established value. Prior to doing this they may also manipulate the Steam Community Market price of these unusual items by using stolen credit cards. Watch out for claims that they will [i]overpay[/i] or that you can [i]quicksell (qs)[/i] the items for an immediate profit. Consider why the user would be willing to take a loss by trading the items to you instead of selling them themselves. As an excuse, these users will sometimes say they need [i]tradeable keys[/i] or other tradeable items. Do not accept these trades as the value of the unusual items has been falsified and the subsequent Market transactions may be reversed due to fraudulent activity.[/*][/list][/section]\n[section id=scamvshijack]  [h3]What is the difference between a scam and a hijack?[/h3]A scam is when a user deceives another user into willingly (at the time) completing a trade, market transaction, or sending a gift. After the trade is completed, the person who was scammed either doesn\u0027t receive what was promised, or the items involved are not what was agreed upon.\n\nA hijacking is when an account or a computer is taken over by someone else without the account owner\u0027s permission. This is often done with malware or a virus. In some cases the hijacker will convince a user to hand over their login information by providing a fake Steam or a third-party trading site. Hijackers most commonly steal accounts to gain items or games, and sometimes commit fraud. Hijackers often use stolen accounts to commit more hijackings. In these cases, we lock the account until the rightful owner contacts us about the hijacking.\n\nAdditional information about hijacked accounts can be found in our [url=https://help.steampowered.com/en/faqs/view/0A94-F308-34A5-1988]Reclaiming a Stolen Steam Account[/url] article.[/section]    [section id=reportscammer]  \n[h3]How do I report a scammer?[/h3]If you\u0027ve been scammed or another user has attempted to scam you, please use the Report feature built into Steam. This is the best way to bring scammers to our attention so we may take action:\n[list][*]Go to the profile of the offending user[/*]  \t[*]Click the \u0027...\u0027 drop-down located at the top right of the page[/*]  \t[*]Choose \u0027Report Player\u0027[/*]  \t[*]Select the violation, and follow the prompts to submit the report[/*]  [/list]\nIf a user you\u0027ve reported for scamming has had action taken on their account, you\u0027ll be notified with a message in Steam. See the [url=https://help.steampowered.com/en/faqs/view/4D07-D139-587C-2080]How to Report a Scammer[/url] article for more detailed information.[/section]    \n[section id=whathappens]  [h3]What action is taken when a scammer is found?[/h3]If evidence exists that a Steam user is scamming, Steam Support will ban the account from using the Steam Community, including trading and using the Steam Market. The length of the ban is dependent on the severity and quantity of the scams. In some cases, scammers will be banned permanently. If a scammer has multiple accounts, all of their accounts may be subject to the ban as well.\n\nIn rare cases, scammers will hijack an account and use it to commit scams, fraud, or other hijackings. In these cases, we lock the account until the rightful owner contacts us and we will take appropriate action.[/section]    \n[section id=noreturn]  [h3]Why doesn\u0027t Steam return scammed items?[/h3]Our community assigns an item a value that is at least partially determined by that item\u0027s scarcity. If more copies of the item are added to the economy through inventory rollbacks, the value of every other instance of that item would be reduced.\n\nWe sympathize with people who fall victim to scams, but we provide enough information on our website and within our trading system to help users make good trading decisions. For more information on this, please see [url=http://store.steampowered.com/news/20631/]this post[/url] on our store blog.[/section]     \n[h3]Why won\u0027t Steam Support provide information on why an account was trade banned or locked?[/h3]By limiting the provided data, Steam Support prevents malicious users from learning how to avoid getting caught in the future. Steam Support relies on several data points to arrive at a decision to ban or lock an account. Users intent on committing malicious activity, most often done to other users, are constantly trying to gain this data to use in future scams, fraud and hijackings.\n\nWhile most trade bans are permanent, in some circumstances a user may receive a temporary trade ban. In these cases, when the ban is automatically lifted the offending account also gets placed into trade probation. Probationary status allows other users to know that a user has recently committed a trading related offense so they can make better decisions about whether or not they want to trade with that user. Please note, probationary status does [i]not[/i] prevent users from trading.\n\n",
  "title": "Scam FAQ (Confidence Scams and Trade Scams)",
  "timestamp": "2021-08-11T21:49:59+00:00"
}