{
  "faq_id": 6540775144582804479,
  "language": 0,
  "version": 7,
  "content": "How can I troubleshoot slow downloads or connections within Steam?\n\n[h2]Is your download actually slow?[/h2][list]  \t[*][b]Comparing Steam download speeds to your Internet connection speed:[/b]\nInternet and other network connection speeds are typically measured in multiples of [b]bits[/b] per second. However, Steam downloads, like many other file downloads, are measured in multiples of [b]bytes[/b] per second. A [b]byte[/b] is a group of 8 bits.\n\nTo compare your Steam download speed to your connection speed, you can either switch your Steam client to display download information in bits (see the how to below), or you can multiply your Steam download speed by 8. For example, if you are getting 768KB/s (kilo[b]bytes[/b] per second) as your Steam download speed, you are getting 6144Kb/s (kilo[b]bits[/b] per second) or 6 megabits per second download speed according to most Internet service providers.\n\n[b]Example download speed conversions[/b]\n[expand][table]  \t\t  \t\t\t[tr]  \t\t\t\t[th][b]Advertised Connection Speed[/b][/th]  \t\t\t\t[th][b]Est. Max Steam Download Speed[/b][/th]  \t\t\t[/tr]  \t\t\t[tr]  \t\t\t\t[td][b]3 megabits/second[/b][/td]  \t\t\t\t[td][b]384 KB/S[/b][/td]  \t\t\t[/tr]  \t\t\t[tr]  \t\t\t\t[td][b]5 megabits/second[/b][/td]  \t\t\t\t[td][b]640 KB/S[/b][/td]  \t\t\t[/tr]  \t\t\t[tr]  \t\t\t\t[td][b]15 megabits/second[/b][/td]  \t\t\t\t[td][b]1.9 MB/S[/b][/td]  \t\t\t[/tr]  \t\t\t[tr]  \t\t\t\t[td][b]20 megabits/second[/b][/td]  \t\t\t\t[td][b]2.5 MB/S[/b][/td]  \t\t\t[/tr]  \t\t\t[tr]  \t\t\t\t[td][b]30 megabits/second[/b][/td]  \t\t\t\t[td][b]3.75 MB/S[/b][/td]  \t\t\t[/tr]  \t\t\t[tr]  \t\t\t\t[td][b]50 megabits/second[/b][/td]  \t\t\t\t[td][b]6.25 MB/S[/b][/td]  \t\t\t[/tr]  \t\t  \t[/table]  \t[b] [/b]  [/expand]\t\n\n[b]How to switch Steam\u0027s download information from bytes to bits[/b]\n[expand]\n[olist]\n[*]Go to [b]Steam[/b] \u003E [b]Settings[/b] \u003E [b]Downloads[/b] tab\n[*]On the Downloads tab check the [b]Display download rates in bits per second[/b] box\n[/olist][/expand]\n\n[b]What is your actual Internet connection speed?[/b]\nThe speed displayed in your System Tray or network connection properties is typically the speed you are connected to your local area network (LAN) and does not represent the speed you are connected to the Internet at. Please refer to the materials for your connection plan or contact your Internet service provider (ISP) for information on your connection speed. You can also use one of the numerous speed testing sites available online such as [url=https://www.speedtest.net/]Speedtest[/url] or [url=http://www.dslreports.com/]DSLReports[/url] to test your connection speed.[/*]  [/list]    \n[h2]Content Servers[/h2]Steam uses content servers that are located all over the world. Steam attempts to select the best content server based on your location.  If Steam downloads are going slower than expected, please double check your current download region:\n[olist]  \t[*]Start Steam[/*]  \t[*]Go to [b]Steam[/b] \u003E [b]Settings[/b] \u003E [b]Downloads[/b] tab[/*]  \t[*]Under [b]Download region[/b], select the region that you are in or that is closest to you.[/*]  \t[*]You can also try various regions near your location to see if a better connection is available.\n\n[/*]  [/olist]\n[h2]Third Party Applications[/h2]Some third-party applications can cause Steam to use incorrect content servers. Any sort of Internet security and/or packet filtering software may have a similar affect. This can also lead to connection issues. Please see the [url=https://help.steampowered.com/en/faqs/view/1F39-DCB4-FF28-5748]Programs Which Interfere with Steam[/url] guide to test the issue.\n\n[h2]Network Connectivity[/h2]Please follow these directions to make sure the correct ports are open and double check the list of ISP\u0027s that are known to have issues with Steam: [url=https://help.steampowered.com/en/faqs/view/669A-2F68-D1D1-A5EC]Troubleshooting Network Connectivity[/url].\n\n[h2]Connection Rate[/h2]Ensure that your Steam connection rate is set appropriately. For more information, please see [url=https://help.steampowered.com/en/faqs/view/163C-7C89-406E-2F63]Setting Client Rates[/url].\n\n",
  "title": "Slow Downloads and Connection to Content Servers",
  "timestamp": "2021-08-18T20:46:25+00:00"
}