{
  "faq_id": 8928310935471522734,
  "language": 0,
  "version": 7,
  "content": "[img]https://support.steampowered.com/images/faq/steam_link/SteamLink_Support_Header01.png[/img]     [h1]Steam Link Hardware[/h1]The Steam Link allows you to stream games from the Steam Library on your PC to any TV in your home. The technology takes advantage of the horsepower you already have in your home, streaming from your current gaming computer by mirroring its experience to your TV.\n\nVideo and audio data is sent from your computer, while your controller input is sent back in real time. Virtually every game that your computer runs can be streamed with the Steam Link.\n\n[section style=note]Steam Link technology is also available for [url=https://help.steampowered.com/en/faqs/view/7112-CD02-7B57-59F8]Android Devices[/url], [url=https://help.steampowered.com/en/faqs/view/175C-DDCE-F0CF-B3BD]Samsung TVs[/url], and [url=https://help.steampowered.com/en/faqs/view/6424-467A-31D9-C6CB]Raspberry Pi[/url][/section]    \t\n\n[h4]Required/Recommended Equipment[/h4]\t\t[*]A computer running Steam, Windows 7 or newer, Mac OS X 10.10 (Yosemite) or newer, SteamOS, or Linux Ubuntu 12.04 or newer.[/*]  \t\t\t[*]A TV or display capable of running at 720p or 1080p resolution[/*]  \t\t\t[*]Home network connectivity to both Steam Link and host computer. Wired network strongly recommended.[/*]  \t\t\t[*]Any of the input devices listed below[/*]\n\n[h4]Supported Input/Controllers[/h4][list]  \t\t\t[*][url=https://store.steampowered.com/app/353370/Steam_Controller/]The Steam Controller[/url][/*]  \t\t\t[*]The official Microsoft Xbox One Wired Controller[/*]  \t\t\t[*]The official Microsoft Xbox One S Controller (wired or wirelessly using Bluetooth)[/*]  \t\t\t[*]The official Microsoft Xbox One Elite 2 Controller (wired or wirelessly using Bluetooth)[/*]  \t\t\t[*]The official Microsoft Xbox 360 Wired Controller[/*]  \t\t\t[*]The official Microsoft Xbox 360 Wireless Controller for Windows (with wireless receiver)[/*]  \t\t\t[*]Sony Dualshock 4 (wired or wirelessly using Bluetooth)[/*]  \t\t\t[*]The official Nintendo Switch Pro Controller (wired)[/*]  \t\t\t[*]Logitech Wireless Gamepad F310, F510, and F710[/*]  \t\t\t[*]Razer Kishi and Raiju controllers[/*]  \t\t\t[*]SteelSeries Stratus Duo[/*]  \t\t\t[*]Keyboard and mouse[/*]  \t\t[/list]\n\n[i]Please note: other input devices may work even if they aren’t officially supported.[/i]\n\n[h4]Getting Started[/h4][olist]  \t\t\t[*]Turn on your home PC, launch [url=https://store.steampowered.com/about/]Steam[/url], and log in.[/*]  \t\t\t[*]Power your Steam Link with the power adapter, plug in to a display device (HDMI), and connect to your home network. [/*]  \t\t\t[*]Plug a controller, mouse, or keyboard into one of the USB ports on your Link. Follow the on-screen instructions to locate computers running Steam on your home network, then choose one and start streaming games to your TV![/*]  \t\t\t[*]Once you’ve gotten everything running, you can pair the Steam Controller directly to the Link, without using a wireless USB receiver.[/*]  \t\t[/olist]\n\nIf you have questions about the app or need help using it, just click the appropriate tab.\n\n[expand type=title title=\u0022Frequently Asked Questions\u0022]    [h4]Why is my Steam Link unable to find my host computer?[/h4]There are a number of factors that can cause this issue, please try the following steps:\n\n[olist]  \t\t\t\t[*]Make sure you are on the same home network and that Steam is running[/*]  \t\t\t\t[*]Enable streaming from the Remote Play settings menu in the Steam client[/*]  \t\t\t\t[*]If possible, connect all devices directly to the router with an Ethernet cable[/*]  \t\t\t[/olist]\n\n[h4]Why can’t I connect to my host computer?[/h4]One of the most common causes for this issue is interfering software, such as a firewall or anti-virus software. Please review the [url=https://help.steampowered.com/en/faqs/view/1F39-DCB4-FF28-5748]Programs Which May Interfere with Steam[/url] article.\n\nAlternatively, from the Steam Link main menu, highlight your host computer, then press the \u0022Y\u0022 button to start the network test. This test will start Big Picture on your host computer and simulate 10 seconds of network traffic with your current network settings.\n\nThe test will also inform you if there are any issues with ports. If you see any errors, make sure your [url=https://help.steampowered.com/en/faqs/view/2EA8-4D75-DA21-31EB]ports are appropriately configured for Steam.[/url]\n\n[h4]The game is choppy and unresponsive. How can I improve the experience?[/h4]We recommend using wired connection for best experience. For wireless connection, the majority of people have found that switching to a 5GHz network significantly improves the gaming experience.\n\nAlternatively, you can switch to the ‘Fast’ streaming quality option from the Streaming settings in the Steam Link.\n\n[h4]How can I pair multiple controllers to my Steam Link?[/h4]You can pair a Steam Controller to your wireless receiver or directly to the Steam Link. To pair a Steam Controller directly to the Link, remove all USB peripherals from the Steam Link, boot to the blue pairing screen, and power-on the Steam Controller by holding \u0022X\u0022 with the Steam/Home button. You can repeat these steps for pairing additional controllers.\n\nTo toggle between pairing modes (the wireless receiver or Steam Link), press the Steam button while holding \u0022A\u0022.\n\n[h4]How can I play non-Steam games on the Steam Link?[/h4]The Steam Link can stream any computer game once you add it to your Steam library. Retail games and non-Steam games can be added to your Steam library from the Steam client by clicking \u0022\u002B ADD A GAME\u0022 in the bottom left corner and then selecting “Add a Non-Steam Game to My Library...”. You should launch the game from Steam, rather than using a shortcut on your desktop.\n\n[/expand][expand type=title title=\u0022Troubleshooting\u0022]\t    \t[h4]Experiencing Performance Issues?[/h4]If you are experiencing performance issues please ensure that your [url=https://help.steampowered.com/en/faqs/view/3E3D-BE6B-787D-A5D2]settings are optimized for Streaming.[/url]\n\n[h4]Contacting Steam Support[/h4]If you have other issues or questions, contact [url=https://help.steampowered.com/en/wizard/HelpWithGameIssue/?appid=353380\u0026issueid=354\u0026nodeid=1\u0026return_nodeid=9]Steam Support[/url] and attach the [i][b]remote_connections.txt[/b][/i] and [i][b]streaming_log.txt[/b][/i] files to your ticket.\n\nThe default location for these files on your PC is [i][b]C:\\Program Files (x86)\\Steam\\logs[/b][/i]\n\n[/expand]\n\n",
  "title": "Steam Link Hardware"
}