{
  "faq_id": 3456374830860450845,
  "language": 0,
  "version": 5,
  "content": "Some Steam games may provide you with an additional activation key once they have been downloaded on a Steam account. These keys appear in the Steam library when you right-click the game and select \u0027Manage\u0027 -\u003E \u0027CD keys\u0027. These keys are used to register your product outside of Steam, with a third party client or service.\n\n[img]https://support.steampowered.com/images/faq/client/view_cd_key.jpg[/img]\n\n[section style=important]This FAQ pertains to Steam-issued keys that were added to your account after a game was purchased or registered. If you are registering a retail or digital key to your Steam account, please see the [url=https://help.steampowered.com/en/faqs/view/0E71-0971-324A-1161]Retail \u0026 Digital CD Keys[/url] FAQ for further information.[/section]\n[h4]Why am I not receiving my Steam-issued third party key?[/h4]Make sure that the game has been successfully downloaded and installed through the Steam client. A key will not be issued on the Steam account until the download has begun.\n\nIf the key is still not generating, please [url=https://help.steampowered.com/en/faqs/view/0C48-FCBD-DA71-93EB]verify integrity of game files[/url] and restart the Steam client.\n\n[h4]Why am I receiving a Failed to Contact Key Server error[/h4]\nFor information on this error please see the [url=https://help.steampowered.com/en/faqs/view/19CE-F573-6077-CAF8]Failed to Contact Key Server[/url] page.\n\n[h4]Why am I receiving an Invalid Key error when attempting to register my key?[/h4]If you receive an invalid or duplicate error when registering Steam issued key, you will need to contact the third-party game developer/publisher\u0027s support team for that game.\n[section style=note][h5]Contacting third-party support[/h5]\nSteam does not have access to third-party registration systems and cannot resolve issues with registration.\n\nYou can find the third-party game\u0027s support contact information by selecting the game in your Steam Library and then on the right hand side select \u0022Support\u0022 from the tabs available above the \u0022Activity\u0022 section.\n\nMake sure to provide them with your Steam-issued CD Key so that they can better assist you.\n[/section]\n\n\n\n\n",
  "title": "Steam-Issued Activation Keys",
  "timestamp": "2021-08-05T19:37:53+00:00"
}