{
  "faq_id": 481927930167436620,
  "language": 0,
  "version": 5,
  "content": "[list]  \t[*][url=#what]What is Steam Guard and how does it help me?[/url][/*]  \t[*][url=#enableemail]How do I enable Steam Guard via email?[/url][/*]  \t[exclude_realm=china][*][url=#enablephone]How do I enable Steam Guard via my smartphone?[/url][/*][/exclude_realm]   \t[*][url=#limit]Is there a limit to the number of machines that can be authorized?[/url][/*]  \t[*][url=#deauthorize]How do I deauthorize a device?[/url][/*]  \t[*][url=#code]How do I get a new Steam Guard code?[/url][/*]  \t[*][url=#email]I\u0027m not receiving a Steam Guard email…[/url][/*]  \t[*][url=#auth]Why am I being asked to authenticate a \u0022new device\u0022 every time I log in on the same device?[/url][/*]  \t[*][url=#cantlogin]What if I can\u0027t log in once Steam Guard is enabled?[/url][/*]  \t[*][url=#ps3]Will Steam Guard prohibit me from logging into 3rd party sites that sign in through Steam?[/url][/*]  \t[*][url=#stolen]How do Steam Guard enabled accounts get stolen?[/url][/*]  \t[*][url=#notenabled]Why does Steam report \u0027Steam Guard not enabled\u0027 while the Steam Guard button is missing?[/url][/*]  [/list]\n\n[img]http://steamcdn-a.akamaihd.net/steam/support/banner_steamguard.jpg[/img]\n\n[url id=what][/url]\n[h1]What is Steam Guard and how does it help me?[/h1]Steam Guard is an additional level of security that can be applied to your Steam account. The first level of security on your account is your login credentials: your Steam account name and password. With Steam Guard, a second level of security is applied to your account, making it harder for your Steam account to fall into the wrong hands.\n\nWhen Steam Guard is enabled on your account, you\u0027ll need to provide a special code to login from an unrecognized device. Depending on your Steam Guard settings, you\u0027ll either receive an email with the special code[exclude_realm=china] or you\u0027ll get it from the Steam Mobile app on your smartphone[/exclude_realm].\n\n[url id=enableemail][/url]\n[h1]How do I enable Steam Guard via email?[/h1]Steam Guard is enabled by default on your Steam account if your email is verified and you have restarted Steam twice on your computer since verifying your email. If you have disabled Steam Guard, and wish to reactivate it, please follow the instructions below:\n\n[olist]\n[*]Be sure your contact email address is verified with Steam.\nYou must verify your contact email address with Steam. You can check whether your email address is already verified by visiting Account Details page. A verified address will be marked as \u0022Verified.\u0022 [url=https://help.steampowered.com/en/faqs/view/1F1B-BE53-E7CA-A76F#verify]Learn how to verify your email address[/url].\n\n[*]Enable Steam Guard in Steam Settings.\nWhile logged into the Steam client, you can enable Steam Guard by clicking on \u0022Steam\u0022 in the top left hand corner of the client. Then Select \u0022Settings\u0022, and click \u0022Manage Steam Guard Account Security\u0022 under the \u0022Account\u0022 tab. On the page that appears, select \u0022Get Steam Guard codes by email (will require you to re-login)\u0022.\n[/olist]\nThat\u0027s it! With Steam Guard enabled, you will be asked to enter the special access code sent to your email address each time you login to Steam from an unrecognized device.\n[exclude_realm=china] \n[url id=enablephone][/url]\n[h1]How do I enable Steam Guard via my smartphone?[/h1]Getting Steam Guard codes via your smartphone provides the best level of Steam account security because you\u0027re authorizing your logins with a physical device that you possess. You\u0027ll need to [url=http://store.steampowered.com/mobile]download and install the free Steam Mobile app to your phone[/url].\n[/exclude_realm] \n\n[url id=limit][/url]\n[h1]Is there a limit to the number of machines that can be authorized?[/h1]No, there\u0027s no limit. Steam Guard is aimed to protect the value that is yours, not limit your access to your stuff. As always, you can access your Steam account and library from as many machines as you\u0027d like.\n\n[url id=deauthorize][/url]\n[h1]How do I deauthorize a device?[/h1]Deauthorizing a machine removes it from Steam Guard authorization, which means that it will look like a new device the next time you use it to log in, and a Steam Guard code will be required.\n\nIf you\u0027ve mistakenly checked the \u0022remember me\u0022 box when logging in to a public computer or if your account has been compromised, you should deauthorize any computers that you\u0027ve previously added to Steam Guard. You can do this from your Account Details page \u003E Manage Steam Guard and select \u0022Deauthorize all other devices\u0022 at the bottom of the page. This will deauthorize all computers or devices other than the one you\u0027re performing this action from.\n\n[url id=code][/url]\n[h1]How do I get a new Steam Guard code?[/h1]Email - Exit Steam and log back into your account. This will generate a new verification email.\n[exclude_realm=china] \nPhone - The Mobile Authenticator will automatically generate a new code every 30 seconds.\n[/exclude_realm] \nAlways ensure that you enter the most recent code sent or generated - older codes will not work!\n\n[url id=email][/url]\n[h1]I\u0027m not receiving a Steam Guard email…[/h1]Make sure that you are watching the correct inbox for the email address associated with your Steam account. \n\nIf you are not receiving the e-mail at all, check your spam filters and spam inbox.\n\nPlease try adding \u0022support@steampowered.com\u0022 and \u0022noreply@steampowered.com\u0022 to your contacts or trusted senders list within your email client and [url=#code]request a new access code.[/url]\n\nEven though Steam instantly sends an email, you may encounter a delay with some email providers depending on their server load and processing times. Please [url=https://support.steampowered.com/newticket.php]contact us[/url] if you have not received the verification email after 3 hours.\n\n[url id=auth][/url]\n[h1]Why am I being asked to authenticate a \u0022new device\u0022 every time I log in on the same device?[/h1]This may be caused by your browser\u0027s security settings. If your web browser\u0027s ‘Privacy’ settings are set too high, then your browser will be unable to store (web) cookie information. Check your browser settings to ensure that cookies are allowed.\n\nRunning programs that clear internet history, delete other types of unused files, block cookie creation, or clean up orphaned registry entries may also be responsible for this issue. Disabling such programs will prevent this issue from occurring when logging into Steam via your web browser.\n\nPlease see our [url=https://help.steampowered.com/en/faqs/view/4C93-64EF-517B-3329]Why do I have to enter a Steam Guard code every time I log in?[/url] for more information.\n\n[url id=cantlogin][/url]\n[h1]What if I can\u0027t log in once Steam Guard is enabled?[/h1]For help logging into Steam visit [url=https://help.steampowered.com]https://help.steampowered.com[/url]\n\n[url id=ps3][/url]\n[h1]Will Steam Guard prohibit me from logging into 3rd party sites that sign-in through Steam?[/h1]No, Steam Guard will not limit your ability to access your Steam account through third-party websites that enable a sign-in via your Steam account credentials.\n\n[url id=stolen][/url]\n[h1]How do Steam Guard enabled accounts get stolen?[/h1]Steam Guard protects your Steam account by requiring access to your verified email account. This second layer of security depends on your email account also being secure. Below are the common methods used to steal accounts with Steam Guard enabled:\n\n[list]\n[*]Through Email: If your verified email account is stolen or compromised, a user can enter your account freely provided they know your account name. Knowing your Steam account password would not be required as this can be reset with access to your email account. Never use the same password for both your email and Steam account.\n[*]Acquiring a Steam Guard File: Steam will never ask you to provide any Steam Guard files. If you upload or give a user your Steam Guard .SSFN file, they can gain access to your account without accessing your email account. However, they must know your Steam account password and username to use this file.\n[*]Malware: Hijackers can use malware to gain access to your computer and login to your account using your already authorized device. Since your Steam account could be logged in or you have your account credentials saved, the hijacker does not need to know anything about your account to gain access. Using a proper anti-virus software with real-time protection and avoiding unsafe websites and files will prevent malware from entering your system.\n[*]Phishing: Hijackers will sometimes use social engineering to steal your Steam account information, often impersonating Steam or Valve employees. You should never provide your Steam account or personal information to someone claiming to be from Valve or Steam. Steam Support is exclusively handled through help.steampowered.com.\n[/list]\n[url id=notenabled][/url]\n[h1]Why does Steam report \u0027Steam Guard not enabled\u0027 while the Steam Guard button is missing?[/h1]This can happen after Steam Support has restored your account. If the button to enable or change Steam Guard\u0027s settings is missing, you must restart Steam.\n\nThe Steam client\u0027s settings dialog will appear like this:\n\n[img]https://support.steampowered.com/images/faq/steamguard/sgnotenabled.png[/img]\n",
  "title": "Steam Guard"
}