{
  "faq_id": 3001355762314666642,
  "language": 0,
  "version": 7,
  "content": "What should I do if Steam is crashing, not opening correctly or closing immediately after launching?\n\nDue to the wide variety of custom hardware and software configurations, Steam crashes can be caused by many factors. The troubleshooting steps outlined in this article are aimed at making sure that your Steam installation and computer environment are both in a good state, so that Steam can work as intended.\n\nThere are occasions when crashing issues are not necessarily related to user configurations. These crashes need to be addressed by Steam developers through client updates. We automatically sample and collect crash dumps from affected users, so that fixes can quickly be added through Steam updates.\n\nIf you\u0027re working with Steam Support, they may also ask you to provide more information or perform tests that can narrow down the cause of the issue.\n\nYou can always download the latest version of the Steam client application directly from [url=http://store.steampowered.com/about/]Steam.[/url]\n\n\n[h1]Basic Steam Troubleshooting[/h1]The following steps will ensure that your Steam installation is in a good state. These can be performed with a minimal amount of technical knowledge.\n\n[h2]Restart Computer[/h2]As obvious as it sounds, it\u0027s always a good first step to make sure that you restart Steam as well as your computer.\n\nRestarting the computer flushes all kinds of system states and caches, while also resetting other programs and releasing locks on files and other resources.\n\n[h2]Reinstall Steam[/h2]\nThe Steam installer can be downloaded here: ([url=http://store.steampowered.com/about/]http://store.steampowered.com/about/[/url]) and reinstalled to the same location where it is already installed.\n\nThis may fix potential issues with Steam client and service files. Installing into same location will preserve all installed games.\n\nWARNING! Uninstalling Steam through any other method will delete all game and userdata content.\n\n[b]For macOS users:[/b]\nPlease see the article [url=https://help.steampowered.com/en/faqs/view/30EB-87BF-531F-512D]Removing and Reinstalling Steam on a Mac[/url] for specific instructions.\n\n\n[h1]Advanced Troubleshooting[/h1]If the issue is still occurring after following the steps outlined above, it is possible that something outside of Steam is responsible.\n\nBecause these advanced troubleshooting steps may be unique to your specific computer configuration, we highly recommend that you contact a local IT support specialist in your area for further assistance completing them.\n\n[h2]Remove External Devices[/h2]It is possible that an external device is causing Steam to not work correctly. External input devices require specific drivers that can interfere with Steam. We recommend unplugging all non-essential input devices from your computer to eliminate the possibility that they are interfering.\n\n[h2]Refresh Local Network Hardware[/h2]This includes restarting all modems \u0026 routers. Network hardware can get into slow/broken state after running for a long time. This can cause the update/login process of launching Steam to fail silently or crash.\n\n[h2]Update OS \u0026 Drivers[/h2]Make sure your operating system and all hardware drivers are up to date.\n\nFor Windows: Start → search \u0022update\u0022 → run \u0022Check for Updates\u0022\n\nFor Mac: drivers cannot be updated separately; only the operating system can be updated.\n\n[h2]Investigate Anti-Virus Software[/h2]AV software hooks very deep into user systems and can affect disk and network operations which will cause issues with Steam. Some games also use copy protection technology that can appear as malicious software to an AV scanner, resulting in potential false-positive alerts.\n\nYou\u0027ll want to work with a specialist to ensure that your AV software is not interfering with Steam. You may even need to temporarily disable it for testing purposes. It may also be necessary to add exceptions for Steam in your AV configuration.\n\n[h2]Investigate Other Programs \u0026 Services[/h2]Any software that modifies or monitors system, disk or network activity can cause issues when trying to launch Steam. These programs and services can run in the background and are typically associated with software like Anti-Virus, ad-blockers, web-optimizers, firewalls, system cleaners, recording software, proxies, performance boosters etc.\n\nYou\u0027ll want to work with a specialist to ensure that these services \u0026 programs are not interfering with Steam. You may even need to temporarily disable them for testing purposes.\n\n[h2]Investigate Firewalls[/h2]Certain firewalls may prevent Steam from talking to its servers. You\u0027ll want to work with a specialist to ensure that the Firewall is not interfering. You may even need to temporarily disable it for testing purposes. It may be necessary to add exceptions in your firewalls for Steam if you discover that this is the cause.\n\n[h2]Disable Overclocking[/h2]Some users overclock their hardware to gain more performance while running their system outside of manufacturer recommended settings. This can cause memory and file corruption and should be disabled (usually in the computer BIOS).\n\n[h2]Test Online Connection[/h2]Some Internet providers cache or compress online data to save bandwidth (especially cellphone networks). This can cause issues with Steam. It is a good idea to test the issue by connecting to an entirely different network, preferably from a different internet service provider (ISP).\n\n[h2]Check Hard Drive for Errors[/h2]All storage drives/devices can be affected by file corruption, especially if it is older or running under a heavy load. You\u0027ll want to work with a specialist to investigate possible issues with your Hard Drive.\n\nFor Windows: My PC → Right Click on Drive → Properties → Tools → Error checking\n\nFor MacOS: Disk Utility → Click on Drive → Click First Aid (For older OS versions: click Repair Disk Permissions)\n\n[h2]Check RAM for Errors[/h2]Memory errors can cause issues with the Steam installation process, as well as gameplay. You\u0027ll want to work with a specialist to investigate possible issues with your system memory.\n\nWindows : Start -\u003E Find \u0022mdsched\u0022 and run Windows memory Diagnostic\n\n",
  "title": "Steam Client Troubleshooting"
}