{
  "faq_id": 7535050430889918772,
  "language": 0,
  "version": 4,
  "content": "[h2]For Android and iOS devices, and Windows Phone[/h2][img]http://steamcdn-a.akamaihd.net/steam/mobile/setupfaq/banner_phones.jpg[/img]\n\nSetup is done directly from your mobile device.\n\n[url=http://itunes.apple.com/us/app/steam-mobile/id495369748][img]https://steamstore-a.akamaihd.net/public/images/mobile/download_apple_button.png[/img][/url]\n\nOr you could email this link to your mobile device:\n\n[url=http://itunes.apple.com/us/app/steam-mobile/id495369748]http://itunes.apple.com/us/app/steam-mobile/id495369748[/url]\n\n[url=https://play.google.com/store/apps/details?id=com.valvesoftware.android.steam.community][img]https://steamstore-a.akamaihd.net/public/images/mobile/download_google_button.png[/img][/url]\n\nOr you could email this link to your mobile device:\n\n[url=https://play.google.com/store/apps/details?id=com.valvesoftware.android.steam.community]https://play.google.com/store/apps/detailsid=com.valvesoftware.android.steam.community[/url]\n\nAndroid users without access to Google Play can [url=http://media.steampowered.com/apps/steam-android/steam-2.3.9.apk]download version 2.3.9 here[/url].\n\nWindows Phone version available in the Microsoft Store:\n\n[url=https://www.microsoft.com/en-us/store/apps/steam-official/9nblggh4x7gm]https://www.microsoft.com/en-us/store/apps/steam-official/9nblggh4x7gm[/url]\n\nThe apps follow the same setup flow. For the purposes of this walkthrough, the images below show the iOS app.\n\nOnce you\u0027ve installed the app and signed in with your Steam account credentials, tap the menu icon at the top left to expose the app\u0027s main menu. Select \u0022Steam Guard\u0022 from the top of the menu.\n\n[img]http://steamcdn-a.akamaihd.net/steam/mobile/setupfaq/IMG_6568.jpg[/img]\n\nFrom here you can select \u0022Add Authenticator\u0022 to setup your authenticator, or \u0022Help\u0022 to learn more.\n\n[img]http://steamcdn-a.akamaihd.net/steam/mobile/setupfaq/1.jpg[/img]\n\nNext you\u0027ll enter a phone number, one that we can confirm with a text message. If you ever lose access to your Steam account, you can quickly recover it by asking Steam to send a text to this phone number.\n\nEnter your phone number. Add the international prefix from the drop down.\n\n[img]http://steamcdn-a.akamaihd.net/steam/mobile/setupfaq/2.jpg[/img]\n\nSteam will send a confirmation code to your phone.\n\n[img]http://steamcdn-a.akamaihd.net/steam/mobile/setupfaq/4.jpg[/img]\n\nEnter the code we\u0027ve sent to that phone number. If you didn\u0027t receive the text, you resend it using the link at the bottom of the screen. Note: Depending on your carrier, messages can be temporarily delayed. If you don\u0027t receive the text after a few hours, please contact Steam Support for additional assistance.\n\n[img]http://steamcdn-a.akamaihd.net/steam/mobile/setupfaq/3.jpg[/img]\n\nWhen the code is successfully entered, we\u0027ll present you with a Recovery code. Write down the code and store it in a safe place. Do not skip this step.\n\n[img]http://steamcdn-a.akamaihd.net/steam/mobile/setupfaq/5.jpg[/img]\n\nWhen the mobile authenticator is successfully enabled, you\u0027ll be presented with a unique Steam Guard code that will periodically refresh. When you log in to Steam you\u0027ll be asked to enter the code.\n\n[img]http://steamcdn-a.akamaihd.net/steam/mobile/setupfaq/6.jpg[/img]\n\n[h2]Protecting multiple accounts[/h2]Your Steam Mobile app can be used to authenticate multiple Steam accounts. To add an account, log out of the Steam Mobile app and log back in with with the account you want to add. Follow the steps above to add the mobile authenticator to this account. When that\u0027s successfully completed, the Steam Mobile app will display authenticator codes for both Steam accounts, regardless of the account you\u0027re logged in with.\n\nQuestions about Steam Guard Mobile Authenticators? [url=https://help.steampowered.com/en/faqs/view/7EFD-3CAE-64D3-1C31?l]Learn more here[/url]\n\n[section style=important]If you\u0027re having trouble logging in with the Steam mobile authenticator, please use our help site ([url=https://help.steampowered.com]help.steampowered.com[/url]) to recover your account.[/section]",
  "title": "Steam Guard: How to set up a Steam Guard Mobile Authenticator",
  "timestamp": "2021-07-22T23:01:08+00:00"
}