{
  "faq_id": 5297571435246367730,
  "language": 0,
  "version": 4,
  "content": "How can I change the language for Steam and my games?\n\n[h4]Changing the language of the Steam client[/h4]The Steam language setting determines which language the Steam client application displays, as well as the language which games are presented in. (Third-party titles may have their own language settings - these settings will generally be independent of the Steam language setting)\n\n[olist]  \t[*]Log into your Steam account[/*]  \t[*]Click on \u0022[b]Steam\u0022 [/b]in the top menu bar (this is in the very upper left of Steam on Windows, or in the menu bar above Steam on OSX)[/*]  \t[*]Go to the [b]Settings[/b] option (\u0022Preferences on\u0022 OSX)[/*]  \t[*]Go to the [b]Interface[/b] tab[/*]  \t[*]Select the language you wish to use from the drop-down menu[/*]  \t[*]Click [b]OK[/b] and then select the option to [b]Restart Steam[/b][/*]  \t[*]Once Steam restarts, you will be able to use Steam and Valve games in the language which you selected.[/*]  \t[*]If you have games installed that support the language you have selected, files for that language may need to be downloaded before you can play. [/*]  [/olist]\n\n[h4]Changing the language of individual games[/h4]The language of many games can be changed independently from the Steam client language.\n\n[olist]  \t[*]Open your Steam Library[/*]  \t[*]Right click the game title and select [b]Properties...[/b].[/*]  \t[*]Go to the [b]Language[/b] tab[/*]  \t[*]Select the language you wish to use from the drop-down menu[/*]  \t[*]If the game supports the language you have selected, files for that language may need to be downloaded before you can play.[/*]  [/olist]\nIf you are experiencing problems enabling a language, make sure your desired language is selected in both locations.\n\n[section style=note]Some languages may not be available for the game you wish to play. Check the Steam store page for the game to see which languages are offered.[/section]\n\n",
  "title": "Steam and Games - Language Settings"
}