{
  "faq_id": 7050570575392147956,
  "language": 0,
  "version": 4,
  "content": "      \t          \t[img]https://support.steampowered.com/steamvr/FitGuide/GuideHeader.png[/img]  \t  \t        \t[h1]General troubleshooting[/h1]The following steps solve the majority of issues. Before following any of the additional instructions below, please be sure to:\n\n[*]Verify Integrity of Tool Files (in the Steam Client, navigate to [i]Library[/i] and type \u0022SteamVR\u0022 in the search box, then right-click SteamVR and select  \t\t\t\t[i]Properties...[/i] \u003E [i]Local Files[/i] \u003E [i]Verify Integrity of Tool Files[/i]).[/*]  \t\t\t[*]Check your graphics driver versions and update if necessary - see [url=https://help.steampowered.com/en/faqs/view/5799-495F-1F25-D15B]Updating Drivers[/url].[/*]  \t\t\t[*]Restart SteamVR and test your issue again.[/*]  \t\t\t[*]Rerun Room Setup from the SteamVR status window.[/*]  \t\t\t[*]Restart Windows.[/*]\t  \t\t[hr][/hr]\t        \t\n\n[h1]Devices are not solid green in the SteamVR status window[/h1]A device will appear solid green in the SteamVR status window when it is ready for use.\n\n[video poster=\u0022https://support.steampowered.com/steamvr/FitGuide/Thumbnails/SteamVR Status Window all green.jpg\u0022 mp4=\u0022https://support.steampowered.com/steamvr/Room_Setup/SteamVR_StatusWindow_360x202_MP4.mp4\u0022 autoplay=0][/video]\n\nIf a device does not appear this way in the status window, refer to our troubleshooting articles for each device for help.\n[*][url=https://help.steampowered.com/en/faqs/view/7D79-694F-CD36-CC9A#hmdnotgreen]Index Headset[/url]\t\n[*][url=https://help.steampowered.com/en/faqs/view/57B5-E574-406A-4E61#knucklenotgreen]Index Controllers[/url]\n[*][url=https://help.steampowered.com/en/faqs/view/1AF1-670B-FF5C-3323#basenotgreen]Index Base Stations[/url][hr][/hr]\n\n    \t  \t[h1]Problems with your play area[/h1][h4]My virtual position is different than my actual position[/h4]These issues are usually a result of tracking problems. Follow [url=https://help.steampowered.com/en/faqs/view/1AF1-670B-FF5C-3323#tracking]these steps[/url] to resolve the issue.\n\n[h4]The orientation of my play area is not correct[/h4]If the position of your virtual floor or the \u0022front\u0022 of your virtual space is incorrect, you can run Room Setup from the SteamVR menu.\n\nYou can also change orientation and other features through advanced setting in room setup.\n\n[hr][/hr]\t        \t[h1]Common Issues[/h1][h4]Headset is not connecting or loses connection[/h4]Check all of your headset\u0027s connections. If you see any of the messages below, securing loose cables and restarting the heaset (SteamVR menu \u003E [i]Devices.[/i]   \t\t\t\t[i]Restart headset[/i]) can resolve the issue.\n\n[*][b][b]Headset Display Disconnected[/b][/b][/*]  \t\t\t\t[*][b][b]Headset not Detected[/b][/b][/*]  \t\t\t\t[*][b][b]Laptop: Headset Display Disconnected[/b][/b][/*]\n[h4]SteamVR fails to start, quits unexpectedly or is unresponsive[/h4]Start by performing all the steps from the General Troubleshooting section above. If your problem persists, you can try running SteamVR in safe mode:\n\n[*]Type \u0022run\u0022 into the Windows search bar.[/*]  \t\t\t[*]Type \u0022vrmonitor://safemode/enable\u0022 into the Run window.[/*]  \t\t\t[*]You can exit safe mode at any time from the dialog above the SteamVR status window.[/*]\nIf safe mode has not resolved your issue, click \u0022Contact Steam Support\u0022 below to get help.\n\n[h4]SteamVR Safe Mode[/h4]SteamVR\u0027s safe mode prevents the loading of some third party drivers and other components that can cause problems. If safe mode resolves your issue, it is likely that you have installed something that is interfering with SteamVR. For example, some VR \u0022utility\u0022 applications such as Natural Locomotion and LIV are known to conflict with SteamVR in some cases.\n\n[h1]Still having problems?[/h1]\n[url=https://help.steampowered.com/en/wizard/HelpWithVRHardware]Contact Steam Support[/url] for assistance.\n\n        \t\t            \n\n",
  "title": "SteamVR Troubleshooting (Index)",
  "timestamp": "2021-08-12T18:09:18+00:00"
}