{
  "faq_id": 8208599559700251315,
  "language": 0,
  "version": 5,
  "content": "[list]     [*][url=#onemachine]Can I use multiple Steam accounts on one computer?[/url][/*]     [*][url=#multiple]Can I use my Steam account on other computers?[/url][/*]     [*][url=#simultaneous]Can multiple users play simultaneously on one Steam account?[/url][/*]     [*][url=#cybercafe]Can I use my personal Steam Account in a PC Café?[/url][/*]     [*][url=#dedicated]Do I need a separate account to run a dedicated server?[/url][/*] [/list]\n[url id=onemachine][/url][h4]Can I use multiple Steam accounts on one computer?[/h4]Yes, you can access different Steam accounts from one computer. However, you may only access one account at a time.\n\nThe accounts will share the core files for any games the accounts have in common, but each account will maintain its own custom content and configuration files.\n[url id=multiple][/url]\n[h4]Can I use my Steam account on other computers?[/h4]You may use your Steam account on any machine which can connect to the Steam network - Steam allows you to download and install any games registered to your account as soon as you log in.\n[url id=simultaneous][/url]\n[h4]Can multiple users play simultaneously on one Steam account?[/h4]Steam does not support multiple players using one Steam account simultaneously - games associated with a Steam account are licensed for the sole use of the account holder.\n\nIf multiple users attempt to log in and play simultaneously with one Steam account, the user who logged in first will eventually receive an \u0022Invalid Steam UserID Ticket\u0022 error message and be forced to log back in to continue playing (if the first user logs back in, the second user will receive this error message).\n[url id=cybercafe][/url]\n[h4]Can I use my personal Steam Account in a PC Café?[/h4]Personal Steam Accounts may only be used in Cafés that are officially licensed by Valve - if the Café allows you to do so. The number of personal Steam Accounts used in an officially licensed [url=https://partner.steamgames.com/pccafe]Steam PC Café[/url] is limited to the number of active cybercafe subscriptions held in the Steam PC Café Program. A PC Café must be a member of the Steam PC Café Program in order to offer Steam games to its customers. We do not recommend using your personal Steam account in a Café.\n\nNote: please make sure that you log out of your Steam account before leaving the Café.\n[url id=dedicated][/url]\n[h4]Do I need a separate account to run a dedicated server?[/h4]If you are using a single Steam account for your Stand-Alone Dedicated Server and your game client, you will run into the \u0022Invalid Steam UserID Ticket\u0022 error which is presented to multiple users attempting to play simultaneously - if you intend to use a computer as a dedicated server, you must create a separate Steam account to run the dedicated server software.\n\nNote: Client Listen Servers use the Steam UserID ticket for the client on which they are run - the \u0022Invalid Steam UserID Ticket\u0022 error will not be presented when you are running a Client Listen Server unless another user logs into your account and starts a game.\n\n",
  "title": "Steam Account Use"
}