{
  "faq_id": 7553158533771523704,
  "language": 0,
  "version": 6,
  "content": "The Steam Cloud allows games and the platform to utilize cloud storage hosted by Steam. Games can utilize Steam Cloud for storage of many different types of data, including game settings, save games, profile stats and other user-specific bits. Many Steam client settings are also saved via the cloud, including collections, friend nicknames and anything changed via the Steam client Settings menu. These settings will persist on an account regardless of which machine it is logged into, as the settings are pulled from the cloud upon login.\n[list]          \n[*][url=#howto]How do I tell if a game uses Steam Cloud?[/url]  \t\n[*][url=#enabling]How can I enable or disable The Steam Cloud?[/url]  \t\n[*][url=#where]Where are cloud files stored locally?[/url]\t  \t\n[*][url=#log]Is there a log of Steam Cloud activity?[/url] \n[/list]  \n[h3]Issues \u0026 Troubleshooting[/h3]Because of the automated nature of cloud synchronization, Steam Support has a limited ability to address issues with the cloud. If any saves or other data have been lost, it is not likely that we will be able to recover them. It is for this reason that we encourage users to make sure they understand behaviors that can affect the cloud, so that when they are encountered, the loss of data can potentially be avoided.\n[list]          \n[*][url=#conflicts]How do I resolve a Steam Cloud conflict?[/url]  \t\n[*][url=#sync]What if Steam is unable to sync files to the cloud?[/url]  \t\n[*][url=#lostdata]What if I lost a file or progress after moving to a different machine?[/url]  \t\n[*][url=#crossplat]What if I have an issue with cross-platform cloud data?[/url]  \t[*][url=#basic]Steam Cloud Troubleshooting[/url]  \n[/list]\n[section id=howto][/section]  [h1]How do I tell if my game uses Steam Cloud?[/h1]Developers are able to completely customize how The Steam Cloud is used for their games, including which user files are uploaded.\n\nThe Steam Storepage will show a Steam Cloud logo in the upper right if a game uses the Steam Cloud. But, you may need to work with the developer or the community to determine exactly which files or settings are integrated.\n[section id=enabling][/section]\n\n[h1]How can I enable or disable The Steam Cloud?[/h1]\nThe Steam Cloud can be toggled for individual games, or as a global Steam setting for all games. When Steam Cloud functionality of a game is disabled, all progress that would normally be saved via the cloud will only be saved locally on the machine where the progress was made.\n\n[h3]Individual games:[/h3]\n[list]  \n[*]From the Steam Library, right click on any game and select [i]Properties...[/i].  \t[*]Under the [i]General[/i] tab, the Cloud Synchronization setting can be toggled.  [/list]\n[h3]All games:[/h3]\n[list]  \t\n[*]From the Steam client Settings window, navigate to the [i]Cloud[/i] tab.  \t[*]Cloud can be enabled or disabled using the toggle next to [i]Enable Steam Cloud Sync for applications that support it[/i].[/list]  \n[section id=where][/section]  \n[h1]Where are cloud files stored locally?[/h1]\nCloud files are stored locally in the following locations by default:\n\n[list]  \n[*][b]Windows:[/b] C:\\Program Files (x86)\\Steam\\userdata  \n[*][b]MacOS:[/b] ~/Library/Application Support/Steam/userdata  \n[*][b]Linux:[/b] ~/.local/share/Steam/userdata  \n[/list]  \n\n[h3]Game specific cloud files:[/h3]\nThe [i]userdata[/i] folder will contain unique Steam IDs, which correspond to the Steam accounts that have logged in on that machine.\n\nWithin the Steam ID folders are the respective games associated with those Steam accounts, listed by appID. The following example is for Dota 2 (appID 570):\n\n[list]\n[*]Steam\\userdata\\[steamID]\\570\\[/list]  \n[h3]Steam client cloud files:[/h3]\nChanges made to your Steam client settings are stored in the cloud, as well as locally in the following folder:\n\n[list]\n[*]Steam\\userdata\\[steamID]\\7\\[/list]  \n[section id=log][/section]  \n[h1]Is there a log of Steam Cloud activity?[/h1]\nSteam creates an log entry any time that files are written to the cloud or retrieved from it.\n\nThese are logged in the [i]cloud_log.txt[/i] file, which is stored in the following location by default:\n\n[list] \n[*][b]Windows:[/b] C:\\Program Files (x86)\\Steam\\logs  \n[*][b]MacOS:[/b] ~/Library/Application Support/Steam/logs  \n[*][b]Linux:[/b] ~/.local/share/Steam/logs  [/list]  \n[section id=conflicts][/section]    \n\n[h1]How do I resolve a Steam Cloud conflict?[/h1]\n\n[img]https://steamcdn-a.akamaihd.net/steam/support/faq/cloud_conflict.JPG[/img]\n\nThe Steam Cloud conflict window will be shown when a game is launched, if Steam detects that the local files associated with that game differ from the ones stored on the cloud.\n\nThis may have occurred on the machine you were using at the time that window was shown, or it may have occurred on another machine previously. Because the file was modified in two different locations without a synchronization between them, Steam cannot automatically pick which version of the file to keep.\n\nYou will most likely want to pick the version of the files that was modified most recently. This means you will have the progress made the last time you played the game. However, you would want to carefully consider how the dates and times in the conflict window for the cloud save files correspond to your behavior and progress within the game. This context will help you decide which files to select.\n\nNote that playing games in Offline Mode will keep games from syncing until you\u0027ve gone back online, and this is very likely to cause a conflict.\n\n\n[section id=sync][/section]      \n[h1]What if Steam is unable to sync files to the cloud?[/h1]\n\n[img]https://steamcdn-a.akamaihd.net/steam/support/faq/cloud_sync.JPG[/img]\n\nThis error indicates that Steam could not sync your local files to the Steam Cloud. It could be a temporary issue, or something could be wrong with your network that would need to be addressed.\n\nUsers are encouraged to address the underlying cause of the error prior to launching the game.\n\nIgnoring the message and selecting \u0022play game\u0022 could potentially cause a conflict between the cloud and your local files, resulting in lost data or progress.\n\n\n[section id=lostdata][/section]   \n[h1]What if I lost a file or progress after moving to a different machine?[/h1]\nIf you are not seeing your most recent progress and you have double-checked that the game uses Steam Cloud on its store page, either Steam was not able to sync successfully with Steam Cloud before closing, or the sync resulted in a previous version of your data being uploaded to the cloud.\n\nIt’s possible that the original file or progress is still on the older machine, but was unable to sync. It may be possible to launch Steam from that machine and see if it will Sync the game. If that works, the progress should be available on the newer machine the next time you launch.\n\nAlso, many games do not use Steam cloud to store save games. The game developer will be able to help you find and transfer those files if you are using a new machine and still have access to the old one. If you no longer have access to the previous machine, those save game cannot be recovered.\n\nSteam Support can provide further clarification on how the Cloud system works, but they cannot recover lost saves or assist in resolving cloud conflicts.\n\n\n[section id=crossplat][/section]    \n[h1]What if I have an issue with cross-platform cloud data?[/h1]\nSteam supports cross-platform integration of cloud data between different operating systems.\n\nHowever, not all games make use of this feature. You would want to check with the community or the developer to confirm the details of cross-platform cloud integration.\n\n\n[section id=basic][/section]      \n[h1]Steam Cloud Troubleshooting[/h1]\nIf you are continually experiencing issues with Steam cloud functionality, it\u0027s possible that something is interfering with the cloud or preventing it from working as expected.\n\nIt\u0027s a good idea to investigate each of the following scenarios to make sure that your machine is capable of using the cloud successfully.\n\nBecause some of these are advanced troubleshooting steps that involve areas outside of Steam, we highly recommend that you contact a local IT support specialist in your area to make sure that they are performed correctly.\n\n[h2]Refresh Local Network Hardware[/h2]This includes restarting all modems \u0026 routers. Network hardware can get into slow/broken state after running for a long time. This can cause cloud sync to take longer than normal, or to fail completely.\n\nIf you are using a wireless network connection, you will want to bypass this with a direct Ethernet connection between your machine and network hardware.\n\n[h2]Test Online Connection[/h2]Some Internet providers cache or compress online data to save bandwidth (especially cellphone networks). This can cause issues with Steam. It is a good idea to test the issue by connecting to an entirely different network, preferably from a different service provider.\n\n[h2]Investigate Firewalls[/h2]Certain firewalls may prevent Steam from talking to its servers. You\u0027ll want to work with a tech support specialist to ensure that the Firewall is not interfering. You may even need to temporarily disable it for testing purposes or add exceptions to your firewalls for Steam.\n\n[h2]Investigate Anti-Virus Software[/h2]AV software hooks very deep into user systems and can affect disk and network operations which may cause issues with Steam. Some games also use copy protection technology that can appear as malicious software to an AV scanner, resulting in potential false-positive alerts.\n\nYou\u0027ll want to work with a tech support specialist to ensure that your AV software is not interfering with Steam functionality. You may even need to temporarily disable it for testing purposes. It may also be necessary to add exceptions for Steam in your AV configuration (for example, excluding Steam cloud folders like ...\\Steam\\userdata and installation folders for Steam games from live monitoring services).\n\n[h2]Investigate Other Programs \u0026 Services[/h2]Any software that modifies or monitors system, disk or network activity can cause issues while downloading or running a game. These programs and services can run in the background and are typically associated with software like Anti-Virus, ad-blockers, web-optimizers, firewalls, system cleaners, recording software, proxies, performance boosters etc.\n\nYou\u0027ll want to work with a tech support specialist to ensure that these services \u0026 programs are not interfering with Steam. You may even need to temporarily disable them for testing purposes.",
  "title": "Steam Cloud"
}