{
  "faq_id": 7535050430889918772,
  "language": 0,
  "version": 6,
  "content": "[h2]For Android and iOS devices, and Windows Phone[/h2][img]{STEAM_CLAN_IMAGE}/39983882/f003809313f459e15688224942da8a10fb8ac721.png[/img]\n\nSetup is done directly from your mobile device.\n\n[url=http://itunes.apple.com/us/app/steam-mobile/id495369748][img]https://steamstore-a.akamaihd.net/public/images/mobile/download_apple_button.png[/img][/url]\n\nOr you could email this link to your mobile device:\n\n[url=http://itunes.apple.com/us/app/steam-mobile/id495369748]http://itunes.apple.com/us/app/steam-mobile/id495369748[/url]\n\n[url=https://play.google.com/store/apps/details?id=com.valvesoftware.android.steam.community][img]https://steamstore-a.akamaihd.net/public/images/mobile/download_google_button.png[/img][/url]\n\nOr you could email this link to your mobile device:\n\n[url=https://play.google.com/store/apps/details?id=com.valvesoftware.android.steam.community]https://play.google.com/store/apps/detailsid=com.valvesoftware.android.steam.community[/url]\n\nAndroid users without access to Google Play can [url=https://media.steampowered.com/apps/steam-android/steam-3.0.0.apk]download version 3.0.0 here[/url].\n\nWindows Phone version available in the Microsoft Store:\n\n[url=https://www.microsoft.com/en-us/store/apps/steam-official/9nblggh4x7gm]https://www.microsoft.com/en-us/store/apps/steam-official/9nblggh4x7gm[/url]\n\nThe apps follow the same setup flow. For the purposes of this walkthrough, the images below show the iOS app.\n\nOnce you\u0027ve installed the app and signed in with your Steam account credentials, you\u0027ll land on the Steam Guard tab. From here you can select \u0022Add authenticator\u0022 to setup your authenticator.\n\n[img]{STEAM_CLAN_IMAGE}/39983882/c80555d76bb109e1aa5ebdd0e65d84d312263eea.png[/img]\n\nNext you\u0027ll enter a phone number, one that we can confirm with a text message. If you ever lose access to your Steam account, you can quickly recover it by asking Steam to send a text to this phone number.\n\nEnter your phone number. Add the international prefix from the drop down.\n\n[img]{STEAM_CLAN_IMAGE}/39983882/6b4f8493ea9fc250363d377e187c6b0f80dfc30c.png[/img]\n\nSteam will send a confirmation code to your phone.\n\n[img]{STEAM_CLAN_IMAGE}/39983882/65f58f5cf33a5fe23bd247b2326ced526e324d64.png[/img]\n\nEnter the code we\u0027ve sent to that phone number. If you didn\u0027t receive the text, you resend it. Note: Depending on your carrier, messages can be temporarily delayed. If you don\u0027t receive the text after a few hours, please contact Steam Support for additional assistance.\n\n[img]{STEAM_CLAN_IMAGE}/39983882/09d67250a5c82019d94905d81b92de5fed70df52.png[/img]\n\nWhen the code is successfully entered, we\u0027ll present you with a Recovery code. Write down the code and store it in a safe place. This code allows you to recover your account yourself, should you lose your phone or authenticator. Do not skip this step. \n\n[img]{STEAM_CLAN_IMAGE}/39983882/09d67250a5c82019d94905d81b92de5fed70df52.png[/img]\n\nWhen the mobile authenticator is successfully enabled, you\u0027ll have three options for confirming your Steam sign ins. \n\n1 - Use the mobile app to scan the QR code presented by Steam at sign in\n2 - Enter your name and password, then Steam will send you an app notification asking you to confirm\n3 - Enter your name and password, then enter the Steam Guard code from the mobile app\n\n\n[h2]Protecting multiple accounts[/h2]Your Steam Mobile app can be used to authenticate multiple Steam accounts. From the blue drop down on the Steam Guard tab, select an account or add a new one. Follow the steps above to add the mobile authenticator to this account. When that\u0027s successfully completed, you\u0027ll be able to confirm sign ins for all of your accounts, regardless of which  account is signed into the app.\n\nQuestions about Steam Guard Mobile Authenticators? [url=https://help.steampowered.com/en/faqs/view/7EFD-3CAE-64D3-1C31?l]Learn more here[/url]\n\n[section style=important]If you\u0027re having trouble logging in with the Steam mobile authenticator, please use our help site ([url=https://help.steampowered.com]help.steampowered.com[/url]) to recover your account.[/section]",
  "title": "Steam Guard: How to set up a Steam Guard Mobile Authenticator",
  "timestamp": "2022-10-14T22:00:12+00:00"
}