{
  "faq_id": 3441687720737367382,
  "language": 0,
  "version": 7,
  "content": "Streaming Videos on Steam is a new feature that enables watching a video on Steam without the need to first download the video locally.\n[list][*][url=#1]How does this differ from downloadable versions of videos on Steam?[/url]  \t[*][url=#2]What are the requirements for streaming videos on Steam?[/url]  \t[*][url=#9]How do I test my system requirements for streaming videos on Steam?[/url]  \t[*][url=#14]How long do I have to watch a video rental on Steam?[/url]  \t[*][url=#3]How do I select a specific bit rate for streaming?[/url]  \t[*][url=#4]How do I enable closed captions?[/url]  \t[*][url=#5]How do I configure the display of closed captions?[/url]  \t[*][url=#18]How do I switch to an alternate video or audio track (e.g. commentary or language dub)?[/url]  \t[*][url=#19]How do I control a video using a game controller?[/url]  \t[*][url=#12]Why does the video look corrupted with random blocks appearing?[/url]  \t[*][url=#15]What are the \u0022additional components\u0022 required for playback?[/url]  \t[*][url=#16]I am receiving an error about failing to retrieve a required license, what do I do?[/url]  \t[*][url=#17]I am receiving an error about HDCP, what do I do?[/url]  \t[*][url=#6]I\u0027ve received an error message while streaming, what should I do?[/url]  \t[*][url=#7]How can I provide feedback on streaming the video?[/url]  \t[*][url=#8]How can I remove the video from my Steam Library?[/url]  \t[*][url=#10]How can I filter out streaming videos on the Steam store?[/url]  \t[*][url=#11]How do I download the video instead of streaming it?[/url]  \t[*][url=#known]Known Issues[/url]  \t[*][url=#20]How Can I Get My Film/Video on Steam?[/url]  [/list]  [url=#360]  \n[h1]Steam 360 Video FAQ[/h1][/url]  [list][*][url=#360_install]Installing the Steam 360 Video Player[/url]    \n[*][url=#360_content]What\u0027s available to watch now?[/url]    \n[*][url=#360_sysreqs]What are the system requirements to play a Steam 360 Video?[/url]       \n[*][url=#360_controls]How do I control the Steam 360 Video player?[/url]               \n[*][url=#360_formats]What do the 360 Formats on the store page mean?[/url]   \n[/list]\n[url id=1][/url]\n[h2]How does this differ from downloadable versions of videos on Steam?[/h2][list]  \t[*]Streaming allows you to start watching without having to first download an entire video file or run a custom installer  \t[*]The video quality will automatically adjust based on your available download bandwidth  \t[*]Videos will appear in your Library under the Videos filter [/list]\n[url id=2][/url]\n[h2]What are the requirements for streaming videos on Steam?[/h2][list]  \t[*]Streaming is supported in all Steam Clients on Windows, Mac OSX, Linux, Steam Machines and streaming via the Steam Link.  \t[*]Recommended Operating Systems: Windows 7, 8.1, 10; MacOSX 10.10\u002B or Linux Ubuntu 12.04\u002B; Steam OS 2.20\u002B  \t[*]Minimum of 12Mbps network download speed for 1080p, 8Mbps for 720p, 5Mbps for 540p and 3Mbps for 360p.  \t[*]Playback performance will vary based on CPU. i3 or above CPUs are recommended for 1080p streaming  [/list]\n[url id=9][/url]\n[h2]How do I test my system requirements for streaming videos on Steam?[/h2]Before you purchase a streaming video on Steam, you should consider watching one of the free streaming videos already on Steam. That will help to determine if your system can successfully stream videos.\n[olist]  \t[*]Log in to the Steam Client  \t[*]From the Steam Store, click in the Search Box.  \t[*]Type in [i]Free To Play [/i]and select [i]Free To Play[/i] from the search results  \t[*]On the Free To Play store page, find [i]Watch Free To Play (Streaming)[/i] and click Watch  \t[*]The streaming video will then begin playing back  [/olist]\n[url id=14][/url]\n[h2]How long do I have to watch a video rental on Steam?[/h2]Steam Video rentals give you a certain number of days to begin watching the video and then a certain number of hours to finish watching the video. That information can be found in the following places:\n[olist]  \t[*]On the Steam Store within the rental package section, e.g. Watch this 48-hour rental any time in the next 30 days.  \t[*]After renting a movie on Steam, the remaining time is shown in the Steam Library for the rented video.  [/olist]\nNote: After the rental time has expired, the video will remain in your Library for up to 48 hours but will not be playable without purchasing a new rental period.\n[url id=3][/url]\n[h2]How do I select a specific bit rate for streaming?[/h2]The video quality will automatically adjust based on your available download bandwidth and current video resolution. However, if you wish to select a specific bit rate:\n[olist]  \t[*]Move your mouse over the video player  \t[*]Click the settings icon [img]https://steamcommunity-a.akamaihd.net/public/images/chat/icon_settings.png[/img] on the right-hand side of the control bar  \t[*]From the Quality drop down, select the target bit rate  \t[*]The video will pause to buffer content at the selected resolution and then begin playing automatically  [/olist]\n[url id=4][/url]\n[h2]How do I enable closed captions?[/h2]Not all streaming videos contain closed captions. If closed captions are available, they will be enabled automatically if the language of the audio does not match the language set in Steam.\nTo manually change the selected closed caption:\n[olist]  \t[*]Start playback of a Streaming Video  \t[*]Move your mouse over the video player  \t[*]Click the Caption Options (CC) on the right-hand side of the control bar  \t[*]Select from the Captions drop down the language of captions you want displayed, or None to turn off captions.  [/olist]\n[url id=5][/url]\n[h2]How do I configure the display of closed captions?[/h2][olist]  \t[*]Start playback of a Streaming Video  \t[*]Move your mouse over the video player  \t[*]Click the Caption Options (CC) on the right-hand side of the control bar  \t[*]Set the desired closed captions display options  \t[*]Click Done to accept the changes or click Cancel to undo all changes  [/olist]\n[url id=18][/url]\n[h2]How do I switch to an alternate video or audio track (e.g. commentary or language dub)?[/h2]If a streaming video contains an alternate video or audio track such as a commentary or a language dub, you can switch between the available tracks using the Settings, Video / Audio Track selector.\n[olist]  \t[*]Move your mouse over the video player  \t[*]Click the settings icon [img]https://steamcommunity-a.akamaihd.net/public/images/chat/icon_settings.png[/img] on the right-hand side of the control bar  \t[*]Click the dropdown related to the video or audio track and select the track you want to switch to  \t[*]Note: In Big Picture mode, the track will not change until you press A and close the Settings dialog  [/olist]\n\nThe [url=http://store.steampowered.com/app/245550]Free To Play (Streaming)[/url] video contains an example of alternate audio tracks including an English Audio Track and two commentary tracks featuring Dota players, Fear and Dendi.\n[url id=19][/url]\n[h2]How do I control a video using a game controller?[/h2]A game controller (Steam Controller, Xbox, etc.) can be used to control the video player only when in Big Picture mode. A specific user interface has been implemented to support this.\n[list]  \t[*]Use the joystick or dpad to move between the controls shown on screen  \t[*]Use the A button to execute a control (Play/Pause, Stop, Skip Back/Forward, etc.)  \t[*]Use the B button to navigate back or hide the controls  \t[*]Use the trigger, shoulder and grip buttons where applicable to skip forward and backward through the video at different time intervals, from 15 seconds to 5 minutes  \t[*]Use the Start button to Pause the video  \t[*]Use the Back button to Stop the video and return to Big Picture  \t[*]To preview the video, navigate to the playback progress bar and use the left or right stick (or scrub the right pad on the Steam Controller) to change the preview thumbnail. Press the A button to seek to that point in time for video playback  \t[*]Use the CC icon to select a caption or subtitle language and customize the look of the captions  \t[*]Navigate to the Volume control to change the volume using up and down or press the A button to mute/unmute  \t[*]Use the Settings icon to change video quality, audio tracks, playback speed and other options  \t[*]When appropriate, a Next Video button will be shown to move to the next video in the Series, Season or Bonus Video content.  [/list]\n[url id=12][/url]\n[h2]Why does the video look corrupted with random blocks appearing?[/h2]On some system configurations the combination of video hardware, video drivers and Steam\u0027s hardware acceleration can cause large pixels or macro blocks to appear on screen during playback. For some users, turning off Hardware Video Decoding can resolve this issue:\n[olist]  \t[*]From the Steam Menu, select Settings  \t[*]From the settings list, click Interface  \t[*]Uncheck \u0022Enable hardware video decoding, if supported\u0022  \t[*]Click OK and Restart Steam  \t[*]Play the Streaming Video to test this change  [/olist]\n[url id=15][/url]\n[h2]What are the \u0022additional components\u0022 required for playback?[/h2]When the Steam Client starts up, a set of components required to playback DRM encrypted content is downloaded. If you receive a message indicating the additional components failed to download, you can attempt to download and install the components manually. This may be necessary if your ISP restricts access to certain domains or URLs.\n\nIf you have issues completing the steps below, please create a support ticket at [url=https://help.steampowered.com]https://help.steampowered.com[/url] and we\u0027ll be happy to assist you step by step.    Please visit this FAQ outside of the Steam Client before completing any of the following steps.\n\nYou can find this FAQ by visiting the Steam store page for the video you are attempting to watch and then clicking on the Streaming Videos on Steam FAQ link in the Steam Video section.\n\n[u][b]Windows 7 and above[/b][/u]\n[olist]  \t\n[*]Quit Steam. And I repeat, you must quit Steam, completely.  \t\n[*]If using Windows 32-bit, download [url=https://redirector.gvt1.com/edgedl/widevine-cdm/1.4.9.1088-win-ia32.zip]https://redirector.gvt1.com/edgedl/widevine-cdm/1.4.9.1088-win-ia32.zip[/url]  \t\t\n[list]\n[*]Unzip the downloaded file and copy the files contained in the zip file to C:\\Users\\[yourusername]\\AppData\\Local\\Steam\\widevine\\win-ia32\\\n[/list]  \t  \t\n[*]If using Windows 64-bit, download [url=https://redirector.gvt1.com/edgedl/widevine-cdm/1.4.9.1088-win-x64.zip]https://redirector.gvt1.com/edgedl/widevine-cdm/1.4.9.1088-win-x64.zip[/url]  \t\t\n[list]\n[*]Unzip the downloaded file and copy the files contained in the zip file to C:\\Users\\[yourusername]\\AppData\\Local\\Steam\\widevine\\win-x64\\\n[/list]  \t  \t\n[*]Restart Steam and attempt to play the video  \n[/olist]\n[u][b]MacOSX[/b][/u]\n[olist]  \t\n[*]Quit Steam. And I repeat, you must quit Steam, completely.  \t[*]Download [url=https://redirector.gvt1.com/edgedl/widevine-cdm/1.4.9.1088-mac-x64.zip]https://redirector.gvt1.com/edgedl/widevine-cdm/1.4.9.1088-mac-x64.zip[/url]  \t[*]Unzip the downloaded file and copy the files contained in the zip file to ~/Library/Application Support/steam/config/widevine (you may need to create the widevine folder)  \t[*]Restart Steam and attempt to play the video\n[/olist]\n[u][b]Linux[/b][/u]\n[olist]  \t[*]Quit Steam. And I repeat, you must quit Steam, completely.  \t[*]Download [url=https://redirector.gvt1.com/edgedl/widevine-cdm/1.4.9.1088-linux-x64.zip]https://redirector.gvt1.com/edgedl/widevine-cdm/1.4.9.1088-linux-x64.zip[/url]  \t[*]Unzip the downloaded file and copy the files contained in the zip file to ~/.steam/steam/config/widevine (you may need to create the widevine folder)  \t[*]Restart Steam and attempt to play the video  [/olist]\n[url id=16][/url]\n[h2]I am receiving an error about failing to retrieve a required license, what do I do?[/h2]For DRM encrypted videos, Steam must be able to allocate a license to begin playback. If you receive an error message indicating a license could not be retrieved, please restart Steam and attempt to watch the video again.\n[url id=17][/url]\n[h2]I am receiving an error about HDCP, what do I do?[/h2]If you receive a HDCP (High-Bandwidth Digital Content Protection) error when attempting to playback a video, you will need to use your graphic card control panel to determine which monitors are not HDCP enabled and disable them.\n[url id=6][/url]\n[h2]I\u0027ve received an error message while streaming, what should I do?[/h2][list]  \t[*]If you receive an Access Denied message, make sure you are still logged into Steam and own the video you are attempting to play  \t[*]If you receive a network issue, please close the video window and click Watch to start the video again. Network issues are often temporary and should resolve quickly.  \t[*]If you are suffering from regular buffering during playback, make sure Auto is selected in the Quality settings.  \t[*]For any other error messages, please post the issue to the discussion forum for the video or related game.  [/list]\n[url id=7][/url]\n[h2]How can I provide feedback on streaming the video?[/h2][list]  \t[*]During playback, performance logs may be captured and sent back to Steam to assist in analyzing playback issues. No personal information is collected. If you have technical issues regarding playback, please contact Steam Support to help identify and resolve the issues.  \t[*]If you have additional feedback, please post in the discussion forum or write a review for the video or related game  [/list]\n[url id=8][/url]\n[h2]How can I remove the video from my Steam Library?[/h2][olist]  \t[*]Browse to [url=https://store.steampowered.com/account/]https://store.steampowered.com/account/[/url]  \t[*]Sign in with your Steam account  \t[*]From the Licenses \u002B Subscriptions section find the video you wish to remove from your Library  \t[*]Click the Remove link associated with the video. Confirm the removal.  \t[*]Restart the Steam Client if the video isn\u0027t removed immediately  [/olist]\n[url id=10][/url]\n[h2]How can I filter out streaming videos on the Steam store?[/h2]We know every Steam user is unique and some users are not interested in video content on Steam. To stop video content appearing in your recommendations, discovery queues, etc., please follow these steps:\n[olist]  \t[*]Log in to the Steam Client  \t[*]From the Store menu, select Featured  \t[*]Hover over the main rotating capsule until the customize button appears  \t[*]Select Preferences and from the list that appears, turn off Videos  \t[*]Scroll down to Discovery Queue Preferences  \t[*]Open the links to Discovery and New Release queues and turn off Videos for both.   [/olist]\n[url id=11][/url]\n[h2]How do I download the video instead of streaming it?[/h2]At this time there is no option to download a streaming video.\n\nThe streaming solution allows rapid development and Steam to support features such as:\n\n[list]  \t[*]A consistent video playback experience across Windows, MacOSX, Linux and Steam Machine and Steam Link  \t[*]Closed captions in multiple languages with display customization options  \t[*]Instant watch without requiring a full download of the video file  \t[*]Alternate audio and video tracks for dubbed audio, commentary, alternate angles, etc.   \t[*]Integration into the Steam Client, Steam profile and community features (trading cards, playtime tracking, etc.)  \t[*]Steam and XInput Controller support in Big Picture Mode  [/list]\n[url id=known][/url]\n[h2]Known Issues[/h2][list]  \t[*]Playback performance in the Steam Client may be degraded on lower-end CPUs. Manually switching to a lower resolution and bit rate may help with this issue.  [/list]\n[url id=20][/url]\n[h2]How Can I Get My Film/Video on Steam?[/h2][list]  \t[*]Please see [url=https://help.steampowered.com/en/faqs/view/43C0-D88B-67A4-753E]this article[/url] for more information.  [/list]\n[hr][/hr]\n[url id=360][/url]\n[h1]Steam 360 Video FAQ[/h1]\nConsumers with a SteamVR compatible Virtual Reality headset can be immersed in these videos using our streaming video technology in their HMD. For consumers without a SteamVR compatible headset, a version of the player is available for watching videos on their desktop monitors.\n[url id=360_install][/url]\n[h2]Installing the Steam 360 Video Player[/h2][olist]    [*]Check the [url=#360_sysreqs]system requirements[/url] below. At the start of this beta, Windows 10 64-bit is a requirement.    [*]The Steam 360 Video tool requires a Steam Client released on or after April 25th 2017. If you aren’t running the latest Steam Client, make sure to update from the Steam menu, Check for Steam Client Updates...    [*]For HMD support, make sure SteamVR is installed. You’ll find that in your Steam Client in the Library in your Tool category, or you can use the search box to search \u0022SteamVR\u0022 to find it quickly. [*]For non-HMD playback, SteamVR is not required but there is currently no support for stereo playback.    [*]In your Steam Library, you’ll find the Steam 360 Video tool. You can use the search box to search \u0022Steam 360\u0022 to find it quickly. Click on it, then click Install. A small download will occur and the player will be installed. Alternatively, the first time you attempt to watch a 360 video, you will be prompted to install the 360 video player.  [/olist]\n[url id=360_content][/url]\n[h2]What\u0027s available to watch now?[/h2]To get started, take a look at this page to see what\u0027s on offer today: [url=http://store.steampowered.com/search/?tags=776177\u0026category1=992]Steam 360 Videos[/url]\n\nOnce a 360 video has been added to your Steam Library, you’ll find it by searching the name of the video in your Library. Look for videos that have a [360] suffix added to their name. 360 videos will also appear in a VR category of the Library.\n[url id=360_sysreqs][/url]\n[h2]What are the system requirements to play a Steam 360 Video?[/h2]The minimum specifications for 360 video playback today are essentially the same as the minimum specs for your Virtual Reality HMD. Specifics are outlined on the store page for a video but in general are:\n\n[list]    [*]OS: Windows 10, 64-Bit Only    [*]Processor: Intel® i5-4590, AMD FX 8350 equivalent or better    [*]Memory: 4 GB RAM    [*]Graphics: NVIDIA GeForce® GTX 970, AMD Radeon™ R9 290 equivalent or better    [*]Network: Broadband Internet connection    [*]Storage: 50 MB available space  [/list]\n\nPlease be aware that playing back a 4K x 4K stereo video requires at least a GTX 1070 or equivalent AMD graphics card. If your computer cannot maintain playback at full resolution, a lower resolution will be automatically selected. A future update to the Steam 360 Video platform will introduce stereo FOVAS (see [url=#360_formats]360 Formats[/url] below) which will reduce the required bandwidth and video card requirements.\n[url id=360_controls][/url]\n[h2]How do I control the Steam 360 Video player?[/h2][b]HTC Vive Controllers[/b]  [list]    [*]If you have an HTC Vive, the controller should appear while you are watching the video in the HMD.    [*]Click up on the touch pad to pause or play the video.    [*]Click left or right on the touch pad to skip forward and back.    [*]Click down on the touch pad to stop the video.     [*]The current play time and play state will be shown just above the first active controller in the HMD.  [*]Pull the trigger and you\u0027ll be shown the current quality level. Then click up or down to change to a different quality level. Click right (the A in a circle) and the video will go back to Automatic quality mode.   [/list]\n\n[b]Oculus Touch Controllers[/b]  [list]    [*]If you have an Oculus Touch, the controller should appear while you are watching the video in the HMD.    [*]Push up on either thumbstick to pause or play the video.    [*]Push left or right on either thumbstick to skip forward and back.    [*]Push down on either thumbstick to stop the video.     [*]The current play time and play state will be shown just above the first active controller in the HMD.    [*]Pull either trigger and you\u0027ll be shown the current quality level. Then push up or down to change to a different quality level. Push right and the video will go back to Automatic quality mode.     [/list]\n\n[b]Gamepad / XInput Devices[/b]\t  [list]    [*]If you have a gamepad, the video UI will show up in a fixed position (either the forward direction in the HMD or at the bottom of the desktop window)     [*]Push up on either thumbstick to pause or play the video.    [*]Push left or right on either thumbstick to skip forward and back.    [*]Push down on either thumbstick to stop the video.     [*]The current play time and play state will be shown just above the first active controller in the HMD.    [*]Pull either trigger and you\u0027ll be shown the current quality level. Then push up or down to change to a different quality level. Push right and the video will go back to Automatic quality mode.     [*]Note: Gamepad input does not work if you are using an HTC Vive controller setup.  [/list]\n\n[b]Keyboard[/b]  [list]    [*]If you are using a keyboard, the video UI will show up in a fixed position (either the forward direction in the HMD or at the bottom of the desktop window)     [*]Press the space bar on the keyboard to pause or play the video.    [*]Press the left or right arrow keys to skip forward and back.    [*]Press escape to quit the video.    [*]Press up or down on the arrow keys to switch between the different quality modes.    [*]Press A to switch back into automatic quality mode.    [/list]\n\n[b]Mouse Mode[/b]  [list]    [*]A mouse can be used when an HMD is not present and SteamVR is not installed. The 360 video will appear in a window on the desktop monitor.     [*]Left-click and drag in the window to move the around in the 360 video.    [*]Right-click to show and hide the analytics and help information.    [*]Keyboard input must be used for seeking or pausing the video at this time.\n[/list]\n[url id=360_formats][/url]\n[h2]What do the 360 Formats on the store page mean?[/h2]There are 4 variations of 360 videos currently supported on Steam. Depending upon how the content creator has configured the video, you will see a combination of 1 or 2 and, 3 or 4.\n\n[olist]    [*][b]Mono[/b] – This means the video was captured from a single position in space (whether virtual or real space) and the result is both eyes in the VR HMD are shown the same image. While you can look around, there will be no sense of depth in the video during playback.    [*][b]Stereo[/b] – This means the video was captured from two positions in space (whether virtual or real space) and the result is each eye in the VR HMD sees a slightly different image. When combined, this provides depth and distance in a 360 video.    [*][b]Equirectangular[/b] – When you look at a map of the Earth on a wall, you’re often seeing an equirectangular projection. It’s flattened so you can see all of the Earth at once, but distorts the content toward the top and bottom. 360 videos use this technique to capture and playback a 360 view in a rectangular video frame. When the video is played back, the flattened video frame is wrapped around a sphere to restore the original 360 view.    [*][b]FOVAS (Field of View Adaptive Streaming)[/b] – When using FOVAS, the amount of network bandwidth needed is reduced by presenting only the content directly in front of the user’s eyes with the highest level of detail. The rest of the 360 view is lower quality. As the user moves their head around, a different area of detail is then loaded to maintain the lower bandwidth requirements.[/olist]\n\n",
  "title": "Streaming Videos on Steam",
  "timestamp": "2021-12-02T22:56:52+00:00"
}