{
  "faq_id": 4285668986312724366,
  "language": 0,
  "version": 3,
  "content": "How do I setup a Mann vs Machine server?\n\n[h4]MvM General Server Requirements:[/h4][list]  \t[*]Your server hardware must be able to run at least a single 32 slot TF2 server.[/*]  \t[*]Your server must be set to 32 players. Include \u0022[b]\u002Bmaxplayers 32[/b]\u0022 in the server command line.[/*]  \t[*]You cannot have any non-mvm maps in the MvM mission cycle file found in [i]tf/tf_mvm_missioncycle.res [/i][/*]  \t[*]You must start your server on any MvM map. Include \u0022[b]\u002Bmap mvm_decoy[/b]\u0022 for example in your command line or \u0022[b]map mvm_decoy[/b]\u0022 in your autoexec.cfg.[/*]  [/list]    [h4]MvM Matchmaking Server Requirements:[/h4]To include your MvM server in the TF2 matchmaking system which will send players who choose Boot Camp in the Co-Op screen to your server you must do the following:\n\n[list]  \t[*]Set [b]tf_mm_servermode 1[/b]    \t[olist]\n\n[*]A value of 0 will opt your server out of all matchmaking (Default).[/*]  \t\t[*]A value of 1 (or higher) will opt your server into matchmaking. The lobby system will control the current map on the server.  Currently, community servers can only participate in MvM matchmaking.[/*]  \t[/olist]  \t[/*]  \t[*]Clear or remove any [b]sv_password[/b] value that you may have set. You server cannot be passworded.[/*]  [/list]\n\n[h3]What does [b]tf_mm_strict[/b] do and how do I set it?[/h3][b]tf_mm_strict[/b] can be used to limit the visibility of your server and who can join it and can be set anytime. Setting this convar to 1 requires [b]tf_mm_servermode [/b]be set.\n\n[list]  \t[*][b]tf_mm_strict \u0022#\u0022 [/b]    \t[olist]\n\n[*]A value of 0 will disable this feature and allow your server to accept both quickplay beta, matchmaking and server browser traffic (Default)[/*]  \t\t[*]A value of 1 will hide your server from the server browser and only allow players to connect from the matchmaking system. Note: If a player has favorited your server, it will still appear in their favorites however they will not be able to connect.[/*]  \t\t[*]A value of 2 will hide your server from the server browser and only accept direct connections to the server from a user\u0027s favorites, friends game or connect command.[/*]  \t[/olist]  \t[/*]  [/list]",
  "title": "TF2 Mann vs Machine Server Overview",
  "timestamp": "2021-10-27T22:48:17+00:00"
}