{
  "faq_id": 3345787685456414980,
  "language": 0,
  "version": 3,
  "content": "[list]  \t[*][url=#whatis]What are trade and market confirmations?[/url][/*]  \t[*][url=#how]How do confirmations work?[/url][/*]  \t[*][url=#why]Why are confirmations necessary?[/url][/*]  \t[*][url=#optout]How do I opt out?[/url][/*]  \t[*][url=#notrecognized]What do I do if I receive a confirmation for a trade or listing I didn\u0027t create?[/url][/*]  \t[*][url=#phone]How do I get confirmations via phone?[/url][/*]  [/list]\n\n[h3][url id=whatis][/url]What are trade and Market confirmations?[/h3]Trade confirmations are the final step in the trade process where you verify trades before they are completed. Market confirmations are the same as trade confirmations, the final step in the process of listing an item on the Market that ensures your items cannot be listed or sold without your approval. If you\u0027re using a Mobile Authenticator through the Steam Mobile App on your smartphone, you\u0027ll receive confirmations via the app, otherwise you\u0027ll receive them by email.\n\n[h3][url id=how][/url]How do confirmations work?[/h3]When you send a trade offer, accept a trade, or create a Market listing you\u0027ll need to confirm that action through email or the mobile app before it will be sent or posted. If you don\u0027t confirm it, the trade will not be made (or the Market listing will not be posted.)\n\n[h3][url id=why][/url]Why are confirmations necessary?[/h3]Confirmations give you better control over items moving in and out of your account. You have the opportunity to review the items in a trade or make sure you\u0027ve entered the right price for a Market listing before it is final. If your account or computer becomes compromised, confirmations make it very difficult for an attacker to steal your items.\n\n[h3][url id=optout][/url]How do I opt out?[/h3]To ensure that you are in control of items moving out of your account, trades and Market listings must be confirmed. There is no longer a way to opt out.\n\n[h3][url id=notrecognized][/url]What do I do if I receive a confirmation request for a trade or listing I didn\u0027t create?[/h3]Open the confirmation request and cancel the trade or listing. It\u0027s possible that your account or computer has been compromised. Use [url=https://help.steampowered.com]https://help.steampowered.com[/url] to change your Steam account password and consider changing your email account password as well. If you\u0027re unable to log in to Steam with your account credentials you should contact Steam Support to regain access.\n\n[h3][url id=phone][/url]How do I get confirmation requests via phone?[/h3]You can get confirmation requests through the Steam Mobile App on your smartphone if you\u0027re using it to protect your account. Set up the app to act as a Mobile Authenticator and you\u0027ll automatically receive confirmations in the app.\n\nHere\u0027s where you can [url=http://store.steampowered.com/mobile]download and learn more about the Steam Mobile App[/url].\n\n",
  "title": "Trade and Market Confirmations"
}