{
  "faq_id": 9067654268722456352,
  "language": 0,
  "version": 5,
  "content": "[h1]Check the Connection[/h1]\nSometimes microphone issues are just a small oversight, which can easily happen to anyone. Ensure your mic is plugged into the correct port on your sound card. Most analog mic connections are pink and belong in the corresponding pink connector on your sound device. Some devices aren\u0027t color coded, and that\u0027s when it is time to consult the manual for your sound device.\n\n\n[h1]USB Mics[/h1]\nTry swapping ports. If you\u0027re using a USB port on the front of your case, switch it to one of the ones in the back. If you\u0027re using a USB hub, try bypassing the hub and see if that makes any difference.\n\n\n[h1]Check your drivers[/h1]\nThis applies to both your mic (for USB) and your sound device. Check the manufacturer of your sound device and visit their website for driver updates. If you\u0027re not sure where to find this information, check your motherboard\u0027s manual (for on-board sound) and/or consult the manufacturer of your PC.\n\n\n[h1]Checking the Mic settings in the game[/h1]\nOnce you\u0027re sure your microphone is correctly connected and properly configured in your operating system; the next thing to look at is the mic settings in-game.  To open these settings, open your Friends \u0026 Chat in the bottom right of the Steam client and selecting the gear icon in the upper right. \n\n[img]{STEAM_CLAN_IMAGE}/1976/22cd036496e947a45c5ea39c1154d9e377459a75.png[/img]\n\nSelect [b]\u0022Voice\u0022[/b] - from here you can use the button \u0022Start Microphone Test\u0022 to test your mic settings (expect echoes if you don\u0027t have earphones!) \n\n[img]{STEAM_CLAN_IMAGE}/1976/d62f1004ee814d5b8797cf7e91232d4cf43bc796.png[/img]\n\nIf it works, go ahead and test it in-game.  Make sure you have the correct \u0022Voice Transmission Type\u0022 selected. If using \u0022Push to Talk\u0022 make sure your voice key is correctly bound to the right of \u0022Push-to-talk hotkey assigned as\u0022.\n\nIf it isn\u0027t working in-game, then the issue is probably that the mic input is being switched when you launch the game.\n\nOne last thing to keep in mind is that the Server can control if your mic is allowed to work at all, as well as what codec and sound quality is used. If you have everything configured properly and your mic still doesn\u0027t seem to work in-game, always try several different servers to make sure it isn\u0027t just a Server issue.\n\nNote: Your microphone will not work while you are in Spectator mode.\n\n\n[h1]Bad Voice Quality[/h1]\nBad voice quality can stem from a few different causes. Below are some examples of situations where the quality is affecting the voice chat in-game:\n[list]\n[*][h3]Feedback/Echoing[/h3]\nNormally feedback will occur if you have your speakers cranked while using the mic. It is recommended that you use a headset with earphones so that your communication is clear to other players. Certain low-grade microphones are omni-directional, meaning they will pick up sounds from all directions - including your stereo/surround speakers. Turn your audio devices down and see if your voice quality improves.\n[*][h3]Low Volume[/h3]\nCertain microphones need a boost. This can be configured by checking the operating system\u0027s mic settings.\n[*][h3]Crackling/Distortion[/h3]\nMany times bad voice quality is due to a faulty cable or a bad connection. Check the connection of your mic to your PC. If the connection is loose, it may be the reason why your voice quality is not clear. If you experience the same issue in other applications, you may want to consider getting a different mic to test with. Inexpensive, low-grade mics have often times been shunned on quality to keep the price low.\n\nAlso, make sure the mic is not too close to your mouth. If it is touching your face or lips as you use it, put it away so that it is about 1 inch away from your mouth. If there\u0027s no windscreen on the mic itself, try moving it even further away.\n[/list]\n\n\n[h1]Effective Troubleshooting[/h1]\nTo effectively troubleshoot any technical issue, it\u0027s good to have a plan to consistently narrow down the potential cause with each step taken. A system that should be applicable to many cases follows, but make sure that you tailor it to your specific problem and setup:\n[olist]  \t    \n[*]Take steps to determine if the problem is hardware or software.  \t    \n[*]Determine if the problem is universal, or unique to a specific situation. \t    \n[*]Check to make sure that all settings are inherited correctly. Is your operating system using the correct device? If applicable (if the game uses Steam Voice systems) is Steam using the correct device? Do the game\u0027s settings reflect the correct device? \t\n[/olist]\nAs a basic starting place, answering these questions should help direct your troubleshooting efforts.\n\n",
  "title": "Troubleshooting Microphone Problems"
}