{
  "faq_id": 7393273865525372396,
  "language": 0,
  "version": 5,
  "content": "[list]  \t[*][url=#trouble]Troubleshooting Network Connectivity Issues[/url][/*]  \t[*][url=#ports]Required Ports for Steam[/url][/*]  \t[*][url=#isp]Known Issues with Internet Service Providers (ISPs)[/url][/*]  [/list]\n\n[h3]Troubleshooting Network Connectivity Issues[/h3]Please follow the steps below to diagnose network connectivity issues within Steam:\n\n[olist]  \t[*][b]Check Steam Server Status[/b]\nPlease check the [url=https://store.steampowered.com/stats/]Steam Server Status page[/url] to ensure the issue which you are encountering is [b]not[/b] related to system-wide downtime. If you encounter any timeout errors when attempting to access Steam sites, it is very likely that there is a system-wide issue and Steam will not be accessible until the issue is resolved.[/*]  \t\n[*][b]Test Your Router[/b]\nThe [url=https://help.steampowered.com/en/faqs/view/46D2-B5B1-F0B9-B867]Using a Router with Steam[/url] topic includes steps to isolate problems if they occur at the router.\n\nWireless and powerline connections can cause intermittent failures due to interference. If possible, test Steam with a direct wired connection to determine if this is a problem. An Internet speed test may also help you identify problems related to local link quality.[/*] \n[*][b]Troubleshoot all Firewalls[/b]\nSee the [url=https://help.steampowered.com/en/faqs/view/66C8-4FF1-8470-B666]Using a Firewall with Steam[/url] topic for instructions to test and configure your firewall for Steam.\n\n[b]Note:[/b] If you are installing Steam for the first time or Steam has recently been updated, a firewall may be preventing Steam from connecting to the Steam Network - even if Steam worked correctly before the update was applied.[/*]  \t\n[*][b]Disable Background Applications[/b]\nReview the [url=https://help.steampowered.com/en/faqs/view/1F39-DCB4-FF28-5748]Programs Which May Interfere With Steam[/url] and reconfigure, disable or uninstall any programs which may be preventing Steam and Valve games from connecting.[/*]  \t\n[*][b]Viruses, Trojans, Adware and Spyware[/b]\nScan your computer for [url=https://help.steampowered.com/en/faqs/view/70D4-67C8-784D-692A]Spyware, Malware, Adware, or Virus Interfering with Steam[/url].[/*]  [/olist]\n\n[url id=ports][/url]\n[h3]Required Ports for Steam[/h3]All required ports to run the Steam application are listed [url=https://help.steampowered.com/en/faqs/view/2EA8-4D75-DA21-31EB]here[/url].  It is possible that other games available on Steam will require further ports to be available.\n\n[section style=note]  [h3]Note:[/h3]Many university networks and proxies block required ports for Steam operation - please consult your network administrator to ensure the required ports are open if you are using a university network or a proxy. [b]Ports required for Steam can not be re-mapped to HTTP or reconfigured to a custom port range.[/b][/section]\n\n[url id=isp][/url]\n[h3]Known Issues with Internet Service Providers (ISPs)[/h3][section style=important]  [h3]Important:[/h3]If you notice that your Steam connection only has issues during certain hours of the day (for example in the evenings between 5pm and 11pm), it is possible that your ISP is blocking or \u0022shaping\u0022 your connection.  Please test your connection at other hours of the day and contact your ISP directly if you believe this is causing the connection issue.[/section]\nSome ISPs have been found to block ports required for the proper operation of Steam and Steam games:\n[list]  \t[*][b]012.net [/b](Steam traffic blocked)[/*]  \t[*][b]Bluewin[/b] (Firewall blocks Steam from provider side - must be disabled through provider\u0027s service portal)[/*]  \t[*][b]Dutch Telecom[/b] (Steam traffic blocked)[/*]  \t[*][b]ISPFree[/b] (Steam traffic blocked)[/*]  \t[*][b]Micronet Broadband[/b] (Steam traffic blocked)[/*]  \t  [/list]\n\n",
  "title": "Troubleshooting Network Connectivity",
  "timestamp": "2021-08-12T01:54:58+00:00"
}