{
  "faq_id": 3494694514230243911,
  "language": 0,
  "version": 6,
  "content": "[h1]Contact Steam Support[/h1]\nDo not return items without contacting us first. Make sure you have worked with [url=https://help.steampowered.com/en/wizard/HelpWithSteamHardware]Steam Support[/url] to initiate a return or a replacement.\n\nIf you have questions about whether you qualify for a refund or replacement, see our [url=https://help.steampowered.com/en/faqs/view/4E41-6123-79EF-25BA]Hardware Warranty[/url] and [url=https://store.steampowered.com/hardware_order_terms]Hardware Refund Policy.[/url]\n\nSteam Support will provide \u0022Return Merchandise Authorization\u0022 (RMA) forms that we will use to process your return. In most cases, Steam Support will also provide you with a prepaid shipping label for your package.\n\nIf you are returning multiple items, make sure you have included all RMA forms you received from Steam Support. You can return multiple items in the same package, but each RMA form will need to be included to avoid delays in processing.\n\n[b]Important[/b]: If you are returning a Steam Deck, back up your game installs and any other data you\u0027d like to keep via a microSD card or another external storage device, then perform a factory reset by pressing the Steam button and going to Settings \u003E System \u003E Reset to factory state. It\u0027s OK to skip this step if your device is not functional. Valve is not responsible for the loss of any data left on your device.\n\n[hr][/hr]\n[h1]How to pack your hardware[/h1]\nUse the product\u0027s original packaging whenever possible. If you are unable to do so or you are returning a component part for replacement, please follow the instructions below to ensure no damage occurs while your package is in transit.\n[h4]Choose the right materials[/h4]\nIf you no longer have the original packaging, obtain protective packing materials and a sturdy shipping box that is the right size to accommodate the packed hardware. The box should not allow room for excessive movement, as this may damage the product during transport. Valve is not responsible for damage sustained during transit.\n[h4]Prepare your package[/h4]\nWrap your hardware so that it is evenly protected. See the examples below for guidance on packing individual devices.\n\n\n[expand type=title title=\u0022Steam Deck\u0022]\nBack up your data and factory reset your device. \n\nPack your Steam Deck in the original case.\n[img]{STEAM_CLAN_IMAGE}/39983882/e17df36ecdc9d11353377256629d64d997eb7001.png[/img]\n\nIf you have the original packaging, you can use it for your return. \nIf you are located in the UK, Ireland, or certain EU island territories, you may receive instructions from Steam Support to avoid using the original packaging when preparing your return. Be sure to follow the instructions from your customer support ticket to avoid customs delays. \n\n[img]{STEAM_CLAN_IMAGE}/39983882/d2a23579276171f8f80660b8b33466c479c009db.png[/img]\n\nIf you don\u0027t have the original packaging, place the case into an appropriately sized box. If necessary, use filler to prevent it from moving around during transit.\n[img]{STEAM_CLAN_IMAGE}/39983882/8c2c0c4faee970cc8acd6b6c193fca837bac0d46.png[/img]\n\nDon\u0027t have the original case? Wrap the device in protective film or bubble wrap.\n[img]{STEAM_CLAN_IMAGE}/39983882/a8f68b5ad8a0b2c5001c7ea258fdfd88601f10e2.png[/img]\n\nThen pack securely in an appropriately sized box.\n[img]{STEAM_CLAN_IMAGE}/39983882/8029ac8c5d8e1d2ca7ab98921679583c6e6de17d.png[/img]\n[/expand]\n[expand type=title title=\u0022Index Base Station\u0022]\nKeep your wall mount, power supply, and charging cable, as replacements will not include these components. Pack the box snugly so the device doesn\u0027t move around during transit.\n[img]https://support.steampowered.com/steamvr/Packaging_Instructions/Base_Bubble_Open.jpg[/img]\n[/expand]\n[expand type=title title=\u0022Index Controller\u0022]\nKeep your USB charging cable, as replacements will not include one. Wrap in bubble or other protective material.\n[img]https://support.steampowered.com/steamvr/Packaging_Instructions/Knuckles_box_snug.jpg[/img]\n[i]Note: Image shows device orientation. Make sure to wrap your device completely before taping the box shut for additional protection.[/i]\n[/expand]\n[expand type=title title=\u0022Index Headset\u0022]\nUse the adjustment knobs to make sure the headset is as compact as possible. Place the headset flat in the package. Be sure the device\u0027s weight is not resting on the audio arms.\n[img]https://support.steampowered.com/steamvr/Packaging_Instructions/HMD_flat.jpg[/img]\n[i]Note: Image shows device orientation. Make sure to wrap your device completely before taping the box shut for additional protection.[/i]\n[/expand]\n[h4]Include your documents[/h4]\nInclude any RMA forms you received from Steam Support inside the return package and make sure that the serial numbers of your devices match the numbers on the RMA form.\n\nEnsure that you include any other specified components with your return. You may experience delays in processing if the instructions from Steam Support are not followed.\n\nDo not send any unspecified items with your return. Additional items will not be returned to you.\n[h4]Finalize shipment[/h4]\n[list]\n[*]Check to make sure you\u0027ve included everything, including the RMA form.\n[*]Seal the box well with packing tape and attach your shipping label to the box. In some regions, you will also need to attach other documentation. Steam Support will provide you with instructions.\n[*]Record the tracking number from the shipping label and keep it in a safe place.\n[*]Ship the package and keep your shipping receipt.\n[*][url=https://help.steampowered.com/en/wizard/HelpWithSteamHardware]Contact Steam Support[/url] if you have questions about your return.\n[/list]",
  "title": "Valve Hardware Return Packaging Guide",
  "timestamp": "2022-07-12T16:33:17+00:00"
}